#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutomationTest

#include "Basic.hpp"

#include "AutomationTest_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class AutomationTest.AutomationTestPlatformSettings
// 0x0010 (0x0038 - 0x0028)
class UAutomationTestPlatformSettings : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutomationTestPlatformSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutomationTestPlatformSettings")
	}
	static class UAutomationTestPlatformSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationTestPlatformSettings>();
	}
};
DUMPER7_ASSERTS_UAutomationTestPlatformSettings;

// Class AutomationTest.AutomationTestExcludelistSettings
// 0x0010 (0x0048 - 0x0038)
class UAutomationTestExcludelistSettings final : public UAutomationTestPlatformSettings
{
public:
	TArray<class FName>                           SupportedRHIs;                                     // 0x0038(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutomationTestExcludelistSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutomationTestExcludelistSettings")
	}
	static class UAutomationTestExcludelistSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationTestExcludelistSettings>();
	}
};
DUMPER7_ASSERTS_UAutomationTestExcludelistSettings;

// Class AutomationTest.AutomationTestExcludelistConfig
// 0x0068 (0x00A0 - 0x0038)
class UAutomationTestExcludelistConfig final : public UAutomationTestPlatformSettings
{
public:
	class FString                                 TaskTrackerURLHashtag;                             // 0x0038(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 TaskTrackerURLBase;                                // 0x0048(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAutomationTestExcludelistEntry> ExcludeTest;                                      // 0x0058(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutomationTestExcludelistConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutomationTestExcludelistConfig")
	}
	static class UAutomationTestExcludelistConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationTestExcludelistConfig>();
	}
};
DUMPER7_ASSERTS_UAutomationTestExcludelistConfig;

// Class AutomationTest.AutomationTestExcludelist
// 0x00A8 (0x00D0 - 0x0028)
class UAutomationTestExcludelist final : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UAutomationTestExcludelistConfig*       DefaultConfig;                                     // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class UAutomationTestExcludelistConfig*> PlatformConfigs;                      // 0x0080(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AutomationTestExcludelist")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AutomationTestExcludelist")
	}
	static class UAutomationTestExcludelist* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationTestExcludelist>();
	}
};
DUMPER7_ASSERTS_UAutomationTestExcludelist;

}

