#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GbxBlockout_Actor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_Blockout_Shape_structs.hpp"
#include "Engine_structs.hpp"
#include "E_Blockout_SizeTemplate_structs.hpp"
#include "GbxDecorator_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GbxBlockout_Actor.BP_GbxBlockout_Actor_C
// 0x0098 (0x0428 - 0x0390)
class ABP_GbxBlockout_Actor_C final : public AGbxDecoratorActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UObject*                                BP_GbxBlockout_Constructor;                        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_Blockout_Shape                              Shape;                                             // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             Override_Shape;                                    // 0x03A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_Blockout_SizeTemplate                       Size_Template;                                     // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Collision;                                     // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2[0x6];                                      // 0x03D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Texture_Size;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Base_Color_Overlay;                                // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Texture_Offset;                                    // 0x03F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Relative_Offset;                                   // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Grid_Opacity;                                      // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCollisionProfile;                               // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCollisionProfileName                  CollisionProfile;                                  // 0x041C(0x0008)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GbxBlockout_Actor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GbxBlockout_Actor_C")
	}
	static class ABP_GbxBlockout_Actor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GbxBlockout_Actor_C>();
	}
};
DUMPER7_ASSERTS_ABP_GbxBlockout_Actor_C;

}

