#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Player_3rd

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "FaceFX_structs.hpp"
#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxGame_structs.hpp"
#include "PlayerCharacters_structs.hpp"
#include "BPAnim_Player_3rd_structs.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Player_3rd.BPAnim_Player_3rd_C
// 0x23A90 (0x253E0 - 0x1950)
class UBPAnim_Player_3rd_C final : public UOakCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct BPAnim_Player_3rd::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;            // 0x1958(0x004C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A4[0x4];                                     // 0x19A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x19A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_BlendSpaceGraph;            // 0x19B0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x19B8(0x0008)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x19C0(0x0020)()
	struct FGbxAnimNode_SlopeWarping              GbxAnimGraphNode_LegIK;                            // 0x19E0(0x0610)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1FF0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x2010(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x2038(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x2060(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x2088(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x20B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x20D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x2100(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x2128(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x2150(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x2178(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x21A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x21C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x21F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x2218(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x2240(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x2268(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x2290(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x22B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x22E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x2308(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x2330(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x2358(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x2380(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x23A8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_91;                // 0x23D0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x24C8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_90;                // 0x24E8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x25E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x2600(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x2628(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x2650(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_89;                // 0x2678(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x2770(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_29;              // 0x2790(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x2890(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_88;                // 0x28B0(0x00F8)()
	uint8                                         Pad_29A8[0x8];                                     // 0x29A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAnimNode_IdleTurns                 GbxAnimGraphNode_IdleTurns_4;                      // 0x29B0(0x0360)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x2D10(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x2D30(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x2E00(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_28;              // 0x2E20(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_27;                      // 0x2F20(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_87;                // 0x2FE8(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_86;                // 0x30E0(0x00F8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23;                  // 0x31D8(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_25;           // 0x3220(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_85;                // 0x3240(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_84;                // 0x3338(0x00F8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_22;                  // 0x3430(0x0048)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_24;           // 0x3478(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_83;                // 0x3498(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_23;           // 0x3590(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_82;                // 0x35B0(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_22;           // 0x36A8(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph_3;                   // 0x36C8(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x3730(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_27;              // 0x3750(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x3850(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x3870(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_81;                // 0x3898(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x3990(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x39B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x39D8(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_26;              // 0x3A00(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x3B00(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_80;                // 0x3B20(0x00F8)()
	uint8                                         Pad_3C18[0x8];                                     // 0x3C18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAnimNode_IdleTurns                 GbxAnimGraphNode_IdleTurns_3;                      // 0x3C20(0x0360)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0x3F80(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x3FA0(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0x4070(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_79;                // 0x4090(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0x4188(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x41A8(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_25;              // 0x41D0(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0x42D0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_78;                // 0x42F0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0x43E8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0x4408(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0x44D8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_77;                // 0x44F8(0x00F8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_26;                      // 0x45F0(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_76;                // 0x46B8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0x47B0(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_25;                 // 0x47D0(0x00E8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_75;                // 0x48B8(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_74;                // 0x49B0(0x00F8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_21;                  // 0x4AA8(0x0048)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_73;                // 0x4AF0(0x00F8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_20;                  // 0x4BE8(0x0048)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_72;                // 0x4C30(0x00F8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_24;              // 0x4D28(0x0100)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_19;                  // 0x4E28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0x4E70(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x4E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x4EB8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_71;                // 0x4EE0(0x00F8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_24;                 // 0x4FD8(0x00E8)()
	struct FGbxAnimNode_Locomotion                GbxAnimGraphNode_Locomotion_3;                     // 0x50C0(0x01E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_18;                  // 0x52A0(0x0048)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_23;              // 0x52E8(0x0100)()
	struct FGbxAnimNode_Locomotion                GbxAnimGraphNode_Locomotion_2;                     // 0x53E8(0x01E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_17;                  // 0x55C8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0x5610(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_70;                // 0x5630(0x00F8)()
	uint8                                         Pad_5728[0x8];                                     // 0x5728(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAnimNode_IdleTurns                 GbxAnimGraphNode_IdleTurns_2;                      // 0x5730(0x0360)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0x5A90(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0x5AB0(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0x5B80(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0x5BA0(0x00D0)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x5C70(0x0550)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0x61C0(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x6F88(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x7D50(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x8B18(0x0DC8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_36;                   // 0x98E0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_83;                    // 0x9960(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_35;                   // 0x9988(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_23;                 // 0x9A08(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_34;                   // 0x9AF0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x9B70(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_22;                 // 0x9BF0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_82;                    // 0x9CD8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_21;                 // 0x9D00(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x9DE8(0x0DC8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_81;                    // 0xABB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80;                    // 0xABD8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0xAC00(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79;                    // 0xAC80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0xACA8(0x0028)()
	struct FOakAnimNode_ArmIK                     OakAnimGraphNode_ArmIK;                            // 0xACD0(0x0A50)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0xB720(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0xB7A0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0xB7C8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_16;                  // 0xB848(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0xB890(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0xB8B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0xB8E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0xB908(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0xB930(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0xB958(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0xB980(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_22;              // 0xB9A8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0xBAA8(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_21;              // 0xBAC8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0xBBC8(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_20;              // 0xBBE8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0xBCE8(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_19;              // 0xBD08(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0xBE08(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_18;              // 0xBE28(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_25;                      // 0xBF28(0x00C8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_17;              // 0xBFF0(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_24;                      // 0xC0F0(0x00C8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_16;              // 0xC1B8(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_23;                      // 0xC2B8(0x00C8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_15;              // 0xC380(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0xC480(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0xC4A0(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0xC570(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_20;                 // 0xC598(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_15;                  // 0xC680(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0xC6C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0xC6F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0xC718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0xC740(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_69;                // 0xC768(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0xC860(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_68;                // 0xC880(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0xC978(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10;                    // 0xC998(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_67;                // 0xCA60(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_66;                // 0xCB58(0x00F8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_22;                      // 0xCC50(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_65;                // 0xCD18(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0xCE10(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0xCE30(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_14;                  // 0xCF00(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0xCF48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0xCF70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0xCF98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0xCFC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0xCFE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0xD010(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_19;                 // 0xD038(0x00E8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_64;                // 0xD120(0x00F8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_14;              // 0xD218(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_63;                // 0xD318(0x00F8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_2;               // 0xD410(0x0038)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_62;                // 0xD448(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_21;           // 0xD540(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_61;                // 0xD560(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_20;           // 0xD658(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_60;                // 0xD678(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_19;           // 0xD770(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_59;                // 0xD790(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_18;           // 0xD888(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_58;                // 0xD8A8(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_17;           // 0xD9A0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_57;                // 0xD9C0(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_16;           // 0xDAB8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_56;                // 0xDAD8(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_15;           // 0xDBD0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_55;                // 0xDBF0(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_14;           // 0xDCE8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_54;                // 0xDD08(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_13;           // 0xDE00(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph_2;                   // 0xDE20(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_9;                     // 0xDE88(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_13;                  // 0xDF50(0x0048)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_53;                // 0xDF98(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_12;           // 0xE090(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_52;                // 0xE0B0(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_11;           // 0xE1A8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_51;                // 0xE1C8(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_10;           // 0xE2C0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_50;                // 0xE2E0(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_9;            // 0xE3D8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_49;                // 0xE3F8(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_8;            // 0xE4F0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_48;                // 0xE510(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_7;            // 0xE608(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_47;                // 0xE628(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_6;            // 0xE720(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_46;                // 0xE740(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_5;            // 0xE838(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_45;                // 0xE858(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_4;            // 0xE950(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph_1;                   // 0xE970(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0xE9D8(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_13;              // 0xE9F8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0xEAF8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_44;                // 0xEB18(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0xEC10(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_43;                // 0xEC30(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0xED28(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_12;              // 0xED48(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0xEE48(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0xEE68(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_42;                // 0xEF38(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_41;                // 0xF030(0x00F8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0xF128(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0xF1A8(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xF228(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0xF248(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0xF2C8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0xF2F0(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_6;                      // 0xF318(0x0010)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_8;                     // 0xF328(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_12;                  // 0xF3F0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0xF438(0x0028)()
	struct FGbxAnimNode_LayeredBoneSetBlend       GbxAnimGraphNode_LayeredBoneSetBlend_1;            // 0xF460(0x0140)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0xF5A0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0xF5C8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0xF648(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0xF670(0x0028)()
	struct FGbxAnimNode_Rotation_AimOffset        GbxAnimGraphNode_Rotation_AimOffset_4;             // 0xF698(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0xF7F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0xF818(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0xF840(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0xF868(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0xF890(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_40;                // 0xF8B8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0xF9B0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_39;                // 0xF9D0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0xFAC8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_38;                // 0xFAE8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0xFBE0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_37;                // 0xFC00(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0xFCF8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0xFD18(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0xFD40(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0xFD60(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0xFE30(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0xFEB0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0xFF30(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_21;                      // 0xFF58(0x00C8)()
	struct FAnimNode_BlendFaceFXAnimation         AnimGraphNode_BlendFaceFXAnimation;                // 0x10020(0x0080)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x100A0(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x10120(0x0DC8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0x10EE8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x10FB0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x10FD8(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x11DA0(0x0DC8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x12B68(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_18;                 // 0x12BE8(0x00E8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_1;               // 0x12CD0(0x0038)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x12D08(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x12DD0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x12DF8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x12E78(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x12EA0(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17;                 // 0x13380(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x13468(0x0DC8)()
	struct FGbxAnimNode_LayeredBoneSetBlend       GbxAnimGraphNode_LayeredBoneSetBlend;              // 0x14230(0x0140)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x14370(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x143F0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x14418(0x0DC8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0x151E0(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x152C8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x15348(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x15370(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x15398(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x153C0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x15440(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x154C0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x155A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x155D0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_11;                  // 0x155F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x15640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x15668(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_11;              // 0x15690(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x15790(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0x157B0(0x00C8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_10;              // 0x15878(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x15978(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_36;                // 0x15A40(0x00F8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_9;               // 0x15B38(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x15C38(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x15C58(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x15D28(0x00D8)()
	struct FGbxAnimNode_Rotation_AimOffset        GbxAnimGraphNode_Rotation_AimOffset_3;             // 0x15E00(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x15F58(0x0DC8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x16D20(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x16D48(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0x16DC8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x16E90(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x16F10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x16F38(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x16F60(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x17048(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0x17070(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x17138(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x17160(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x17188(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x171B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x171D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x17200(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x17228(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x17250(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x17278(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_16;                      // 0x172A0(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_5;                      // 0x17368(0x0010)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_35;                // 0x17378(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x17470(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_15;                      // 0x17490(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_4;                      // 0x17558(0x0010)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_34;                // 0x17568(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x17660(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_14;                      // 0x17680(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3;                      // 0x17748(0x0010)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_33;                // 0x17758(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x17850(0x0020)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator_1;              // 0x17870(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x178F0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0x17910(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x17920(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x17940(0x00D0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x17A10(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x17AD8(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_13;                      // 0x17BC0(0x00C8)()
	struct FGbxAnimNode_Rotation_AimOffset        GbxAnimGraphNode_Rotation_AimOffset_2;             // 0x17C88(0x0158)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x17DE0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x17EC8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x17EF0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x17F70(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x17F98(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x18D60(0x0DC8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x19B28(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_32;                // 0x19B50(0x00F8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x19C48(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x19CC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x19CF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x19D18(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_31;                // 0x19D40(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x19E38(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_10;                  // 0x19F00(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x19F48(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x19F70(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x1A058(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x1A0D8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x1A100(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x1A1E8(0x0028)()
	struct FGbxAnimNode_Rotation_AimOffset        GbxAnimGraphNode_Rotation_AimOffset_1;             // 0x1A210(0x0158)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_12;                      // 0x1A368(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x1A430(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1A518(0x0DC8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_8;               // 0x1B2E0(0x0100)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator;                // 0x1B3E0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x1B460(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x1B4A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x1B4D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x1B4F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x1B520(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x1B548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x1B570(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x1B598(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1B5C0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_30;                // 0x1B5E8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x1B6E0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0x1B700(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x1B710(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_29;                // 0x1B730(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x1B828(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_28;                // 0x1B848(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x1B940(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_27;                // 0x1B960(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x1BA58(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x1BA78(0x00D0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x1BB48(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x1BC10(0x0048)()
	uint8                                         Pad_1BC58[0x8];                                    // 0x1BC58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakAnimNode_LegIK                     OakAnimGraphNode_LegIK;                            // 0x1BC60(0x06B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x1C310(0x00E8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_7;               // 0x1C3F8(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_11;                      // 0x1C4F8(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_10;                      // 0x1C5C0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x1C688(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x1C6B0(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x1C798(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x1C7C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x1C7E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x1C810(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x1C838(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x1C860(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x1C888(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x1C8B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x1C8D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x1C900(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_26;                // 0x1C928(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x1CA20(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_25;                // 0x1CA40(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x1CB38(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_24;                // 0x1CB58(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x1CC50(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_23;                // 0x1CC70(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_22;                // 0x1CD68(0x00F8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x1CE60(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x1CEA8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x1CEC8(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x1CF98(0x0DC8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x1DD60(0x0038)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1DD98(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x1DE60(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x1DF48(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x1DFC8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x1DFF0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x1E070(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x1E098(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x1E0C0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x1E0E8(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x1E1D0(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1E250(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_21;                // 0x1E318(0x00F8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x1E410(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x1E438(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x1E460(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9;                       // 0x1E488(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x1E550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x1E578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x1E5A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x1E5C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x1E5F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1E618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1E640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1E668(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x1E690(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x1E6B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x1E6E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x1E708(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x1E730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x1E758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x1E780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x1E7A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x1E7D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x1E7F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x1E820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x1E848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x1E870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x1E898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x1E8C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x1E8E8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_20;                // 0x1E910(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x1EA08(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_19;                // 0x1EA28(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x1EB20(0x0020)()
