#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Player_StandIn

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_classes.hpp"
#include "ControlRig_structs.hpp"
#include "GbxGame_structs.hpp"
#include "FaceFX_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Player_StandIn.BPAnim_Player_StandIn_C
// 0x5070 (0x69C0 - 0x1950)
class UBPAnim_Player_StandIn_C final : public UOakCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1958(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1960(0x0008)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1968(0x0010)()
	struct FGbxAnimNode_RandomOverride            GbxAnimGraphNode_RandomOverride_1;                 // 0x1978(0x02B8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1C30(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1CF8(0x0DC8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2AC0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2AE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x2B08(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2B30(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2BB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2BD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2C00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x2C28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2C50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x2C78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x2CA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2CC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2CF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2D18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2D40(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_6;                 // 0x2D68(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2E60(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_5;                 // 0x2E80(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2F78(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_4;                 // 0x2F98(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x3090(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_3;                 // 0x30B0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x31A8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_2;                 // 0x31C8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x32C0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_1;                 // 0x32E0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x33D8(0x0020)()
	struct FGbxAnimNode_RandomOverride            GbxAnimGraphNode_RandomOverride;                   // 0x33F8(0x02B8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer;                   // 0x36B0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x37A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x37C8(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x3898(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x38B8(0x0020)()
	struct FAnimNode_BlendFaceFXAnimation         AnimGraphNode_BlendFaceFXAnimation;                // 0x38D8(0x0080)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x3958(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3E38(0x00E8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x3F20(0x0DC8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x4CE8(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x4D68(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x5B30(0x0DC8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x68F8(0x0080)()
	int32                                         Temp_WeaponState;                                  // 0x6978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weap_ADSexit_none;                                 // 0x697C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weap_ADSenter_none;                                // 0x697D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weap_HasADSPose;                                   // 0x697E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weap_HasBodyPose;                                  // 0x697F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeapHasForegripPose;                               // 0x6980(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeapHasGripPose;                                   // 0x6981(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6982[0x2];                                     // 0x6982(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Delta_Time_X;                                      // 0x6984(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBackward;                                       // 0x6988(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_slots_Active_AllOffhand;                 // 0x6989(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_698A[0x6];                                     // 0x698A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LandVelocityAbs;                                   // 0x6990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FallPlayRate;                                      // 0x6998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AngularVel;                                        // 0x69A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_is_in_ffyl;                              // 0x69A4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_att_exo_auto_lock_active;                // 0x69A5(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_vehicle_is_airborne;                     // 0x69A6(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69A7[0x1];                                     // 0x69A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ATTRIBUTE_vehicle_ground_alpha;                    // 0x69A8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_slot_active_mode_offhand;                // 0x69AC(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_att_exo_buster_active;                   // 0x69AD(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_weapon_type_heavy;                       // 0x69AE(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69AF[0x1];                                     // 0x69AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ATTRIBUTE_can_use_weapon_while_sprinting;          // 0x69B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ATTRIBUTE_att_exo_heavy_arms_active;               // 0x69B4(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NOTConfimed___NOTSelected;                         // 0x69B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_OnIdleConfirmed();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void ExecuteUbergraph_BPAnim_Player_StandIn(int32 entrypoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPAnim_Player_StandIn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPAnim_Player_StandIn_C")
	}
	static class UBPAnim_Player_StandIn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_Player_StandIn_C>();
	}
};
DUMPER7_ASSERTS_UBPAnim_Player_StandIn_C;

}

