#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Player_1st

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "GbxGame_structs.hpp"
#include "OakGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "BPAnim_Player_1st_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Player_1st.BPAnim_Player_1st_C
// 0x20070 (0x219C0 - 0x1950)
class UBPAnim_Player_1st_C final : public UOakCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct BPAnim_Player_1st::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;            // 0x1958(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_196C[0x4];                                     // 0x196C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1970(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_BlendSpaceGraph;            // 0x1978(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1980(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1988(0x0020)()
	struct FOakAnimNode_FirstPerson               OakAnimGraphNode_FirstPerson;                      // 0x19A8(0x00E0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1A88(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1AA8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_158;                // 0x1AC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_157;                // 0x1AF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_156;                // 0x1B18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_155;                // 0x1B40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_154;                // 0x1B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_153;                // 0x1B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_152;                // 0x1BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_151;                // 0x1BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_150;                // 0x1C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_149;                // 0x1C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_148;                // 0x1C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_147;                // 0x1C80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_146;                // 0x1CA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_145;                // 0x1CD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_144;                // 0x1CF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143;                // 0x1D20(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_129;               // 0x1D48(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_93;                      // 0x1E40(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_17;              // 0x1E60(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_92;                      // 0x1F60(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_128;               // 0x1F80(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_91;                      // 0x2078(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0x2098(0x00E8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_142;                // 0x2180(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_141;                // 0x21A8(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_127;               // 0x21D0(0x00F8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_16;              // 0x22C8(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_28;                    // 0x23C8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_90;                      // 0x2490(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_126;               // 0x24B0(0x00F8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_15;              // 0x25A8(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_27;                    // 0x26A8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89;                      // 0x2770(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_20;                     // 0x2790(0x00D0)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_125;               // 0x2860(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88;                      // 0x2958(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x2978(0x00E8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_140;                // 0x2A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_139;                // 0x2A88(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_124;               // 0x2AB0(0x00F8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_14;              // 0x2BA8(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_26;                    // 0x2CA8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87;                      // 0x2D70(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_123;               // 0x2D90(0x00F8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_13;              // 0x2E88(0x0100)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_25;                    // 0x2F88(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86;                      // 0x3050(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_19;                     // 0x3070(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138;                // 0x3140(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_122;               // 0x3168(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_85;                      // 0x3260(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_121;               // 0x3280(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84;                      // 0x3378(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_18;                     // 0x3398(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83;                      // 0x3468(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x3488(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_82;                      // 0x34B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x34D0(0x00D0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x35A0(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x4368(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x5130(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x5EF8(0x0DC8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_137;                // 0x6CC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_136;                // 0x6CE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135;                // 0x6D10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134;                // 0x6D38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_133;                // 0x6D60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_132;                // 0x6D88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_131;                // 0x6DB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_130;                // 0x6DD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_129;                // 0x6E00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_128;                // 0x6E28(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_33;                      // 0x6E50(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_120;               // 0x6F18(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_119;               // 0x7010(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_81;                      // 0x7108(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_127;                // 0x7128(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_32;                      // 0x7150(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_118;               // 0x7218(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_117;               // 0x7310(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x7408(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_31;                      // 0x7428(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_116;               // 0x74F0(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_115;               // 0x75E8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x76E0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x7700(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x77D0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x77F0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x7818(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0x7838(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x7908(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x7988(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x7A08(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_9;                      // 0x7A30(0x0010)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x7A40(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x7B28(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x7B50(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_30;                      // 0x7B78(0x00C8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_12;              // 0x7C40(0x0100)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_11;              // 0x7D40(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x7E40(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0x7E60(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_126;                // 0x7F30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_125;                // 0x7F58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_124;                // 0x7F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x7FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x7FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x7FF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x8020(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x8048(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x8070(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x8098(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x80C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x80E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x8110(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x8138(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x8160(0x0048)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_114;               // 0x81A8(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_113;               // 0x82A0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x8398(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x83B8(0x0048)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_112;               // 0x8400(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_111;               // 0x84F8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x85F0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x8610(0x0048)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_110;               // 0x8658(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_109;               // 0x8750(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_24;                    // 0x8848(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_108;               // 0x8910(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x8A08(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_8;                      // 0x8A28(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x8A38(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_107;               // 0x8A58(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x8B50(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_106;               // 0x8B70(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x8C68(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_7;                      // 0x8C88(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x8C98(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0x8CB8(0x00D0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_23;                    // 0x8D88(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x8E50(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0x8E70(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x8F40(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x8FC0(0x0080)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_105;               // 0x9040(0x00F8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_29;                      // 0x9138(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x9200(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_28;                      // 0x92E8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x93B0(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x9430(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x9518(0x0080)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_10;              // 0x9598(0x0100)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_27;                      // 0x9698(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x9760(0x00E8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_26;                      // 0x9848(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x9910(0x0130)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x9A40(0x0130)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_104;               // 0x9B70(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_103;               // 0x9C68(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_102;               // 0x9D60(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_101;               // 0x9E58(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_100;               // 0x9F50(0x00F8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0xA048(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0xA0C8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0xA148(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0xA1C8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0xA248(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0xA2C8(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_22;                    // 0xA348(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0xA410(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0xA490(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0xA4B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0xA4E0(0x0028)()
	struct FGbxAnimNode_LayeredBoneSetBlend       GbxAnimGraphNode_LayeredBoneSetBlend_1;            // 0xA508(0x0140)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_99;                // 0xA648(0x00F8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0xA740(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0xA768(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0xA7E8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0xA810(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0xA890(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0xA8B8(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_6;                      // 0xA8E0(0x0010)()
	struct FOakAnimNode_ArmIK                     OakAnimGraphNode_ArmIK;                            // 0xA8F0(0x0A50)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_98;                // 0xB340(0x00F8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0xB438(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0xB460(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_97;                // 0xB488(0x00F8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0xB580(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0xB600(0x0028)()
	uint8                                         Pad_B628[0x8];                                     // 0xB628(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0xB630(0x0550)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_21;                    // 0xBB80(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0xBC48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0xBC70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0xBC98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0xBCC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0xBCE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0xBD10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0xBD38(0x0028)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_5;                      // 0xBD60(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0xBD70(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_96;                // 0xBD90(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0xBE88(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_95;                // 0xBEA8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0xBFA0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_4;                      // 0xBFC0(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0xBFD0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0xBFF0(0x00D0)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_25;                      // 0xC0C0(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_24;                      // 0xC188(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0xC250(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0xC278(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0xC2A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0xC2C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0xC2F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0xC318(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0xC340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0xC368(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_94;                // 0xC390(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0xC488(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_93;                // 0xC4A8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0xC5A0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_92;                // 0xC5C0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0xC6B8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_91;                // 0xC6D8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0xC7D0(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_3;                      // 0xC7F0(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0xC800(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0xC820(0x00D0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_20;                    // 0xC8F0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0xC9B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0xC9E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0xCA08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0xCA30(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_90;                // 0xCA58(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_19;                    // 0xCB50(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0xCC18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0xCC40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0xCC68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0xCC90(0x0028)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_9;               // 0xCCB8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0xCDB8(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_8;               // 0xCDD8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0xCED8(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_7;               // 0xCEF8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0xCFF8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0xD018(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0xD0E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0xD108(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_89;                // 0xD130(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0xD228(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_6;               // 0xD248(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0xD348(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0xD368(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0xD438(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0xD480(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0xD500(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0xD528(0x00E8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0xD610(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0xD638(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0xD660(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0xD688(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0xD6B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0xD6D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0xD700(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_88;                // 0xD728(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0xD820(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_87;                // 0xD840(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0xD938(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_86;                // 0xD958(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0xDA50(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_85;                // 0xDA70(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0xDB68(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_2;                      // 0xDB88(0x0010)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0xDB98(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0xDBB8(0x00D0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xDC88(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_18;                    // 0xDCA8(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0xDD70(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0xDDB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0xDDE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0xDE08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0xDE30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0xDE58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0xDE80(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_84;                // 0xDEA8(0x00F8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_1;               // 0xDFA0(0x0038)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_5;               // 0xDFD8(0x0100)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_83;                // 0xE0D8(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_17;           // 0xE1D0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_82;                // 0xE1F0(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_16;           // 0xE2E8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_81;                // 0xE308(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_15;           // 0xE400(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_80;                // 0xE420(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_14;           // 0xE518(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_79;                // 0xE538(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_13;           // 0xE630(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_78;                // 0xE650(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_12;           // 0xE748(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_77;                // 0xE768(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_11;           // 0xE860(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_76;                // 0xE880(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_10;           // 0xE978(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_75;                // 0xE998(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_9;            // 0xEA90(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph_1;                   // 0xEAB0(0x0068)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_17;                    // 0xEB18(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0xEBE0(0x0048)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_74;                // 0xEC28(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_8;            // 0xED20(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_73;                // 0xED40(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_7;            // 0xEE38(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_72;                // 0xEE58(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_6;            // 0xEF50(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_71;                // 0xEF70(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_5;            // 0xF068(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_70;                // 0xF088(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_4;            // 0xF180(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_69;                // 0xF1A0(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_3;            // 0xF298(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_68;                // 0xF2B8(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_2;            // 0xF3B0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_67;                // 0xF3D0(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult_1;            // 0xF4C8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_66;                // 0xF4E8(0x00F8)()
	struct FAnimNode_BlendSpaceSampleResult       AnimGraphNode_BlendSpaceSampleResult;              // 0xF5E0(0x0020)()
	struct FAnimNode_BlendSpaceGraph              AnimGraphNode_BlendSpaceGraph;                     // 0xF600(0x0068)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0xF668(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_4;               // 0xF688(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0xF788(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_65;                // 0xF7A8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0xF8A0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_64;                // 0xF8C0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0xF9B8(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_3;               // 0xF9D8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0xFAD8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0xFAF8(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0xFBC8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0xFC10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0xFC38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0xFC60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0xFC88(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_63;                // 0xFCB0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0xFDA8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_62;                // 0xFDC8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0xFEC0(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_61;                // 0xFEE0(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_60;                // 0xFFD8(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_59;                // 0x100D0(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_16;                    // 0x101C8(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_23;                      // 0x10290(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x10358(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x10378(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x10448(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x10470(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x104B8(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x105A0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x105C8(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x10648(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x10668(0x0DC8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x11430(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x11518(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x11598(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_15;                    // 0x11680(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x11748(0x0DC8)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator_3;              // 0x12510(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x12590(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x13358(0x0DC8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x14120(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x14148(0x04E0)(ContainsInstancedReference)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_22;                      // 0x14628(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x146F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x14718(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x14740(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x14768(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x14790(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x147B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x147E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x14808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x14830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x14858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x14880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x148A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x148D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x148F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x14920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x14948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x14970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x14998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x149C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x149E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x14A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x14A38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x14A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x14A88(0x0028)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator_2;              // 0x14AB0(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_14;                    // 0x14B30(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_58;                // 0x14BF8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x14CF0(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_21;                      // 0x14D10(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_57;                // 0x14DD8(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_56;                // 0x14ED0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x14FC8(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0x14FE8(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_55;                // 0x150B0(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_54;                // 0x151A8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x152A0(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0x152C0(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_53;                // 0x15388(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_52;                // 0x15480(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x15578(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0x15598(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0x15660(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_51;                // 0x15728(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_50;                // 0x15820(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_49;                // 0x15918(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_48;                // 0x15A10(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_13;                    // 0x15B08(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x15BD0(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_16;                      // 0x15BF0(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_47;                // 0x15CB8(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_46;                // 0x15DB0(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x15EA8(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_45;                // 0x15EC8(0x00F8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_15;                      // 0x15FC0(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_44;                // 0x16088(0x00F8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_14;                      // 0x16180(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_13;                      // 0x16248(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_43;                // 0x16310(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_42;                // 0x16408(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x16500(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_12;                      // 0x16520(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_11;                      // 0x165E8(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_41;                // 0x166B0(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_40;                // 0x167A8(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_39;                // 0x168A0(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_12;                    // 0x16998(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_38;                // 0x16A60(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x16B58(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_10;                      // 0x16B78(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_37;                // 0x16C40(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_36;                // 0x16D38(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x16E30(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9;                       // 0x16E50(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_35;                // 0x16F18(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_34;                // 0x17010(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x17108(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_8;                       // 0x17128(0x00C8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_33;                // 0x171F0(0x00F8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_32;                // 0x172E8(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x173E0(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x17400(0x00E8)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_31;                // 0x174E8(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_11;                    // 0x175E0(0x00C8)()
	struct FGbxAnimNode_SequenceEvaluator         GbxAnimGraphNode_SequenceEvaluator_1;              // 0x176A8(0x0080)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_30;                // 0x17728(0x00F8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_10;                    // 0x17820(0x00C8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_2;               // 0x178E8(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x179E8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x17A08(0x00D0)()
	struct FGbxAnimNode_LayeredBoneSetBlend       GbxAnimGraphNode_LayeredBoneSetBlend;              // 0x17AD8(0x0140)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x17C18(0x0DC8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x189E0(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x18AC8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x18B48(0x0080)()
	uint8                                         Pad_18BC8[0x8];                                    // 0x18BC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x18BD0(0x0280)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x18E50(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x18E78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x18EA0(0x0028)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer_29;                // 0x18EC8(0x00F8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x18FC0(0x0DC8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x19D88(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x19E08(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x19E30(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x19E58(0x00E8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x19F40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x19F68(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x19F90(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x1A010(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x1A038(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x1A0B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x1A0E0(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7;                       // 0x1A108(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x1A1D0(0x0DC8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x1AF98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x1AFC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x1AFE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1B010(0x0028)()
