#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_Player_Legs

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "GbxGame_structs.hpp"
#include "BPAnim_Player_Legs_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_Player_Legs.BPAnim_Player_Legs_C
// 0x0A90 (0x23E0 - 0x1950)
class UBPAnim_Player_Legs_C final : public UOakCharacterAnimInstance
{
public:
	struct BPAnim_Player_Legs::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x1950(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195C[0x4];                                     // 0x195C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1960(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1968(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1970(0x0020)()
	struct FGbxAnimNode_CopyPoseFromMesh          AnimGraphNode_CopyPoseFromMesh;                    // 0x1990(0x0178)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1B08(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1B88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1BB0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1BD8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1C00(0x0020)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer_1;               // 0x1C20(0x0100)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1D20(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1D40(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1D68(0x00E8)()
	struct FGbxAnimNode_BlendSpacePlayer          GbxAnimGraphNode_BlendSpacePlayer;                 // 0x1E50(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1F50(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1F78(0x0020)()
	struct FGbxAnimNode_SequencePlayer            GbxAnimGraphNode_SequencePlayer;                   // 0x1F98(0x00F8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2090(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x20B0(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2180(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x21A0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x21C8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x21E8(0x00D0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x22B8(0x0118)()
	class UBlendSpace*                            Active_Weapon_AO;                                  // 0x23D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPAnim_Player_Legs_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPAnim_Player_Legs_C")
	}
	static class UBPAnim_Player_Legs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_Player_Legs_C>();
	}
};
DUMPER7_ASSERTS_UBPAnim_Player_Legs_C;

}

