#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnim_FastTravelStation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BPAnim_FastTravelStation.BPAnim_FastTravelStation_C
// 0x1D90 (0x21D0 - 0x0440)
class UBPAnim_FastTravelStation_C final : public UAnimInstance
{
public:
	uint8                                         Pad_438[0x8];                                      // 0x0438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0440(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0448(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0450(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0470(0x0010)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0480(0x0DC8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1248(0x0DC8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2010(0x00E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x20F8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2178(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x21A0(0x0028)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPAnim_FastTravelStation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPAnim_FastTravelStation_C")
	}
	static class UBPAnim_FastTravelStation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAnim_FastTravelStation_C>();
	}
};
DUMPER7_ASSERTS_UBPAnim_FastTravelStation_C;

}

