#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Drone_Echo4

#include "Basic.hpp"

#include "GbxEngine_structs.hpp"


namespace SDK::Params
{

// Function BPI_Drone_Echo4.BPI_Drone_Echo4_C.Echo4_Arrived
// 0x0008 (0x0008 - 0x0000)
struct BPI_Drone_Echo4_C_Echo4_Arrived final
{
public:
	class AOakDrone*                              Echo4;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Drone_Echo4_C_Echo4_Arrived;

// Function BPI_Drone_Echo4.BPI_Drone_Echo4_C.Echo4_MoveTo
// 0x0008 (0x0008 - 0x0000)
struct BPI_Drone_Echo4_C_Echo4_MoveTo final
{
public:
	class AActor*                                 MoveTarget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Drone_Echo4_C_Echo4_MoveTo;

// Function BPI_Drone_Echo4.BPI_Drone_Echo4_C.Echo4_SetOrientationMode
// 0x0001 (0x0001 - 0x0000)
struct BPI_Drone_Echo4_C_Echo4_SetOrientationMode final
{
public:
	bool                                          On_;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Drone_Echo4_C_Echo4_SetOrientationMode;

// Function BPI_Drone_Echo4.BPI_Drone_Echo4_C.Echo4_Spawn
// 0x0050 (0x0050 - 0x0000)
struct BPI_Drone_Echo4_C_Echo4_Spawn final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxRelativeLocationType                      Relative_Location_Type;                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Location_Option_Socket;                            // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxRelativeRotation                   Location_Options_Offset_Direction;                 // 0x0018(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	double                                        Location_Options_Offset_Distance;                  // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Drone_Echo4_C_Echo4_Spawn;

// Function BPI_Drone_Echo4.BPI_Drone_Echo4_C.Echo_Spawned
// 0x0008 (0x0008 - 0x0000)
struct BPI_Drone_Echo4_C_Echo_Spawned final
{
public:
	class AOakDrone*                              Echo4;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Drone_Echo4_C_Echo_Spawned;

// Function BPI_Drone_Echo4.BPI_Drone_Echo4_C.RetrieveE4
// 0x0008 (0x0008 - 0x0000)
struct BPI_Drone_Echo4_C_RetrieveE4 final
{
public:
	double                                        DelayBeforeDigistructingOut;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Drone_Echo4_C_RetrieveE4;

}

