#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_LostCapsule

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_LostCapsule.BPI_LostCapsule_C.PassChallenge
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) BPI_LostCapsule_C_PassChallenge final
{
public:
	FGameDataHandleProperty_                      challenge;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LostCapsule_C_PassChallenge;

// Function BPI_LostCapsule.BPI_LostCapsule_C.StartDecrypt
// 0x0020 (0x0020 - 0x0000)
struct BPI_LostCapsule_C_StartDecrypt final
{
public:
	class AOakPlayerController*                   PlayerWhoPlacedIt;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      challenge;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LostCapsule_C_StartDecrypt;

// Function BPI_LostCapsule.BPI_LostCapsule_C.TriggerDecryptStation_VO
// 0x0010 (0x0010 - 0x0000)
struct BPI_LostCapsule_C_TriggerDecryptStation_VO final
{
public:
	class AActor*                                 Transmitter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   PlayerController;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LostCapsule_C_TriggerDecryptStation_VO;

// Function BPI_LostCapsule.BPI_LostCapsule_C.TriggerDecryptStationTutorial
// 0x0010 (0x0010 - 0x0000)
struct BPI_LostCapsule_C_TriggerDecryptStationTutorial final
{
public:
	class AActor*                                 Transmitter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   PlayerController;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LostCapsule_C_TriggerDecryptStationTutorial;

// Function BPI_LostCapsule.BPI_LostCapsule_C.UpdateDecryptStation
// 0x0020 (0x0020 - 0x0000)
struct BPI_LostCapsule_C_UpdateDecryptStation final
{
public:
	class AActor*                                 DecryptStation;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      challenge;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_LostCapsule_C_UpdateDecryptStation;

}

