#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_Evocarium

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_Evocarium.BPI_Evocarium_C.RegisterEvocarium
// 0x0008 (0x0008 - 0x0000)
struct BPI_Evocarium_C_RegisterEvocarium final
{
public:
	class AActor*                                 Evocarium;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Evocarium_C_RegisterEvocarium;

// Function BPI_Evocarium.BPI_Evocarium_C.SetBeamTargetDestination
// 0x0018 (0x0018 - 0x0000)
struct BPI_Evocarium_C_SetBeamTargetDestination final
{
public:
	struct FVector                                TargetDestination;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Evocarium_C_SetBeamTargetDestination;

// Function BPI_Evocarium.BPI_Evocarium_C.UpdateBeaconState
// 0x0002 (0x0002 - 0x0000)
struct BPI_Evocarium_C_UpdateBeaconState final
{
public:
	bool                                          SetComplete;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetDormant;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Evocarium_C_UpdateBeaconState;

// Function BPI_Evocarium.BPI_Evocarium_C.UpdateEvocarium
// 0x0008 (0x0008 - 0x0000)
struct BPI_Evocarium_C_UpdateEvocarium final
{
public:
	class AActor*                                 Beacon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_Evocarium_C_UpdateEvocarium;

}

