#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CohtmlPlugin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CohtmlPlugin_structs.hpp"


namespace SDK::Params
{

// Function CohtmlPlugin.CohtmlBaseComponent.AddPreloadedTexture
// 0x0008 (0x0008 - 0x0000)
struct CohtmlBaseComponent_AddPreloadedTexture final
{
public:
	class UTexture2D*                             Texture_0;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_AddPreloadedTexture;

// Function CohtmlPlugin.CohtmlBaseComponent.CreateDataModelFromObject
// 0x0018 (0x0018 - 0x0000)
struct CohtmlBaseComponent_CreateDataModelFromObject final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Model;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_CreateDataModelFromObject;

// Function CohtmlPlugin.CohtmlBaseComponent.CreateDataModelFromStruct
// 0x0030 (0x0030 - 0x0000)
struct CohtmlBaseComponent_CreateDataModelFromStruct final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FStructProperty>             Struct;                                            // 0x0010(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_CreateDataModelFromStruct;

// Function CohtmlPlugin.CohtmlBaseComponent.CreateJSEvent
// 0x0008 (0x0008 - 0x0000)
struct CohtmlBaseComponent_CreateJSEvent final
{
public:
	class UCohtmlJSEvent*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_CreateJSEvent;

// Function CohtmlPlugin.CohtmlBaseComponent.EnableDelayedUpdate
// 0x0001 (0x0001 - 0x0000)
struct CohtmlBaseComponent_EnableDelayedUpdate final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_EnableDelayedUpdate;

// Function CohtmlPlugin.CohtmlBaseComponent.EnableRendering
// 0x0001 (0x0001 - 0x0000)
struct CohtmlBaseComponent_EnableRendering final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_EnableRendering;

// Function CohtmlPlugin.CohtmlBaseComponent.EnsureMeshData
// 0x0002 (0x0002 - 0x0000)
struct CohtmlBaseComponent_EnsureMeshData final
{
public:
	ECohtmlComponentMeshInit                      MeshInitialization;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_EnsureMeshData;

// Function CohtmlPlugin.CohtmlBaseComponent.Load
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBaseComponent_Load final
{
public:
	class FString                                 path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_Load;

// Function CohtmlPlugin.CohtmlBaseComponent.PreloadTextureAsync
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBaseComponent_PreloadTextureAsync final
{
public:
	class FString                                 assetpath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_PreloadTextureAsync;

// Function CohtmlPlugin.CohtmlBaseComponent.PreloadTextureSync
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBaseComponent_PreloadTextureSync final
{
public:
	class FString                                 assetpath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_PreloadTextureSync;

// Function CohtmlPlugin.CohtmlBaseComponent.RegisterForEvent
// 0x0020 (0x0020 - 0x0000)
struct CohtmlBaseComponent_RegisterForEvent final
{
public:
	class FString                                 JSEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             Delegate;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_RegisterForEvent;

// Function CohtmlPlugin.CohtmlBaseComponent.RemoveDataModelFromObject
// 0x0008 (0x0008 - 0x0000)
struct CohtmlBaseComponent_RemoveDataModelFromObject final
{
public:
	class UObject*                                Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_RemoveDataModelFromObject;

// Function CohtmlPlugin.CohtmlBaseComponent.RemovePreloadedTexture
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBaseComponent_RemovePreloadedTexture final
{
public:
	class UTexture2D*                             Texture_0;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlBaseComponent_RemovePreloadedTexture;

// Function CohtmlPlugin.CohtmlBaseComponent.RemovePreloadedTextureFromPath
// 0x0018 (0x0018 - 0x0000)
struct CohtmlBaseComponent_RemovePreloadedTextureFromPath final
{
public:
	class FString                                 assetpath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlBaseComponent_RemovePreloadedTextureFromPath;

// Function CohtmlPlugin.CohtmlBaseComponent.Resize
// 0x0008 (0x0008 - 0x0000)
struct CohtmlBaseComponent_Resize final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_Resize;

// Function CohtmlPlugin.CohtmlBaseComponent.ResizeRenderTarget
// 0x0008 (0x0008 - 0x0000)
struct CohtmlBaseComponent_ResizeRenderTarget final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_ResizeRenderTarget;

// Function CohtmlPlugin.CohtmlBaseComponent.SetSoundAttenuation
// 0x03D0 (0x03D0 - 0x0000)
struct CohtmlBaseComponent_SetSoundAttenuation final
{
public:
	struct FSoundAttenuationSettings              settings;                                          // 0x0000(0x03D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_SetSoundAttenuation;

// Function CohtmlPlugin.CohtmlBaseComponent.ShowPaintRects
// 0x0001 (0x0001 - 0x0000)
struct CohtmlBaseComponent_ShowPaintRects final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_ShowPaintRects;

// Function CohtmlPlugin.CohtmlBaseComponent.HasRequestedView
// 0x0001 (0x0001 - 0x0000)
struct CohtmlBaseComponent_HasRequestedView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_HasRequestedView;

// Function CohtmlPlugin.CohtmlBaseComponent.IsReadyForBindings
// 0x0001 (0x0001 - 0x0000)
struct CohtmlBaseComponent_IsReadyForBindings final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_IsReadyForBindings;

// Function CohtmlPlugin.CohtmlBaseComponent.IsReadyToCreateView
// 0x0001 (0x0001 - 0x0000)
struct CohtmlBaseComponent_IsReadyToCreateView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_IsReadyToCreateView;

// Function CohtmlPlugin.CohtmlBaseComponent.RemoveDataModelFromStruct
// 0x0020 (0x0020 - 0x0000)
struct CohtmlBaseComponent_RemoveDataModelFromStruct final
{
public:
	TFieldPath<class FStructProperty>             Struct;                                            // 0x0000(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_RemoveDataModelFromStruct;

// Function CohtmlPlugin.CohtmlBaseComponent.TriggerJSEvent
// 0x0018 (0x0018 - 0x0000)
struct CohtmlBaseComponent_TriggerJSEvent final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCohtmlJSEvent*                         EventData;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_TriggerJSEvent;

// Function CohtmlPlugin.CohtmlBaseComponent.UpdateWholeDataModelFromObject
// 0x0008 (0x0008 - 0x0000)
struct CohtmlBaseComponent_UpdateWholeDataModelFromObject final
{
public:
	class UObject*                                Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_UpdateWholeDataModelFromObject;

// Function CohtmlPlugin.CohtmlBaseComponent.UpdateWholeDataModelFromStruct
// 0x0020 (0x0020 - 0x0000)
struct CohtmlBaseComponent_UpdateWholeDataModelFromStruct final
{
public:
	TFieldPath<class FStructProperty>             Struct;                                            // 0x0000(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBaseComponent_UpdateWholeDataModelFromStruct;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddArray
// 0x0020 (0x0020 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_AddArray final
{
public:
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Arg;                                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ArrayType;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_AddArray;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddArrayOfStructs
// 0x0018 (0x0018 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_AddArrayOfStructs final
{
public:
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Arg;                                               // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_AddArrayOfStructs;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddBool
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_AddBool final
{
public:
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Arg;                                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_AddBool;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddByte
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_AddByte final
{
public:
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Arg;                                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_AddByte;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddFloat
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_AddFloat final
{
public:
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arg;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_AddFloat;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddInt32
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_AddInt32 final
{
public:
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Arg;                                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_AddInt32;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddObject
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_AddObject final
{
public:
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Arg;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_AddObject;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddString
// 0x0018 (0x0018 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_AddString final
{
public:
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Arg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_AddString;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddStructArg
// 0x0028 (0x0028 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_AddStructArg final
{
public:
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FStructProperty>             Arg;                                               // 0x0008(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_AddStructArg;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.CreateJSEvent
// 0x0010 (0x0010 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_CreateJSEvent final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCohtmlJSEvent*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_CreateJSEvent;

// Function CohtmlPlugin.CohtmlBlueprintFunctionLibrary.TriggerJSEvent
// 0x0020 (0x0020 - 0x0000)
struct CohtmlBlueprintFunctionLibrary_TriggerJSEvent final
{
public:
	class UCohtmlBaseComponent*                   Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCohtmlJSEvent*                         JSEvent;                                           // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlBlueprintFunctionLibrary_TriggerJSEvent;

// Function CohtmlPlugin.CohtmlGameHUD.CalculateCohtmlPadding
// 0x0010 (0x0010 - 0x0000)
struct CohtmlGameHUD_CalculateCohtmlPadding final
{
public:
	struct FCohtmlPadding                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlGameHUD_CalculateCohtmlPadding;

// Function CohtmlPlugin.CohtmlGameHUD.SetupView
// 0x0018 (0x0018 - 0x0000)
struct CohtmlGameHUD_SetupView final
{
public:
	class FString                                 PageUrl;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableComplexCSSSupport;                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDelayedUpdate;                                    // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReceiveInput;                                     // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExecuteCommandProcessingWithLayout;               // 0x0013(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSurfacePartitioning;                           // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunAdvanceConcurrently;                           // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlGameHUD_SetupView;

// Function CohtmlPlugin.CohtmlInputActor.AlwaysAcceptMouseInput
// 0x0001 (0x0001 - 0x0000)
struct CohtmlInputActor_AlwaysAcceptMouseInput final
{
public:
	bool                                          bAccept;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlInputActor_AlwaysAcceptMouseInput;

// Function CohtmlPlugin.CohtmlInputActor.Initialize
// 0x0008 (0x0008 - 0x0000)
struct CohtmlInputActor_Initialize final
{
public:
	ECollisionChannel                             CollisionChannel;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressMode;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECohtmlInputWidgetRaycastQuality              RaycastQuality;                                    // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UVChannel;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlInputActor_Initialize;

// Function CohtmlPlugin.CohtmlInputActor.SetCohtmlInputFocus
// 0x0001 (0x0001 - 0x0000)
struct CohtmlInputActor_SetCohtmlInputFocus final
{
public:
	bool                                          FocusUI;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlInputActor_SetCohtmlInputFocus;

// Function CohtmlPlugin.CohtmlInputActor.SetCohtmlViewFocus
// 0x0008 (0x0008 - 0x0000)
struct CohtmlInputActor_SetCohtmlViewFocus final
{
public:
	class UCohtmlBaseComponent*                   NewFocusedView;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlInputActor_SetCohtmlViewFocus;

// Function CohtmlPlugin.CohtmlInputActor.SetInputPropagationBehaviour
// 0x0001 (0x0001 - 0x0000)
struct CohtmlInputActor_SetInputPropagationBehaviour final
{
public:
	ECohtmlInputPropagationBehaviour              Propagation;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlInputActor_SetInputPropagationBehaviour;

// Function CohtmlPlugin.CohtmlInputActor.SetLineTraceMode
// 0x0001 (0x0001 - 0x0000)
struct CohtmlInputActor_SetLineTraceMode final
{
public:
	ECohtmlInputWidgetLineTraceMode               Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlInputActor_SetLineTraceMode;

// Function CohtmlPlugin.CohtmlInputActor.SetupInput
// 0x0018 (0x0018 - 0x0000)
struct CohtmlInputActor_SetupInput final
{
public:
	class UCohtmlBaseComponent*                   CohtmlHUD;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressMode;                                       // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECohtmlInputWidgetRaycastQuality              RaycastQuality;                                    // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UVChannel;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFocusUI;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysAcceptMouseInput;                           // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlInputActor_SetupInput;

// Function CohtmlPlugin.CohtmlInputActor.GetInputPropagationBehaviour
// 0x0001 (0x0001 - 0x0000)
struct CohtmlInputActor_GetInputPropagationBehaviour final
{
public:
	ECohtmlInputPropagationBehaviour              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlInputActor_GetInputPropagationBehaviour;

// Function CohtmlPlugin.CohtmlInputActor.IsCohtmlFocused
// 0x0001 (0x0001 - 0x0000)
struct CohtmlInputActor_IsCohtmlFocused final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlInputActor_IsCohtmlFocused;

// Function CohtmlPlugin.CohtmlJSEvent.AddArray
// 0x0010 (0x0010 - 0x0000)
struct CohtmlJSEvent_AddArray final
{
public:
	TArray<int32>                                 Array;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddArray;

// Function CohtmlPlugin.CohtmlJSEvent.AddBool
// 0x0001 (0x0001 - 0x0000)
struct CohtmlJSEvent_AddBool final
{
public:
	bool                                          B;                                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddBool;

// Function CohtmlPlugin.CohtmlJSEvent.AddByte
// 0x0001 (0x0001 - 0x0000)
struct CohtmlJSEvent_AddByte final
{
public:
	uint8                                         byte_0;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddByte;

// Function CohtmlPlugin.CohtmlJSEvent.AddFloat
// 0x0004 (0x0004 - 0x0000)
struct CohtmlJSEvent_AddFloat final
{
public:
	float                                         fl;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddFloat;

// Function CohtmlPlugin.CohtmlJSEvent.AddInt32
// 0x0004 (0x0004 - 0x0000)
struct CohtmlJSEvent_AddInt32 final
{
public:
	int32                                         Integer;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddInt32;

// Function CohtmlPlugin.CohtmlJSEvent.AddName
// 0x0008 (0x0008 - 0x0000)
struct CohtmlJSEvent_AddName final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddName;

// Function CohtmlPlugin.CohtmlJSEvent.AddObject
// 0x0008 (0x0008 - 0x0000)
struct CohtmlJSEvent_AddObject final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddObject;

// Function CohtmlPlugin.CohtmlJSEvent.AddString
// 0x0010 (0x0010 - 0x0000)
struct CohtmlJSEvent_AddString final
{
public:
	class FString                                 str;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddString;

// Function CohtmlPlugin.CohtmlJSEvent.AddStructArg
// 0x0020 (0x0020 - 0x0000)
struct CohtmlJSEvent_AddStructArg final
{
public:
	TFieldPath<class FStructProperty>             Arg;                                               // 0x0000(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddStructArg;

// Function CohtmlPlugin.CohtmlJSEvent.AddText
// 0x0010 (0x0010 - 0x0000)
struct CohtmlJSEvent_AddText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlJSEvent_AddText;

// Function CohtmlPlugin.CohtmlWidget.AddPreloadedTexture
// 0x0008 (0x0008 - 0x0000)
struct CohtmlWidget_AddPreloadedTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_AddPreloadedTexture;

// Function CohtmlPlugin.CohtmlWidget.CreateDataModelFromObject
// 0x0018 (0x0018 - 0x0000)
struct CohtmlWidget_CreateDataModelFromObject final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Model;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_CreateDataModelFromObject;

// Function CohtmlPlugin.CohtmlWidget.CreateDataModelFromStruct
// 0x0030 (0x0030 - 0x0000)
struct CohtmlWidget_CreateDataModelFromStruct final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<class FStructProperty>             Struct;                                            // 0x0010(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_CreateDataModelFromStruct;

// Function CohtmlPlugin.CohtmlWidget.CreateJSEvent
// 0x0008 (0x0008 - 0x0000)
struct CohtmlWidget_CreateJSEvent final
{
public:
	class UCohtmlJSEvent*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_CreateJSEvent;

// Function CohtmlPlugin.CohtmlWidget.Load
// 0x0010 (0x0010 - 0x0000)
struct CohtmlWidget_Load final
{
public:
	class FString                                 path;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_Load;

// Function CohtmlPlugin.CohtmlWidget.PreloadTextureAsync
// 0x0010 (0x0010 - 0x0000)
struct CohtmlWidget_PreloadTextureAsync final
{
public:
	class FString                                 assetpath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_PreloadTextureAsync;

// Function CohtmlPlugin.CohtmlWidget.PreloadTextureSync
// 0x0010 (0x0010 - 0x0000)
struct CohtmlWidget_PreloadTextureSync final
{
public:
	class FString                                 assetpath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_PreloadTextureSync;

// Function CohtmlPlugin.CohtmlWidget.RemoveDataModelFromObject
// 0x0008 (0x0008 - 0x0000)
struct CohtmlWidget_RemoveDataModelFromObject final
{
public:
	class UObject*                                Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_RemoveDataModelFromObject;

// Function CohtmlPlugin.CohtmlWidget.RemovePreloadedTexture
// 0x0010 (0x0010 - 0x0000)
struct CohtmlWidget_RemovePreloadedTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlWidget_RemovePreloadedTexture;

// Function CohtmlPlugin.CohtmlWidget.RemovePreloadedTextureFromPath
// 0x0018 (0x0018 - 0x0000)
struct CohtmlWidget_RemovePreloadedTextureFromPath final
{
public:
	class FString                                 assetpath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CohtmlWidget_RemovePreloadedTextureFromPath;

// Function CohtmlPlugin.CohtmlWidget.SetInputPropagationBehaviour
// 0x0001 (0x0001 - 0x0000)
struct CohtmlWidget_SetInputPropagationBehaviour final
{
public:
	ECohtmlInputPropagationBehaviour              Propagation;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_SetInputPropagationBehaviour;

// Function CohtmlPlugin.CohtmlWidget.SetSoundAttenuation
// 0x03D0 (0x03D0 - 0x0000)
struct CohtmlWidget_SetSoundAttenuation final
{
public:
	struct FSoundAttenuationSettings              settings;                                          // 0x0000(0x03D0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_SetSoundAttenuation;

// Function CohtmlPlugin.CohtmlWidget.ShowPaintRects
// 0x0001 (0x0001 - 0x0000)
struct CohtmlWidget_ShowPaintRects final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_ShowPaintRects;

// Function CohtmlPlugin.CohtmlWidget.GetInputPropagationBehaviour
// 0x0001 (0x0001 - 0x0000)
struct CohtmlWidget_GetInputPropagationBehaviour final
{
public:
	ECohtmlInputPropagationBehaviour              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_GetInputPropagationBehaviour;

// Function CohtmlPlugin.CohtmlWidget.GetRenderTexture
// 0x0008 (0x0008 - 0x0000)
struct CohtmlWidget_GetRenderTexture final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_GetRenderTexture;

// Function CohtmlPlugin.CohtmlWidget.HasRequestedView
// 0x0001 (0x0001 - 0x0000)
struct CohtmlWidget_HasRequestedView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_HasRequestedView;

// Function CohtmlPlugin.CohtmlWidget.IsReadyForBindings
// 0x0001 (0x0001 - 0x0000)
struct CohtmlWidget_IsReadyForBindings final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_IsReadyForBindings;

// Function CohtmlPlugin.CohtmlWidget.IsReadyToCreateView
// 0x0001 (0x0001 - 0x0000)
struct CohtmlWidget_IsReadyToCreateView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_IsReadyToCreateView;

// Function CohtmlPlugin.CohtmlWidget.RemoveDataModelFromStruct
// 0x0020 (0x0020 - 0x0000)
struct CohtmlWidget_RemoveDataModelFromStruct final
{
public:
	TFieldPath<class FStructProperty>             Struct;                                            // 0x0000(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_RemoveDataModelFromStruct;

// Function CohtmlPlugin.CohtmlWidget.TriggerJSEvent
// 0x0018 (0x0018 - 0x0000)
struct CohtmlWidget_TriggerJSEvent final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCohtmlJSEvent*                         EventData;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_TriggerJSEvent;

// Function CohtmlPlugin.CohtmlWidget.UpdateWholeDataModelFromObject
// 0x0008 (0x0008 - 0x0000)
struct CohtmlWidget_UpdateWholeDataModelFromObject final
{
public:
	class UObject*                                Model;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_UpdateWholeDataModelFromObject;

// Function CohtmlPlugin.CohtmlWidget.UpdateWholeDataModelFromStruct
// 0x0020 (0x0020 - 0x0000)
struct CohtmlWidget_UpdateWholeDataModelFromStruct final
{
public:
	TFieldPath<class FStructProperty>             Struct;                                            // 0x0000(0x0020)(ConstParm, Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CohtmlWidget_UpdateWholeDataModelFromStruct;

}

