#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CohtmlPlugin

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum CohtmlPlugin.ECohtmlFocusChange
// NumValues: 0x0003
enum class ECohtmlFocusChange : uint8
{
	Received                                 = 0,
	Lost                                     = 1,
	ECohtmlFocusChange_MAX                   = 2,
};

// Enum CohtmlPlugin.ECohtmlKeys
// NumValues: 0x006C
enum class ECohtmlKeys : uint8
{
	LeftMouseButton                          = 0,
	RightMouseButton                         = 1,
	MiddleMouseButton                        = 2,
	ThumbMouseButton                         = 3,
	ThumbMouseButton2                        = 4,
	BackSpace                                = 5,
	Tab                                      = 6,
	Enter                                    = 7,
	Pause                                    = 8,
	CapsLock                                 = 9,
	Escape                                   = 10,
	SpaceBar                                 = 11,
	PageUp                                   = 12,
	PageDown                                 = 13,
	End                                      = 14,
	Home                                     = 15,
	Left                                     = 16,
	Up                                       = 17,
	Right                                    = 18,
	Down                                     = 19,
	Insert                                   = 20,
	Delete                                   = 21,
	Zero                                     = 22,
	One                                      = 23,
	Two                                      = 24,
	Three                                    = 25,
	Four                                     = 26,
	Five                                     = 27,
	Six                                      = 28,
	Seven                                    = 29,
	Eight                                    = 30,
	Nine                                     = 31,
	A                                        = 32,
	B                                        = 33,
	C                                        = 34,
	D                                        = 35,
	E                                        = 36,
	F                                        = 37,
	G                                        = 38,
	H                                        = 39,
	I                                        = 40,
	J                                        = 41,
	K                                        = 42,
	L                                        = 43,
	M                                        = 44,
	N                                        = 45,
	O                                        = 46,
	P                                        = 47,
	Q                                        = 48,
	R                                        = 49,
	S                                        = 50,
	T                                        = 51,
	U                                        = 52,
	V                                        = 53,
	W                                        = 54,
	X                                        = 55,
	Y                                        = 56,
	Z                                        = 57,
	NumPadZero                               = 58,
	NumPadOne                                = 59,
	NumPadTwo                                = 60,
	NumPadThree                              = 61,
	NumPadFour                               = 62,
	NumPadFive                               = 63,
	NumPadSix                                = 64,
	NumPadSeven                              = 65,
	NumPadEight                              = 66,
	NumPadNine                               = 67,
	Multiply                                 = 68,
	Add                                      = 69,
	Subtract                                 = 70,
	Decimal                                  = 71,
	Divide                                   = 72,
	F1                                       = 73,
	F2                                       = 74,
	F3                                       = 75,
	F4                                       = 76,
	F5                                       = 77,
	F6                                       = 78,
	F7                                       = 79,
	F8                                       = 80,
	F9                                       = 81,
	F10                                      = 82,
	F11                                      = 83,
	F12                                      = 84,
	NumLock                                  = 85,
	ScrollLock                               = 86,
	LeftShift                                = 87,
	RightShift                               = 88,
	LeftControl                              = 89,
	RightControl                             = 90,
	LeftAlt                                  = 91,
	RightAlt                                 = 92,
	LeftCommand                              = 93,
	RightCommand                             = 94,
	Semicolon                                = 95,
	Equals                                   = 96,
	Comma                                    = 97,
	Underscore                               = 98,
	Period                                   = 99,
	Slash                                    = 100,
	Tilde                                    = 101,
	LeftBracket                              = 102,
	Backslash                                = 103,
	RightBracket                             = 104,
	Quote                                    = 105,
	Unknown                                  = 106,
	ECohtmlKeys_MAX                          = 107,
};

// Enum CohtmlPlugin.ECohtmlAtlasPackingHeuristic
// NumValues: 0x0004
enum class ECohtmlAtlasPackingHeuristic : uint8
{
	H_SkylineDefault                         = 0,
	H_SkylineBL                              = 0,
	H_SkylineBF                              = 1,
	H_MAX                                    = 2,
};

// Enum CohtmlPlugin.ECohtmlComponentMeshInit
// NumValues: 0x0003
enum class ECohtmlComponentMeshInit : uint8
{
	LazyInit                                 = 0,
	Immediate                                = 1,
	ECohtmlComponentMeshInit_MAX             = 2,
};

// Enum CohtmlPlugin.ECohtmlTickGroup
// NumValues: 0x000A
enum class ECohtmlTickGroup : uint8
{
	CohtmlTG_PrePhysics                      = 0,
	CohtmlTG_StartPhysics                    = 1,
	CohtmlTG_DuringPhysics                   = 2,
	CohtmlTG_EndPhysics                      = 3,
	CohtmlTG_PostPhysics                     = 4,
	CohtmlTG_PostUpdateWork                  = 5,
	CohtmlTG_LastDemotable                   = 6,
	CohtmlTG_NewlySpawned                    = 7,
	CohtmlTG_ManualTick                      = 8,
	CohtmlTG_MAX                             = 9,
};

// Enum CohtmlPlugin.ECohtmlSettingsSeverity
// NumValues: 0x0007
enum class ECohtmlSettingsSeverity : uint8
{
	Trace                                    = 0,
	Debug                                    = 1,
	Info                                     = 2,
	Warning                                  = 3,
	Error                                    = 4,
	AssertFailure                            = 5,
	ECohtmlSettingsSeverity_MAX              = 6,
};

// Enum CohtmlPlugin.ECohtmlMSAA
// NumValues: 0x0004
enum class ECohtmlMSAA : uint8
{
	MSAA_1x                                  = 0,
	MSAA_2x                                  = 1,
	MSAA_4x                                  = 2,
	MSAA_MAX                                 = 3,
};

// Enum CohtmlPlugin.ECohtmlImageFormat
// NumValues: 0x000C
enum class ECohtmlImageFormat : uint8
{
	PNG                                      = 0,
	TGA                                      = 1,
	JPG                                      = 2,
	JPEG                                     = 3,
	PSD                                      = 4,
	SVG                                      = 5,
	DDS                                      = 6,
	BMP                                      = 7,
	ASTC                                     = 8,
	PKM                                      = 9,
	KTX                                      = 10,
	ECohtmlImageFormat_MAX                   = 11,
};

// Enum CohtmlPlugin.ECohtmlLinearSpaceRenderingPipeline
// NumValues: 0x0004
enum class ECohtmlLinearSpaceRenderingPipeline : uint8
{
	Disabled                                 = 0,
	SRGBTextures                             = 1,
	WideTextures                             = 2,
	ECohtmlLinearSpaceRenderingPipeline_MAX  = 3,
};

// Enum CohtmlPlugin.ECohtmlInputWidgetLineTraceMode
// NumValues: 0x0003
enum class ECohtmlInputWidgetLineTraceMode : uint8
{
	CohtmlInputLineTrace_Single              = 0,
	CohtmlInputLineTrace_Multi               = 1,
	CohtmlInputLineTrace_MAX                 = 2,
};

// Enum CohtmlPlugin.ECohtmlInputWidgetRaycastQuality
// NumValues: 0x0004
enum class ECohtmlInputWidgetRaycastQuality : uint8
{
	CohtmlRaycastQuality_Fast                = 0,
	CohtmlRaycastQuality_Balanced            = 1,
	CohtmlRaycastQuality_Accurate            = 2,
	CohtmlRaycastQuality_MAX                 = 3,
};

// Enum CohtmlPlugin.ECohStatsTextureType
// NumValues: 0x0004
enum class ECohStatsTextureType : uint8
{
	TT_ColorTexture                          = 0,
	TT_DepthTexture                          = 1,
	TT_Count                                 = 2,
	TT_MAX                                   = 3,
};

// Enum CohtmlPlugin.ECohStatsTextureDomain
// NumValues: 0x0009
enum class ECohStatsTextureDomain : uint8
{
	T_ScratchTexture                         = 0,
	T_LayerTexture                           = 1,
	T_ImageTexture                           = 2,
	T_SurfaceTexture                         = 3,
	T_CompositorTexture                      = 4,
	T_GlyphAtlas                             = 5,
	T_GradientCacheTexture                   = 6,
	T_Count                                  = 7,
	T_MAX                                    = 8,
};

// Enum CohtmlPlugin.ECohStatsBufferType
// NumValues: 0x0005
enum class ECohStatsBufferType : uint8
{
	BT_IndexBuffer                           = 0,
	BT_VertexBuffer                          = 1,
	BT_ConstantBuffer                        = 2,
	BT_Count                                 = 3,
	BT_MAX                                   = 4,
};

// Enum CohtmlPlugin.ECohStatsCBDomain
// NumValues: 0x0004
enum class ECohStatsCBDomain : uint8
{
	CB_DataVS                                = 0,
	CB_DataPS                                = 1,
	CB_Count                                 = 2,
	CB_MAX                                   = 3,
};

// Enum CohtmlPlugin.ECohStatsVBDomain
// NumValues: 0x0006
enum class ECohStatsVBDomain : uint8
{
	VB_GeometryBuffer                        = 0,
	VB_PathBuffer                            = 1,
	VB_PathInstanceDataBuffer                = 2,
	VB_GlyphBuffer                           = 3,
	VB_Count                                 = 4,
	VB_MAX                                   = 5,
};

// Enum CohtmlPlugin.ECohStatsIBDomain
// NumValues: 0x0005
enum class ECohStatsIBDomain : uint8
{
	IB_GeometryBuffer                        = 0,
	IB_PathBuffer                            = 1,
	IB_GlyphBuffer                           = 2,
	IB_Count                                 = 3,
	IB_MAX                                   = 4,
};

// Enum CohtmlPlugin.ECohtmlGamepadBehaviourOnFocusLost
// NumValues: 0x0004
enum class ECohtmlGamepadBehaviourOnFocusLost : uint8
{
	CohtmlResetState                         = 0,
	CohtmlUseCurrentState                    = 1,
	CohtmlUseStateBeforeReset                = 2,
	ECohtmlGamepadBehaviourOnFocusLost_MAX   = 3,
};

// Enum CohtmlPlugin.ECohtmlInputPropagationBehaviour
// NumValues: 0x0005
enum class ECohtmlInputPropagationBehaviour : uint8
{
	None                                     = 0,
	Keyboard                                 = 1,
	Joystick                                 = 2,
	KeyboardAndJoystick                      = 3,
	ECohtmlInputPropagationBehaviour_MAX     = 4,
};

// ScriptStruct CohtmlPlugin.TextureAtlasMappingInfo
// 0x0028 (0x0028 - 0x0000)
struct FTextureAtlasMappingInfo final
{
public:
	class FString                                 AtlasPath;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ContentRectWidth;                                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ContentRectHeight;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginX;                                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginY;                                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTextureAtlasMappingInfo;

// ScriptStruct CohtmlPlugin.TextureAtlasMetaData
// 0x00B0 (0x00B0 - 0x0000)
struct FTextureAtlasMetaData final
{
public:
	TMap<class FString, class UCohtmlTextureAtlasDetails*> AtlasDetails;                             // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x60];                                      // 0x0050(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTextureAtlasMetaData;

// ScriptStruct CohtmlPlugin.CohtmlSound
// 0x0018 (0x0018 - 0x0000)
struct FCohtmlSound final
{
public:
	class UAudioComponent*                        AudioComponent;                                    // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundWaveProcedural*                   Stream;                                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCohtmlSound;

// ScriptStruct CohtmlPlugin.CohtmlPadding
// 0x0010 (0x0010 - 0x0000)
struct FCohtmlPadding final
{
public:
	int32                                         PaddingLeft;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PaddingRight;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PaddingTop;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PaddingBottom;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCohtmlPadding;

// ScriptStruct CohtmlPlugin.HudCompositorCachedMaterial
// 0x0050 (0x0050 - 0x0000)
struct FHudCompositorCachedMaterial final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x40];                                      // 0x0010(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHudCompositorCachedMaterial;

// ScriptStruct CohtmlPlugin.SingleFormatFallbacks
// 0x0018 (0x0018 - 0x0000)
struct FSingleFormatFallbacks final
{
public:
	ECohtmlImageFormat                            BaseFormat;                                        // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECohtmlImageFormat>                    PossibleFallbacks;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSingleFormatFallbacks;

// ScriptStruct CohtmlPlugin.ResourceHostPair
// 0x0020 (0x0020 - 0x0000)
struct FResourceHostPair final
{
public:
	class FString                                 Host;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HostLocation;                                      // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FResourceHostPair;

// ScriptStruct CohtmlPlugin.ProtocolPathDef
// 0x0040 (0x0040 - 0x0000)
struct FProtocolPathDef final
{
public:
	class FString                                 Protocol;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RootPath;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RelativePrefix;                                    // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WatcherPrefix;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FProtocolPathDef;

// ScriptStruct CohtmlPlugin.CohtmlViewSettings
// 0x0010 (0x0010 - 0x0000)
struct FCohtmlViewSettings final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsTransparent;                                     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimationFrameDefer;                               // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCohtmlViewSettings;

// ScriptStruct CohtmlPlugin.WidgetDrawData
// 0x0048 (0x0048 - 0x0000)
struct FWidgetDrawData final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x40];                                       // 0x0008(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWidgetDrawData;

// ScriptStruct CohtmlPlugin.CohtmlWidgetTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FCohtmlWidgetTickFunction final : public FTickFunction
{
public:
	class UCohtmlWidget*                          WidgetToTick;                                      // 0x0028(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCohtmlWidgetTickFunction;

// ScriptStruct CohtmlPlugin.GbxAtlasMappingInfo
// 0x0038 (0x0038 - 0x0000)
struct FGbxAtlasMappingInfo final
{
public:
	class FString                                 AtlasName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AtlasTexturePath;                                  // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ContentRectWidth;                                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ContentRectHeight;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginX;                                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginY;                                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxAtlasMappingInfo;

// ScriptStruct CohtmlPlugin.GbxAtlasAssetMap
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FGbxAtlasAssetMap final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAtlasAssetMap;

// ScriptStruct CohtmlPlugin.PreloadPathDef
// 0x0020 (0x0020 - 0x0000)
struct FPreloadPathDef final
{
public:
	class FString                                 ProtocolPrefix;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RootPath;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPreloadPathDef;

// ScriptStruct CohtmlPlugin.CustomMaterialRenderData
// 0x001C (0x001C - 0x0000)
struct alignas(0x04) FCustomMaterialRenderData final
{
public:
	uint8                                         Pad_0[0x1C];                                       // 0x0000(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCustomMaterialRenderData;

// ScriptStruct CohtmlPlugin.CustomEffectDrawData
// 0x0028 (0x0028 - 0x0000)
struct FCustomEffectDrawData final
{
public:
	class UMaterialInstanceDynamic*               CustomMaterialInstance;                            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCustomEffectDrawData;

// ScriptStruct CohtmlPlugin.ArrayWrapper_CustomMaterialRenderData
// 0x0010 (0x0010 - 0x0000)
struct FArrayWrapper_CustomMaterialRenderData final
{
public:
	TArray<struct FCustomMaterialRenderData>      Array;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArrayWrapper_CustomMaterialRenderData;

// ScriptStruct CohtmlPlugin.ArrayWrapper_CustomEffectDrawData
// 0x0010 (0x0010 - 0x0000)
struct FArrayWrapper_CustomEffectDrawData final
{
public:
	TArray<struct FCustomEffectDrawData>          Array;                                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FArrayWrapper_CustomEffectDrawData;

// ScriptStruct CohtmlPlugin.RenderData
// 0x0018 (0x0018 - 0x0000)
struct FRenderData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             NewTexture;                                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRenderData;

// ScriptStruct CohtmlPlugin.CompositionData
// 0x0020 (0x0020 - 0x0000)
struct FCompositionData final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   Component;                                         // 0x0008(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Texture;                                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCompositionData;

}

