#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DC_DeformAlongSpline

#include "Basic.hpp"

#include "ST_GbxSwatch_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxDecorator_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DC_DeformAlongSpline.DC_DeformAlongSpline_C
// 0x0298 (0x0628 - 0x0390)
class ADC_DeformAlongSpline_C final : public AGbxDecoratorActor
{
public:
	class USplineComponent*                       Spline;                                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  ReferenceSpline;                                   // 0x0398(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             SplineMesh;                                        // 0x03C0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	ESplinePointType                              PointTypes;                                        // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               Axis;                                              // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLegacyMaterialOverride;                         // 0x03EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EB[0x5];                                      // 0x03EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_GbxSwatch                          MaterialSwatch;                                    // 0x03F0(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UMaterialInterface>> MaterialOverrides;                              // 0x0450(0x0010)(Edit, BlueprintVisible)
	bool                                          EnableSubdivision;                                 // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SubdivisionLength;                                 // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TwistOffset;                                       // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCollisionProfileName                  CollisionProfile;                                  // 0x0478(0x0008)(Edit, BlueprintVisible, NoDestructor, AdvancedDisplay)
	double                                        Radius;                                            // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Raycast;                                           // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RayCastDistance;                                   // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RayCastDirection;                                  // 0x0498(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RayCastSurfaceOffset;                              // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             StartCapMesh;                                      // 0x04B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FST_GbxSwatch                          StartCapSwatch;                                    // 0x04E0(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        StartCapScale;                                     // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             EndCapMesh;                                        // 0x0548(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FST_GbxSwatch                          EndCapSwatch;                                      // 0x0570(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        EndCapScale;                                       // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StartCapRotation;                                  // 0x05D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               EndCapRotation;                                    // 0x05F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RaycastHeightAdjust;                               // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshAxis                               RaycastHeightAdjustAxis;                           // 0x0609(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60A[0x6];                                      // 0x060A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class AActor>>          RaycastTargets;                                    // 0x0610(0x0010)(Edit, BlueprintVisible)
	bool                                          DoRaycastHeightAdjust;                             // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoStartCap;                                        // 0x0621(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoEndCap;                                          // 0x0622(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DC_DeformAlongSpline_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DC_DeformAlongSpline_C")
	}
	static class ADC_DeformAlongSpline_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADC_DeformAlongSpline_C>();
	}
};
DUMPER7_ASSERTS_ADC_DeformAlongSpline_C;

}

