#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DC_Fixt_Order_Spot_Triangle_Wall_Single_50Angle

#include "Basic.hpp"

#include "DC_Fixture_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DC_Fixt_Order_Spot_Triangle_Wall_Single_50Angle.DC_Fixt_Order_Spot_Triangle_Wall_Single_50Angle_C
// 0x0030 (0x0A40 - 0x0A10)
class ADC_Fixt_Order_Spot_Triangle_Wall_Single_50Angle_C final : public ADC_Fixture_C
{
public:
	class UBoxComponent*                          Box1;                                              // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Light_Bulb_Triangle_Flat_200;                   // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Arm_EndMount_A;                                 // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight1;                                        // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Light_Housing_Triangle_Flat_200;                // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Arm_Base_A;                                     // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DC_Fixt_Order_Spot_Triangle_Wall_Single_50Angle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DC_Fixt_Order_Spot_Triangle_Wall_Single_50Angle_C")
	}
	static class ADC_Fixt_Order_Spot_Triangle_Wall_Single_50Angle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADC_Fixt_Order_Spot_Triangle_Wall_Single_50Angle_C>();
	}
};
DUMPER7_ASSERTS_ADC_Fixt_Order_Spot_Triangle_Wall_Single_50Angle_C;

}

