#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DC_Fixt_Stake_Beacon_Simple

#include "Basic.hpp"

#include "DC_Fixture_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DC_Fixt_Stake_Beacon_Simple.DC_Fixt_Stake_Beacon_Simple_C
// 0x0030 (0x0A40 - 0x0A10)
class ADC_Fixt_Stake_Beacon_Simple_C final : public ADC_Fixture_C
{
public:
	class UCapsuleComponent*                      Capsule;                                           // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Light_Base_Round_Small;                         // 0x0A10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Light_Attachment_Cage_Cylinder;                 // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Light_Bulb_Single_Cylinder;                     // 0x0A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight_0;                                      // 0x0A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Light_Base_Stake;                               // 0x0A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DC_Fixt_Stake_Beacon_Simple_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DC_Fixt_Stake_Beacon_Simple_C")
	}
	static class ADC_Fixt_Stake_Beacon_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADC_Fixt_Stake_Beacon_Simple_C>();
	}
};
DUMPER7_ASSERTS_ADC_Fixt_Stake_Beacon_Simple_C;

}

