#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DC_Pipe

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_Cap_structs.hpp"
#include "ST_GbxSwatch_structs.hpp"
#include "E_Axis_2D_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxDecorator_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DC_Pipe.DC_Pipe_C
// 0x01B0 (0x0540 - 0x0390)
class ADC_Pipe_C final : public AGbxDecoratorActor
{
public:
	class USplineComponent*                       Spline;                                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ADC_Pipe_C>              Parent;                                            // 0x0398(0x0028)(Edit, BlueprintVisible, DisableEditOnTemplate, HasGetValueTypeHash)
	int32                                         ParentPosition;                                    // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Cap                                         ParentCap;                                         // 0x03C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 MeshPreset;                                        // 0x03C8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FST_GbxSwatch                          MaterialSwatch;                                    // 0x03F0(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	double                                        GlobalDiameter;                                    // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EndCapPosition;                                    // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             EndCap;                                            // 0x0460(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                 EndCapName;                                        // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         StartCapPosition;                                  // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             StartCap;                                          // 0x04A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                 StartCapName;                                      // 0x04C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             FlangeAddOn;                                       // 0x04D8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FTransform>                     StartTransforms;                                   // 0x0500(0x0010)(Edit, BlueprintVisible, AdvancedDisplay)
	TArray<struct FTransform>                     EndTransforms;                                     // 0x0510(0x0010)(Edit, BlueprintVisible, AdvancedDisplay)
	TArray<TSoftObjectPtr<class ADC_Pipe_C>>      Childs;                                            // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, AdvancedDisplay)
	bool                                          Flipped;                                           // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Axis_2D                                     StartingAxis;                                      // 0x0531(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasParent;                                         // 0x0532(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            Mobility;                                          // 0x0533(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCollisionProfileName                  Collision;                                         // 0x0534(0x0008)(Edit, BlueprintVisible, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DC_Pipe_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DC_Pipe_C")
	}
	static class ADC_Pipe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADC_Pipe_C>();
	}
};
DUMPER7_ASSERTS_ADC_Pipe_C;

}

