#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DC_Walkway

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_Cap_structs.hpp"
#include "E_Walkway_Railing_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_GbxSwatch_structs.hpp"
#include "E_Walkway_Railing_Cap_Selection_structs.hpp"
#include "GbxDecorator_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DC_Walkway.DC_Walkway_C
// 0x0170 (0x0500 - 0x0390)
class ADC_Walkway_C final : public AGbxDecoratorActor
{
public:
	class USplineComponent*                       Spline;                                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 MeshPreset;                                        // 0x0398(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_Cap                                         ParentCap;                                         // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ParentPosition;                                    // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     StartTransforms;                                   // 0x03C8(0x0010)(Edit, BlueprintVisible, AdvancedDisplay)
	TArray<struct FTransform>                     EndTransforms;                                     // 0x03D8(0x0010)(Edit, BlueprintVisible, AdvancedDisplay)
	TSoftObjectPtr<class UStaticMesh>             StartCap;                                          // 0x03E8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         StartCapPosition;                                  // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StartCapName;                                      // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         StartCapRailings;                                  // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Walkway_Railing_Cap_Selection               StartCapRailingsSelection;                         // 0x042C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StartCapRepeat;                                    // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             EndCap;                                            // 0x0438(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         EndCapPosition;                                    // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EndCapName;                                        // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FST_GbxSwatch                          MaterialSwatch;                                    // 0x0478(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	E_Walkway_Railing                             RailingMode;                                       // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EndCapRailings;                                    // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_Walkway_Railing_Cap_Selection               EndCapRailingsSelection;                           // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EndCapRepeat;                                      // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            Mobility;                                          // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Flip;                                              // 0x04E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA[0x2];                                      // 0x04EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCollisionProfileName                  Collision;                                         // 0x04EC(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FCollisionProfileName                  RailingCollision;                                  // 0x04F4(0x0008)(Edit, BlueprintVisible, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DC_Walkway_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DC_Walkway_C")
	}
	static class ADC_Walkway_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADC_Walkway_C>();
	}
};
DUMPER7_ASSERTS_ADC_Walkway_C;

}

