#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnhancementStatCombinationStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct EnhancementStatCombinationStruct.EnhancementStatCombinationStruct
// 0x00D0 (0x00D0 - 0x0000)
struct FEnhancementStatCombinationStruct final
{
public:
	class FText                                   Single_9_A4F43AF44E44D67FEB8DFBBBEDE9EC07;         // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_Damage_31_6FC66D234A94D668BC80869F88D8FF31; // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_FireRate_17_BEDF4E35434DD1003083859A8CA12B5C; // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_Accuracy_20_B2121B784B0137A243D910A020FFBD45; // 0x0030(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_SplashDamage_25_3A168BB143D689C55139B783377011A4; // 0x0040(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_CriticalDamage_26_42C3658C4CF93BE4F87EEC8DA5F5E0CA; // 0x0050(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_SplashRadius_28_0BA1942A4BB4BD05AB427A83915F47C7; // 0x0060(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_ADS_Proficiency_30_43A72D1E44FC69A6805C408FE026ACF3; // 0x0070(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_StatusEffect_Damage_34_F41CDB124468856AEA07DD918991CA74; // 0x0080(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_StatusEffect_Chance_37_FF7ADD2642C11016030A69BC486161DD; // 0x0090(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_ReloadSpeed_39_6580002D4AECEC9D4EA7F789951F8A1C; // 0x00A0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_MagSize_41_7F77089840CF267A58691F8A55237AAE; // 0x00B0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Stat_Weapon_EquipSpeed_43_3787CCEF493B2485200992BFB965E3F6; // 0x00C0(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FEnhancementStatCombinationStruct;

}

