#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnhancementCoreCombinationStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct EnhancementCoreCombinationStruct.EnhancementCoreCombinationStruct
// 0x02D0 (0x02D0 - 0x0000)
struct FEnhancementCoreCombinationStruct final
{
public:
	class FText                                   Single_9_A4F43AF44E44D67FEB8DFBBBEDE9EC07;         // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_ATL_Protractor_47_7F77089840CF267A58691F8A55237AAE; // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_ATL_SureShot_48_3787CCEF493B2485200992BFB965E3F6; // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_ATL_TrackerAntenna_51_408214D64E747B072A2318882509C4DA; // 0x0030(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_ATL_TraumaBond_53_0693009942BBF5EAF8A4F3872ECEB3BE; // 0x0040(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_BOR_FreeLoader_58_E7E9D02141624F3FB49F54A780FE3AA0; // 0x0050(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_BOR_HardCharger_59_4D8304D74E21BD060C7F90947E37927D; // 0x0060(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_BOR_HighRoller_60_287298914E2F62C8AA87AF8F0CD67716; // 0x0070(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_BOR_ShortCircuit_61_94E3E99E4983EC4EB655BFAB5D679230; // 0x0080(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_COV_ColdOpen_66_DA8242364683AC405BFA76824CBA2F0D; // 0x0090(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_COV_DuctTape_67_2F57FAA04720D039FB7BD5BC21057D90; // 0x00A0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_COV_Smelter_68_912258A34C4ABAAB14CF1B967C9BABA8; // 0x00B0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_COV_Ventilator_69_2FEC46C348CF8909622F1A84707B94B1; // 0x00C0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_DAD_Accelerator_74_CBA719474A73AD3503577B886832363C; // 0x00D0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_DAD_BackupPlan_75_30A65F5240C2D54599265E96AE1F083C; // 0x00E0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_DAD_BulletFabricator_76_CA2351BD4AEDFCBF125BF5BDE331047B; // 0x00F0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_DAD_Stockpiler_77_2674303242E0A31AC26943B2133F52BB; // 0x0100(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_HYP_Bulwark_82_349BC0104264FB8234BE31B69FE1E70F; // 0x0110(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_HYP_ShockGuard_83_0E048DA540168F85F52894AE6ACBC3BE; // 0x0120(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_HYP_Stabilizer_84_FD7F0D74419E0A017207E09EE881AA75; // 0x0130(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_HYP_StimConverter_85_0038046244DE0B42782DD0B4184BDCF6; // 0x0140(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_JAK_BouncePass_90_D7C052DE4DE41913A5D7AD8B53D86E45; // 0x0150(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_JAK_Leaper_93_A91E12844A1B2C2A84ED838B343429E3; // 0x0160(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_JAK_Piercer_94_AF6BD4824904BF2B0BF0EF8931BA4409; // 0x0170(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_JAK_Sequencer_102_223194A64AB09C64EA078D95FF973E4A; // 0x0180(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_MAL_Mixologist_103_9220057F4994025465EAD68B5E8FD829; // 0x0190(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_MAL_PrimedPotency_104_411F4FA34E9E273C08339CB3A6BB9438; // 0x01A0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_MAL_Synthesizer_105_CC1E3C494E2886ED8E1C3CB9381C192B; // 0x01B0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_MAL_Transfuser_106_D827639C47418630D757AAB23837606B; // 0x01C0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_ORD_AmmoGenerator_111_84F0AE5044C73F4E9A12E78AEE9A5DA2; // 0x01D0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_ORD_FreeCharger_112_834B4B4E43BF93EF0A8A15AFDF09CFE4; // 0x01E0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_ORD_MuzzleBrake_113_A124745F4F2572016C7B2788B69CA109; // 0x01F0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_ORD_PowerShot_114_8DBAB2F246EC64888E0A9D8E61E89F04; // 0x0200(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_TED_Banger_119_D23D4C7D4068A06FE63D6480971E35C0; // 0x0210(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_TED_ExtendaFriend_141_DD143D4B4CECA07221136DA1B4C7A20B; // 0x0220(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_TED_Recycler_123_BDF37FF8426B227C37BE14BB36D270C6; // 0x0230(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_TED_Digidivider_124_259DC74F49F5704E1A296C9355A52057; // 0x0240(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_TOR_AirBurst_129_F1261C954DC12B458A1D68A12A8F3974; // 0x0250(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_TOR_Boompuppy_130_D09564A343A1B2C8CE7E239E954818B5; // 0x0260(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_TOR_Explosiception_131_BD0CF7744593C7C922E311A6C78BDA49; // 0x0270(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_TOR_HeadRinger_132_11CC5EBF497F361B0B91FFAC9B6C11DA; // 0x0280(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_VLA_BottomFeeder_137_B65D64CE4DDBCC24E08FCA922ED0E922; // 0x0290(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_VLA_BoxMagazine_138_AAD6BF05444BA5A152C2388A0D53907E; // 0x02A0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_VLA_BulletHose_139_46A7459A42A67E151E6668A8E413325B; // 0x02B0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Part_Core_VLA_Underdog_140_45112E074DB5D386F5372FB7EE4F6FB1; // 0x02C0(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FEnhancementCoreCombinationStruct;

}

