#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FixtureMeshOverrideStruct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct FixtureMeshOverrideStruct.FixtureMeshOverrideStruct
// 0x0068 (0x0068 - 0x0000)
struct FFixtureMeshOverrideStruct final
{
public:
	class UStaticMesh*                            MeshesToReplace_16_DEF2270F4598A04920591C95E0509947; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ReplaceAboveMeshesWith_17_765267D747F8D6A63B0BD1B28ED188E3; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          RemoveMesh_20_1F8CB7C7487B465DBE55E8B2D7E9687F;    // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LocationOffset_8_7CC82DC84999CB8E2D337EA56484A32A; // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationOffset_13_AD87CB9E417F47A609A9ACA537C1396E; // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                ScaleOffset_12_924D19464CC9FCB847700EA4960C3FB2;   // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToggleShadow_25_8F32A0C24D90646E2DE055B422133D41;  // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToggleAffectIndirectLightingWhenHidden_29_1EB2CEC344615D7AA65099B3FAC4962D; // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToggleHidden_31_704D9BD14E4B2603A9A530BAD086C09A;  // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToggleAffectDistanceFieldLighting_36_FE04A54F4C61862909B1BB885993B27D; // 0x0063(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ToggleCollision_38_A7AE150140F2ECC9A5A4329626CE7D23; // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFixtureMeshOverrideStruct;

}

