#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameSettings

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameSettings_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GameSettings.GameResponsivePanel
// 0x0018 (0x0198 - 0x0180)
class UGameResponsivePanel final : public UPanelWidget
{
public:
	bool                                          bCanStackVertically;                               // 0x0180(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x17];                                     // 0x0181(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UGameResponsivePanelSlot* AddChildToGameResponsivePanel(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameResponsivePanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameResponsivePanel")
	}
	static class UGameResponsivePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameResponsivePanel>();
	}
};
DUMPER7_ASSERTS_UGameResponsivePanel;

// Class GameSettings.GameResponsivePanelSlot
// 0x0008 (0x0040 - 0x0038)
class UGameResponsivePanelSlot final : public UPanelSlot
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameResponsivePanelSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameResponsivePanelSlot")
	}
	static class UGameResponsivePanelSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameResponsivePanelSlot>();
	}
};
DUMPER7_ASSERTS_UGameResponsivePanelSlot;

// Class GameSettings.GameSetting
// 0x0110 (0x0138 - 0x0028)
class UGameSetting : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           LocalPlayer;                                       // 0x0058(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameSetting*                           SettingParent;                                     // 0x0060(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameSettingRegistry*                   OwningRegistry;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_70[0xC8];                                      // 0x0070(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	ESlateVisibility GetDisplayNameVisibility();

	class FText GetDescriptionRichText() const;
	class FName GetDevName() const;
	class FText GetDisplayName() const;
	class FText GetDynamicDetails() const;
	const struct FGameplayTagContainer GetTags() const;
	class FText GetWarningRichText() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSetting")
	}
	static class UGameSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSetting>();
	}
};
DUMPER7_ASSERTS_UGameSetting;

// Class GameSettings.GameSettingAction
// 0x0048 (0x0180 - 0x0138)
class UGameSettingAction : public UGameSetting
{
public:
	uint8                                         Pad_138[0x48];                                     // 0x0138(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingAction")
	}
	static class UGameSettingAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingAction>();
	}
};
DUMPER7_ASSERTS_UGameSettingAction;

// Class GameSettings.GameSettingCollection
// 0x0010 (0x0148 - 0x0138)
class UGameSettingCollection : public UGameSetting
{
public:
	TArray<class UGameSetting*>                   settings;                                          // 0x0138(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingCollection")
	}
	static class UGameSettingCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingCollection>();
	}
};
DUMPER7_ASSERTS_UGameSettingCollection;

// Class GameSettings.GameSettingCollectionPage
// 0x0028 (0x0170 - 0x0148)
class UGameSettingCollectionPage final : public UGameSettingCollection
{
public:
	uint8                                         Pad_148[0x28];                                     // 0x0148(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingCollectionPage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingCollectionPage")
	}
	static class UGameSettingCollectionPage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingCollectionPage>();
	}
};
DUMPER7_ASSERTS_UGameSettingCollectionPage;

// Class GameSettings.GameSettingDetailExtension
// 0x0008 (0x02D8 - 0x02D0)
class UGameSettingDetailExtension final : public UUserWidget
{
public:
	class UGameSetting*                           Setting;                                           // 0x02D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnSettingAssigned(class UGameSetting* InSetting);
	void OnSettingValueChanged(class UGameSetting* InSetting);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingDetailExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingDetailExtension")
	}
	static class UGameSettingDetailExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingDetailExtension>();
	}
};
DUMPER7_ASSERTS_UGameSettingDetailExtension;

// Class GameSettings.GameSettingDetailView
// 0x00D8 (0x03A8 - 0x02D0)
class UGameSettingDetailView final : public UUserWidget
{
public:
	class UGameSettingVisualData*                 VisualData;                                        // 0x02D0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUserWidgetPool                        ExtensionWidgetPool;                               // 0x02D8(0x0088)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UGameSetting*                           CurrentSetting;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0x10];                                     // 0x0368(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_SettingName;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_DynamicDetails;                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_WarningDetails;                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_DisabledDetails;                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                           Box_DetailsExtension;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingDetailView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingDetailView")
	}
	static class UGameSettingDetailView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingDetailView>();
	}
};
DUMPER7_ASSERTS_UGameSettingDetailView;

// Class GameSettings.GameSettingListEntryBase
// 0x0030 (0x0328 - 0x02F8)
class UGameSettingListEntryBase : public UCommonUserWidget
{
public:
	uint8                                         Pad_2F8[0x10];                                     // 0x02F8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSetting*                           Setting;                                           // 0x0308(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_310[0x10];                                     // 0x0310(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Background;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UWidget* GetPrimaryGamepadFocusWidget();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntryBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntryBase")
	}
	static class UGameSettingListEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntryBase>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntryBase;

// Class GameSettings.GameSettingListEntry_Setting
// 0x0008 (0x0330 - 0x0328)
class UGameSettingListEntry_Setting : public UGameSettingListEntryBase
{
public:
	class UCommonTextBlock*                       Text_SettingName;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntry_Setting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntry_Setting")
	}
	static class UGameSettingListEntry_Setting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntry_Setting>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntry_Setting;

// Class GameSettings.GameSettingListEntrySetting_Discrete
// 0x0028 (0x0358 - 0x0330)
class UGameSettingListEntrySetting_Discrete final : public UGameSettingListEntry_Setting
{
public:
	class UGameSettingValueDiscrete*              DiscreteSetting;                                   // 0x0330(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_Value;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSettingRotator*                    Rotator_SettingValue;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Decrease;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Increase;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Discrete")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Discrete")
	}
	static class UGameSettingListEntrySetting_Discrete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Discrete>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Discrete;

// Class GameSettings.GameSettingListEntrySetting_Scalar
// 0x0020 (0x0350 - 0x0330)
class UGameSettingListEntrySetting_Scalar final : public UGameSettingListEntry_Setting
{
public:
	class UGameSettingValueScalar*                ScalarSetting;                                     // 0x0330(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_Value;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnalogSlider*                          Slider_SettingValue;                               // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_SettingValue;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleSliderCaptureEnded();
	void HandleSliderValueChanged(float Value);
	void OnDefaultValueChanged(float DefaultValue);
	void OnValueChanged(float Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Scalar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Scalar")
	}
	static class UGameSettingListEntrySetting_Scalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Scalar>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Scalar;

// Class GameSettings.GameSettingListEntrySetting_Action
// 0x0010 (0x0340 - 0x0330)
class UGameSettingListEntrySetting_Action final : public UGameSettingListEntry_Setting
{
public:
	class UGameSettingAction*                     ActionSetting;                                     // 0x0330(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Action;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSettingAssigned(const class FText& ActionText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Action")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Action")
	}
	static class UGameSettingListEntrySetting_Action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Action>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Action;

// Class GameSettings.GameSettingListEntrySetting_Navigation
// 0x0010 (0x0340 - 0x0330)
class UGameSettingListEntrySetting_Navigation final : public UGameSettingListEntry_Setting
{
public:
	class UGameSettingCollectionPage*             CollectionSetting;                                 // 0x0330(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Navigate;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSettingAssigned(const class FText& ActionText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Navigation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Navigation")
	}
	static class UGameSettingListEntrySetting_Navigation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Navigation>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Navigation;

// Class GameSettings.GameSettingListView
// 0x0060 (0x0BA0 - 0x0B40)
class UGameSettingListView final : public UListView
{
public:
	class UGameSettingVisualData*                 VisualData;                                        // 0x0B40(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B48[0x58];                                     // 0x0B48(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListView")
	}
	static class UGameSettingListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListView>();
	}
};
DUMPER7_ASSERTS_UGameSettingListView;

// Class GameSettings.GameSettingPanel
// 0x0428 (0x0720 - 0x02F8)
class UGameSettingPanel final : public UCommonUserWidget
{
public:
	uint8                                         Pad_2F8[0x18];                                     // 0x02F8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingRegistry*                   registry;                                          // 0x0310(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UGameSetting*>                   VisibleSettings;                                   // 0x0318(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UGameSetting*                           LastHoveredOrSelectedSetting;                      // 0x0328(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameSettingFilterState                FilterState;                                       // 0x0330(0x03A0)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FGameSettingFilterState>        FilterNavigationStack;                             // 0x06D0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6E0[0x10];                                     // 0x06E0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingListView*                   ListView_Settings;                                 // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSettingDetailView*                 Details_Settings;                                  // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class UGameSetting* Setting, const struct FGameplayTag& Action)> BP_OnExecuteNamedAction; // 0x0700(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_710[0x10];                                     // 0x0710(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingPanel")
	}
	static class UGameSettingPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingPanel>();
	}
};
DUMPER7_ASSERTS_UGameSettingPanel;

// Class GameSettings.GameSettingPressAnyKey
// 0x0048 (0x0478 - 0x0430)
class UGameSettingPressAnyKey : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_430[0x48];                                     // 0x0430(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingPressAnyKey")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingPressAnyKey")
	}
	static class UGameSettingPressAnyKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingPressAnyKey>();
	}
};
DUMPER7_ASSERTS_UGameSettingPressAnyKey;

// Class GameSettings.GameSettingRegistry
// 0x0088 (0x00B0 - 0x0028)
class UGameSettingRegistry : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameSetting*>                   TopLevelSettings;                                  // 0x0088(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UGameSetting*>                   RegisteredSettings;                                // 0x0098(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class ULocalPlayer*                           OwningLocalPlayer;                                 // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingRegistry")
	}
	static class UGameSettingRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingRegistry>();
	}
};
DUMPER7_ASSERTS_UGameSettingRegistry;

// Class GameSettings.GameSettingRotator
// 0x0000 (0x1420 - 0x1420)
class UGameSettingRotator final : public UCommonRotator
{
public:
	void BP_OnDefaultOptionSpecified(int32 DefaultOptionIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingRotator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingRotator")
	}
	static class UGameSettingRotator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingRotator>();
	}
};
DUMPER7_ASSERTS_UGameSettingRotator;

// Class GameSettings.GameSettingScreen
// 0x0070 (0x04A0 - 0x0430)
class UGameSettingScreen final : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_430[0x60];                                     // 0x0430(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingPanel*                      Settings_Panel;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSettingRegistry*                   registry;                                          // 0x0498(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ApplyChanges();
	bool AttemptToPopNavigation();
	void CancelChanges();
	class UGameSettingCollection* GetSettingCollection(class FName SettingDevName, bool* HasAnySettings);
	void NavigateToSetting(class FName SettingDevName);
	void NavigateToSettings(const TArray<class FName>& SettingDevNames);
	void OnSettingsDirtyStateChanged(bool bSettingsDirty);

	bool HaveSettingsBeenChanged() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingScreen")
	}
	static class UGameSettingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingScreen>();
	}
};
DUMPER7_ASSERTS_UGameSettingScreen;

// Class GameSettings.GameSettingValue
// 0x0000 (0x0138 - 0x0138)
class UGameSettingValue : public UGameSetting
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValue")
	}
	static class UGameSettingValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValue>();
	}
};
DUMPER7_ASSERTS_UGameSettingValue;

// Class GameSettings.GameSettingValueDiscrete
// 0x0000 (0x0138 - 0x0138)
class UGameSettingValueDiscrete : public UGameSettingValue
{
public:
	int32 GetDiscreteOptionDefaultIndex() const;
	int32 GetDiscreteOptionIndex() const;
	TArray<class FText> GetDiscreteOptions() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscrete")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscrete")
	}
	static class UGameSettingValueDiscrete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscrete>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscrete;

// Class GameSettings.GameSettingValueDiscreteDynamic
// 0x0060 (0x0198 - 0x0138)
class UGameSettingValueDiscreteDynamic : public UGameSettingValueDiscrete
{
public:
	uint8                                         Pad_138[0x60];                                     // 0x0138(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic")
	}
	static class UGameSettingValueDiscreteDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic;

// Class GameSettings.GameSettingValueDiscreteDynamic_Bool
// 0x0000 (0x0198 - 0x0198)
class UGameSettingValueDiscreteDynamic_Bool : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Bool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Bool")
	}
	static class UGameSettingValueDiscreteDynamic_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Bool>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Bool;

// Class GameSettings.GameSettingValueDiscreteDynamic_Number
// 0x0000 (0x0198 - 0x0198)
class UGameSettingValueDiscreteDynamic_Number final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Number")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Number")
	}
	static class UGameSettingValueDiscreteDynamic_Number* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Number>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Number;

// Class GameSettings.GameSettingValueDiscreteDynamic_Enum
// 0x0000 (0x0198 - 0x0198)
class UGameSettingValueDiscreteDynamic_Enum final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Enum")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Enum")
	}
	static class UGameSettingValueDiscreteDynamic_Enum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Enum>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Enum;

// Class GameSettings.GameSettingValueDiscreteDynamic_Color
// 0x0000 (0x0198 - 0x0198)
class UGameSettingValueDiscreteDynamic_Color final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Color")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Color")
	}
	static class UGameSettingValueDiscreteDynamic_Color* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Color>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Color;

// Class GameSettings.GameSettingValueDiscreteDynamic_Vector2D
// 0x0000 (0x0198 - 0x0198)
class UGameSettingValueDiscreteDynamic_Vector2D final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Vector2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Vector2D")
	}
	static class UGameSettingValueDiscreteDynamic_Vector2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Vector2D>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Vector2D;

// Class GameSettings.GameSettingValueScalar
// 0x0000 (0x0138 - 0x0138)
class UGameSettingValueScalar : public UGameSettingValue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueScalar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueScalar")
	}
	static class UGameSettingValueScalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueScalar>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueScalar;

// Class GameSettings.GameSettingValueScalarDynamic
// 0x00C8 (0x0200 - 0x0138)
class UGameSettingValueScalarDynamic : public UGameSettingValueScalar
{
public:
	uint8                                         Pad_138[0xC8];                                     // 0x0138(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueScalarDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueScalarDynamic")
	}
	static class UGameSettingValueScalarDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueScalarDynamic>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueScalarDynamic;

// Class GameSettings.GameSettingVisualData
// 0x0140 (0x0170 - 0x0030)
class UGameSettingVisualData final : public UDataAsset
{
public:
	TMap<TSubclassOf<class UGameSetting>, TSubclassOf<class UGameSettingListEntryBase>> EntryWidgetForClass; // 0x0030(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FName, TSubclassOf<class UGameSettingListEntryBase>> EntryWidgetForName;              // 0x0080(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UGameSetting>, struct FGameSettingClassExtensions> ExtensionsForClasses;  // 0x00D0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FGameSettingNameExtensions> ExtensionsForName;                          // 0x0120(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingVisualData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingVisualData")
	}
	static class UGameSettingVisualData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingVisualData>();
	}
};
DUMPER7_ASSERTS_UGameSettingVisualData;

// Class GameSettings.GameSettingActionInterface
// 0x0000 (0x0000 - 0x0000)
class IGameSettingActionInterface final
{
public:
	bool ExecuteActionForSetting(const struct FGameplayTag& ActionTag, class UGameSetting* InSetting);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingActionInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingActionInterface")
	}
	static class IGameSettingActionInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameSettingActionInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGameSettingActionInterface;

// Class GameSettings.KeyAlreadyBoundWarning
// 0x0010 (0x0488 - 0x0478)
class UKeyAlreadyBoundWarning final : public UGameSettingPressAnyKey
{
public:
	class UTextBlock*                             WarningText;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CancelText;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KeyAlreadyBoundWarning")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KeyAlreadyBoundWarning")
	}
	static class UKeyAlreadyBoundWarning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeyAlreadyBoundWarning>();
	}
};
DUMPER7_ASSERTS_UKeyAlreadyBoundWarning;

}

