#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxAI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxAI_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GbxAI.Cover.SetCoverEnabled
// 0x0001 (0x0001 - 0x0000)
struct Cover_SetCoverEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Cover_SetCoverEnabled;

// Function GbxAI.CoverSlotComponent.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct CoverSlotComponent_SetEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CoverSlotComponent_SetEnabled;

// Function GbxAI.CoverSlotComponent.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct CoverSlotComponent_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CoverSlotComponent_IsEnabled;

// Function GbxAI.CoverStatics.AIScriptedCover
// 0x0030 (0x0030 - 0x0000)
struct CoverStatics_AIScriptedCover final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Cover;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxBrainExec                                 Exec;                                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0018(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CoverStatics_AIScriptedCover;

// Function GbxAI.GbxChildActorComponent.GetOrWaitForChildActor
// 0x0028 (0x0028 - 0x0000)
struct GbxChildActorComponent_GetOrWaitForChildActor final
{
public:
	class UGbxChildActorComponent*                Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Child;                                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0010(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxChildActorComponent_GetOrWaitForChildActor;

// Function GbxAI.GbxChildActorComponent.GetChildActor
// 0x0008 (0x0008 - 0x0000)
struct GbxChildActorComponent_GetChildActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxChildActorComponent_GetChildActor;

// Function GbxAI.GbxAIHeldActorComponent.OnHeldActorSpawned
// 0x0008 (0x0008 - 0x0000)
struct GbxAIHeldActorComponent_OnHeldActorSpawned final
{
public:
	class AActor*                                 NewHeldActor;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAIHeldActorComponent_OnHeldActorSpawned;

// Function GbxAI.GbxAIDebugDataReplicator.ServerSetClientListening
// 0x0010 (0x0010 - 0x0000)
struct GbxAIDebugDataReplicator_ServerSetClientListening final
{
public:
	const class APlayerController*                ClientPC;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bListening;                                        // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAIDebugDataReplicator_ServerSetClientListening;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_Destroy
// 0x0018 (0x0018 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_Destroy final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_Destroy;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_Drop
// 0x0020 (0x0020 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_Drop final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequestNewHeldActor;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InstigatorOverride;                                // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_Drop;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_GetActors
// 0x0028 (0x0028 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_GetActors final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_GetActors;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_Hide
// 0x0018 (0x0018 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_Hide final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_Hide;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_SetChildActorDef
// 0x0030 (0x0030 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_SetChildActorDef final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      NewActorDef;                                       // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_SetChildActorDef;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_Show
// 0x0018 (0x0018 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_Show final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_Show;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_Spawn
// 0x0018 (0x0018 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_Spawn final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_Spawn;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_ThrowAtActor
// 0x00C8 (0x00C8 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_ThrowAtActor final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxRelativeLocation                   TargetOptions;                                     // 0x0010(0x0060)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTrajectoryOptions                     TrajectoryOptions;                                 // 0x0070(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRequestNewHeldActor;                              // 0x00B8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpawnIfDoesNotExist;                              // 0x00B9(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x00BC(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x00C4(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_ThrowAtActor;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_ThrowAtTarget
// 0x00C0 (0x00C0 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_ThrowAtTarget final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxRelativeLocation                   TargetOptions;                                     // 0x0008(0x0060)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTrajectoryOptions                     TrajectoryOptions;                                 // 0x0068(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRequestNewHeldActor;                              // 0x00B0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpawnIfDoesNotExist;                              // 0x00B1(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x00B4(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x00BC(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_ThrowAtTarget;

// Function GbxAI.GbxAIHeldActorFunctionLibrary.AIHeldActor_ThrowHeldActorAtLocation
// 0x0078 (0x0078 - 0x0000)
struct GbxAIHeldActorFunctionLibrary_AIHeldActor_ThrowHeldActorAtLocation final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ThrowAtLocation;                                   // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTrajectoryOptions                     TrajectoryOptions;                                 // 0x0020(0x0048)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bRequestNewHeldActor;                              // 0x0068(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSpawnIfDoesNotExist;                              // 0x0069(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x006C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0074(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAIHeldActorFunctionLibrary_AIHeldActor_ThrowHeldActorAtLocation;

// Function GbxAI.GbxAttachableActorLibrary.AttachActorToActor
// 0x0020 (0x0020 - 0x0000)
struct GbxAttachableActorLibrary_AttachActorToActor final
{
public:
	class AActor*                                 ChildActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ParentActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               LocationRule;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               RotationRule;                                      // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               ScaleRule;                                         // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeldSimulatedBodies;                              // 0x001B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttachableActorLibrary_AttachActorToActor;

// Function GbxAI.GbxAttachableActorLibrary.AttachActorToComponent
// 0x0020 (0x0020 - 0x0000)
struct GbxAttachableActorLibrary_AttachActorToComponent final
{
public:
	class AActor*                                 ChildActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Parent;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               LocationRule;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               RotationRule;                                      // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               ScaleRule;                                         // 0x001A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWeldSimulatedBodies;                              // 0x001B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttachableActorLibrary_AttachActorToComponent;

// Function GbxAI.GbxAttachableActorLibrary.DetachActor
// 0x0010 (0x0010 - 0x0000)
struct GbxAttachableActorLibrary_DetachActor final
{
public:
	class AActor*                                 ChildActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               LocationRule;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               RotationRule;                                      // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetachmentRule                               ScaleRule;                                         // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttachableActorLibrary_DetachActor;

// Function GbxAI.GbxBrainFunctionLibrary.AbortScriptedBrainTask
// 0x0010 (0x0010 - 0x0000)
struct GbxBrainFunctionLibrary_AbortScriptedBrainTask final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopImmediately;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_AbortScriptedBrainTask;

// Function GbxAI.GbxBrainFunctionLibrary.AIReplaceDefaultTask
// 0x0010 (0x0010 - 0x0000)
struct GbxBrainFunctionLibrary_AIReplaceDefaultTask final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxBrainTaskData*                      Task;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_AIReplaceDefaultTask;

// Function GbxAI.GbxBrainFunctionLibrary.AIResetDefaultTask
// 0x0008 (0x0008 - 0x0000)
struct GbxBrainFunctionLibrary_AIResetDefaultTask final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_AIResetDefaultTask;

// Function GbxAI.GbxBrainFunctionLibrary.AIScriptedLook
// 0x0030 (0x0030 - 0x0000)
struct GbxBrainFunctionLibrary_AIScriptedLook final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxBrainExec                                 Exec;                                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0018(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_AIScriptedLook;

// Function GbxAI.GbxBrainFunctionLibrary.AIScriptedMove
// 0x0030 (0x0030 - 0x0000)
struct GbxBrainFunctionLibrary_AIScriptedMove final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 GoalActor;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxBrainExec                                 Exec;                                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0018(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_AIScriptedMove;

// Function GbxAI.GbxBrainFunctionLibrary.AIScriptedTask
// 0x0010 (0x0010 - 0x0000)
struct GbxBrainFunctionLibrary_AIScriptedTask final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxBrainTaskData*                      Task;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_AIScriptedTask;

// Function GbxAI.GbxBrainFunctionLibrary.AIScriptedTeleport
// 0x0040 (0x0040 - 0x0000)
struct GbxBrainFunctionLibrary_AIScriptedTeleport final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GoalLocation;                                      // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxBrainExec                                 Exec;                                              // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0028(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_AIScriptedTeleport;

// Function GbxAI.GbxBrainFunctionLibrary.AIScriptedWait
// 0x0008 (0x0008 - 0x0000)
struct GbxBrainFunctionLibrary_AIScriptedWait final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_AIScriptedWait;

// Function GbxAI.GbxBrainFunctionLibrary.LockThinking
// 0x0018 (0x0018 - 0x0000)
struct GbxBrainFunctionLibrary_LockThinking final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Block;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbort;                                            // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_LockThinking;

// Function GbxAI.GbxBrainFunctionLibrary.UnlockThinking
// 0x0010 (0x0010 - 0x0000)
struct GbxBrainFunctionLibrary_UnlockThinking final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBrainFunctionLibrary_UnlockThinking;

// Function GbxAI.GbxTargetingFunctionLibrary.AIClearScriptedTarget
// 0x0008 (0x0008 - 0x0000)
struct GbxTargetingFunctionLibrary_AIClearScriptedTarget final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_AIClearScriptedTarget;

// Function GbxAI.GbxTargetingFunctionLibrary.AIGetScriptedTarget
// 0x0010 (0x0010 - 0x0000)
struct GbxTargetingFunctionLibrary_AIGetScriptedTarget final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_AIGetScriptedTarget;

// Function GbxAI.GbxTargetingFunctionLibrary.AIScriptedScoringBoost
// 0x0010 (0x0010 - 0x0000)
struct GbxTargetingFunctionLibrary_AIScriptedScoringBoost final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxTargetScoringBoost                        ScoringBoost;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_AIScriptedScoringBoost;

// Function GbxAI.GbxTargetingFunctionLibrary.AISetScriptedTarget
// 0x0018 (0x0018 - 0x0000)
struct GbxTargetingFunctionLibrary_AISetScriptedTarget final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyRestrictions;                                // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_AISetScriptedTarget;

// Function GbxAI.GbxTargetingFunctionLibrary.EveryoneForget
// 0x0008 (0x0008 - 0x0000)
struct GbxTargetingFunctionLibrary_EveryoneForget final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_EveryoneForget;

// Function GbxAI.GbxTargetingFunctionLibrary.ForgetTarget
// 0x0010 (0x0010 - 0x0000)
struct GbxTargetingFunctionLibrary_ForgetTarget final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_ForgetTarget;

// Function GbxAI.GbxTargetingFunctionLibrary.GetAIScriptedScoringBoost
// 0x0010 (0x0010 - 0x0000)
struct GbxTargetingFunctionLibrary_GetAIScriptedScoringBoost final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxTargetScoringBoost                        ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_GetAIScriptedScoringBoost;

// Function GbxAI.GbxTargetingFunctionLibrary.GetBestTargetableSocket
// 0x0048 (0x0048 - 0x0000)
struct GbxTargetingFunctionLibrary_GetBestTargetableSocket final
{
public:
	class AActor*                                 target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Targeter;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseViewRotation;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x0014(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SocketLocation;                                    // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Component;                                         // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_GetBestTargetableSocket;

// Function GbxAI.GbxTargetingFunctionLibrary.GetPrimaryTarget
// 0x0010 (0x0010 - 0x0000)
struct GbxTargetingFunctionLibrary_GetPrimaryTarget final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_GetPrimaryTarget;

// Function GbxAI.GbxTargetingFunctionLibrary.GetPrimaryTargetLocation
// 0x0028 (0x0028 - 0x0000)
struct GbxTargetingFunctionLibrary_GetPrimaryTargetLocation final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocation;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_GetPrimaryTargetLocation;

// Function GbxAI.GbxTargetingFunctionLibrary.GetTarget
// 0x0020 (0x0020 - 0x0000)
struct GbxTargetingFunctionLibrary_GetTarget final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 PrimaryTarget;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         TargetList;                                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_GetTarget;

// Function GbxAI.GbxTargetingFunctionLibrary.GetTargetList
// 0x0018 (0x0018 - 0x0000)
struct GbxTargetingFunctionLibrary_GetTargetList final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_GetTargetList;

// Function GbxAI.GbxTargetingFunctionLibrary.GetTargetLocation
// 0x0030 (0x0030 - 0x0000)
struct GbxTargetingFunctionLibrary_GetTargetLocation final
{
public:
	class AActor*                                 Targeter;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                OutLocation;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_GetTargetLocation;

// Function GbxAI.GbxTargetingFunctionLibrary.LockPerceivability
// 0x0018 (0x0018 - 0x0000)
struct GbxTargetingFunctionLibrary_LockPerceivability final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Block;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_LockPerceivability;

// Function GbxAI.GbxTargetingFunctionLibrary.LockTarget
// 0x0018 (0x0018 - 0x0000)
struct GbxTargetingFunctionLibrary_LockTarget final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Block;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_LockTarget;

// Function GbxAI.GbxTargetingFunctionLibrary.LockTargetability
// 0x0018 (0x0018 - 0x0000)
struct GbxTargetingFunctionLibrary_LockTargetability final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Block;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_LockTargetability;

// Function GbxAI.GbxTargetingFunctionLibrary.LockTargetableByAI
// 0x0018 (0x0018 - 0x0000)
struct GbxTargetingFunctionLibrary_LockTargetableByAI final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Block;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEveryoneForget;                                   // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_LockTargetableByAI;

// Function GbxAI.GbxTargetingFunctionLibrary.LockTargeting
// 0x0018 (0x0018 - 0x0000)
struct GbxTargetingFunctionLibrary_LockTargeting final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Block;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForget;                                           // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_LockTargeting;

// Function GbxAI.GbxTargetingFunctionLibrary.RejoinAIGroup
// 0x0008 (0x0008 - 0x0000)
struct GbxTargetingFunctionLibrary_RejoinAIGroup final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_RejoinAIGroup;

// Function GbxAI.GbxTargetingFunctionLibrary.SetInvisibleToAI
// 0x0018 (0x0018 - 0x0000)
struct GbxTargetingFunctionLibrary_SetInvisibleToAI final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTargetingFunctionLibrary_SetInvisibleToAI;

// Function GbxAI.GbxTeamFunctionLibrary.GetAttitudeTowards
// 0x0018 (0x0018 - 0x0000)
struct GbxTeamFunctionLibrary_GetAttitudeTowards final
{
public:
	class AActor*                                 Perceiver;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETeamAttitude                                 ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_GetAttitudeTowards;

// Function GbxAI.GbxTeamFunctionLibrary.GetDisplayName
// 0x0028 (0x0028 - 0x0000)
struct GbxTeamFunctionLibrary_GetDisplayName final
{
public:
	struct FGbxTeamIdHandle                       Team;                                              // 0x0000(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_GetDisplayName;

// Function GbxAI.GbxTeamFunctionLibrary.GetTeam
// 0x0020 (0x0020 - 0x0000)
struct GbxTeamFunctionLibrary_GetTeam final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_GetTeam;

// Function GbxAI.GbxTeamFunctionLibrary.GetTeamFromActorDef
// 0x0030 (0x0030 - 0x0000)
struct GbxTeamFunctionLibrary_GetTeamFromActorDef final
{
public:
	FGameDataHandleProperty_                      GbxActorDef;                                       // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_GetTeamFromActorDef;

// Function GbxAI.GbxTeamFunctionLibrary.GetTeamID
// 0x0020 (0x0020 - 0x0000)
struct GbxTeamFunctionLibrary_GetTeamID final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxTeamIdHandle                       ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_GetTeamID;

// Function GbxAI.GbxTeamFunctionLibrary.IsOnTeam
// 0x0028 (0x0028 - 0x0000)
struct GbxTeamFunctionLibrary_IsOnTeam final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      Team;                                              // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_IsOnTeam;

// Function GbxAI.GbxTeamFunctionLibrary.IsSameTeamId
// 0x0038 (0x0038 - 0x0000)
struct GbxTeamFunctionLibrary_IsSameTeamId final
{
public:
	struct FGbxTeamIdHandle                       Team;                                              // 0x0000(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxTeamIdHandle                       OtherTeam;                                         // 0x0018(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_IsSameTeamId;

// Function GbxAI.GbxTeamFunctionLibrary.SetTeam
// 0x0020 (0x0020 - 0x0000)
struct GbxTeamFunctionLibrary_SetTeam final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      Team;                                              // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_SetTeam;

// Function GbxAI.GbxTeamFunctionLibrary.SetTeamCollisionChannelFrom
// 0x0010 (0x0010 - 0x0000)
struct GbxTeamFunctionLibrary_SetTeamCollisionChannelFrom final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TeamActor;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_SetTeamCollisionChannelFrom;

// Function GbxAI.GbxTeamFunctionLibrary.SetTeamID
// 0x0020 (0x0020 - 0x0000)
struct GbxTeamFunctionLibrary_SetTeamID final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxTeamIdHandle                       Team;                                              // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTeamFunctionLibrary_SetTeamID;

// Function GbxAI.GbxTerritory.GetTerritory
// 0x0008 (0x0008 - 0x0000)
struct GbxTerritory_GetTerritory final
{
public:
	class UGbxTerritoryComponent*                 ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTerritory_GetTerritory;

// Function GbxAI.GpsBlueprintLibrary.MakeGpsQueryRunData
// 0x01E8 (0x01E8 - 0x0000)
struct GpsBlueprintLibrary_MakeGpsQueryRunData final
{
public:
	class UGpsQueryAsset*                         Query;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
