#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxAnimTexture

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GbxAnimTexture_structs.hpp"


namespace SDK
{

// Class GbxAnimTexture.GbxAnimTextureActor
// 0x0008 (0x0398 - 0x0390)
class AGbxAnimTextureActor final : public AActor
{
public:
	class UGbxAnimTextureComponent*               GbxAnimTextureComponent;                           // 0x0390(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxAnimTextureActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxAnimTextureActor")
	}
	static class AGbxAnimTextureActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxAnimTextureActor>();
	}
};
DUMPER7_ASSERTS_AGbxAnimTextureActor;

// Class GbxAnimTexture.GbxAnimTextureComponent
// 0x0030 (0x0B40 - 0x0B10)
class UGbxAnimTextureComponent : public UInstancedStaticMeshComponent
{
public:
	TArray<struct FGbxAnimTextureAnimInstance>    Animations;                                        // 0x0B10(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B20[0x8];                                      // 0x0B20(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxAnimTextureData*                    data;                                              // 0x0B28(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B30[0x10];                                     // 0x0B30(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxAnimTextureComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxAnimTextureComponent")
	}
	static class UGbxAnimTextureComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxAnimTextureComponent>();
	}
};
DUMPER7_ASSERTS_UGbxAnimTextureComponent;

// Class GbxAnimTexture.GbxAnimTextureEditorDataBase
// 0x0000 (0x0030 - 0x0030)
class UGbxAnimTextureEditorDataBase final : public UDataAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxAnimTextureEditorDataBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxAnimTextureEditorDataBase")
	}
	static class UGbxAnimTextureEditorDataBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxAnimTextureEditorDataBase>();
	}
};
DUMPER7_ASSERTS_UGbxAnimTextureEditorDataBase;

// Class GbxAnimTexture.GbxAnimTextureData
// 0x0020 (0x0050 - 0x0030)
class UGbxAnimTextureData : public UDataAsset
{
public:
	int32                                         NumFrames;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SampleRate;                                        // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGbxAnimTextureRef>             AnimRefs;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UStaticMesh*                            StaticMesh;                                        // 0x0048(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxAnimTextureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxAnimTextureData")
	}
	static class UGbxAnimTextureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxAnimTextureData>();
	}
};
DUMPER7_ASSERTS_UGbxAnimTextureData;

// Class GbxAnimTexture.GbxAnimTextureData_Basic
// 0x0000 (0x0050 - 0x0050)
class UGbxAnimTextureData_Basic final : public UGbxAnimTextureData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxAnimTextureData_Basic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxAnimTextureData_Basic")
	}
	static class UGbxAnimTextureData_Basic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxAnimTextureData_Basic>();
	}
};
DUMPER7_ASSERTS_UGbxAnimTextureData_Basic;

}

