#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxAI

#include "Basic.hpp"

#include "GbxNav_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "GbxPhysics_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxNexus_structs.hpp"
#include "GbxCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GbxAI.ECoverViewFailReason
// NumValues: 0x0006
enum class ECoverViewFailReason : uint8
{
	None                                     = 0,
	NoRoom                                   = 1,
	NoView                                   = 2,
	NoFireViews                              = 3,
	Invalid                                  = 4,
	ECoverViewFailReason_MAX                 = 5,
};

// Enum GbxAI.ECoverSlotHeight
// NumValues: 0x0003
enum class ECoverSlotHeight : uint8
{
	Low                                      = 0,
	High                                     = 1,
	ECoverSlotHeight_MAX                     = 2,
};

// Enum GbxAI.ECoverStyleAnimType
// NumValues: 0x0004
enum class ECoverStyleAnimType : uint8
{
	TimedMoveOut                             = 0,
	TimedStayIn                              = 1,
	SingleAnim                               = 2,
	ECoverStyleAnimType_MAX                  = 3,
};

// Enum GbxAI.EGbxAggroType
// NumValues: 0x0005
enum class EGbxAggroType : uint8
{
	Attack                                   = 0,
	Territory                                = 1,
	Group                                    = 2,
	NUM_AGGRO_TYPES                          = 3,
	EGbxAggroType_MAX                        = 4,
};

// Enum GbxAI.EGbxAggroValue
// NumValues: 0x0005
enum class EGbxAggroValue : uint8
{
	Has                                      = 0,
	Started                                  = 1,
	Ended                                    = 2,
	First                                    = 3,
	EGbxAggroValue_MAX                       = 4,
};

// Enum GbxAI.EGbxAITicketHoldType
// NumValues: 0x0004
enum class EGbxAITicketHoldType : uint8
{
	Hold                                     = 0,
	Force                                    = 1,
	Reserve                                  = 2,
	EGbxAITicketHoldType_MAX                 = 3,
};

// Enum GbxAI.EGbxAITicketInterruptCondition
// NumValues: 0x0003
enum class EGbxAITicketInterruptCondition : uint8
{
	None                                     = 0,
	Distance                                 = 1,
	EGbxAITicketInterruptCondition_MAX       = 2,
};

// Enum GbxAI.ECanSeeAspectTestMode
// NumValues: 0x0003
enum class ECanSeeAspectTestMode : uint8
{
	MustSeeToRun                             = 0,
	MustNotSeeToRun                          = 1,
	ECanSeeAspectTestMode_MAX                = 2,
};

// Enum GbxAI.EGbxCompareType
// NumValues: 0x0003
enum class EGbxCompareType : uint8
{
	Int                                      = 0,
	Float                                    = 1,
	EGbxCompareType_MAX                      = 2,
};

// Enum GbxAI.EGbxBrainAspectSettingsConditionContext
// NumValues: 0x0003
enum class EGbxBrainAspectSettingsConditionContext : uint32
{
	Self                                     = 0,
	Custom                                   = 1,
	EGbxBrainAspectSettingsConditionContext_MAX = 2,
};

// Enum GbxAI.EGbxBrainAspectSettingsGameplayTagQueryContext
// NumValues: 0x0003
enum class EGbxBrainAspectSettingsGameplayTagQueryContext : uint32
{
	Self                                     = 0,
	Custom                                   = 1,
	EGbxBrainAspectSettingsGameplayTagQueryContext_MAX = 2,
};

// Enum GbxAI.EGpsBrainStyle
// NumValues: 0x0005
enum class EGpsBrainStyle : uint8
{
	OncePerRun                               = 0,
	PeriodicallyWhileRunning                 = 1,
	PeriodicallyAlways                       = 2,
	PeriodicallyWhileNotRunning              = 3,
	EGpsBrainStyle_MAX                       = 4,
};

// Enum GbxAI.EIsInRangeAspectDistanceTest
// NumValues: 0x0006
enum class EIsInRangeAspectDistanceTest : uint8
{
	Direct                                   = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	VerticalOffset                           = 3,
	Count                                    = 4,
	EIsInRangeAspectDistanceTest_MAX         = 5,
};

// Enum GbxAI.EIsInRangeAspectCheckType
// NumValues: 0x0004
enum class EIsInRangeAspectCheckType : uint8
{
	Single                                   = 0,
	AllTargets                               = 1,
	Count                                    = 2,
	EIsInRangeAspectCheckType_MAX            = 3,
};

// Enum GbxAI.EGbxBrainTerritoryRestriction
// NumValues: 0x0004
enum class EGbxBrainTerritoryRestriction : uint8
{
	Default                                  = 0,
	Disabled                                 = 1,
	Enabled                                  = 2,
	EGbxBrainTerritoryRestriction_MAX        = 3,
};

// Enum GbxAI.EGbxBrainAspectIsOnTerrainContext
// NumValues: 0x0003
enum class EGbxBrainAspectIsOnTerrainContext : uint32
{
	Self                                     = 0,
	Custom                                   = 1,
	EGbxBrainAspectIsOnTerrainContext_MAX    = 2,
};

// Enum GbxAI.EAINavAspectType
// NumValues: 0x0005
enum class EAINavAspectType : uint32
{
	MoveToGoal                               = 0,
	Sequence                                 = 1,
	IsAtGoal                                 = 2,
	StayAtGoal                               = 3,
	EAINavAspectType_MAX                     = 4,
};

// Enum GbxAI.EGbxNavGoalCustomRotationContext
// NumValues: 0x0003
enum class EGbxNavGoalCustomRotationContext : uint8
{
	GoalActor                                = 0,
	Self                                     = 1,
	EGbxNavGoalCustomRotationContext_MAX     = 2,
};

// Enum GbxAI.EOrbitDirection
// NumValues: 0x0006
enum class EOrbitDirection : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Random                                   = 2,
	Goal                                     = 3,
	Movement                                 = 4,
	EOrbitDirection_MAX                      = 5,
};

// Enum GbxAI.EGbxBrainAspectSetParamContext
// NumValues: 0x0003
enum class EGbxBrainAspectSetParamContext : uint32
{
	Self                                     = 0,
	Custom                                   = 1,
	EGbxBrainAspectSetParamContext_MAX       = 2,
};

// Enum GbxAI.EGbxBrainAspectSetParamValueContext
// NumValues: 0x0004
enum class EGbxBrainAspectSetParamValueContext : uint32
{
	ParameterContext                         = 0,
	Self                                     = 1,
	Custom                                   = 2,
	EGbxBrainAspectSetParamValueContext_MAX  = 3,
};

// Enum GbxAI.EGbxBrainAspectSetParamOnStartBehavior
// NumValues: 0x0003
enum class EGbxBrainAspectSetParamOnStartBehavior : uint32
{
	DoNothing                                = 0,
	SetValue                                 = 1,
	EGbxBrainAspectSetParamOnStartBehavior_MAX = 2,
};

// Enum GbxAI.EGbxBrainAspectSetParamOnStopBehavior
// NumValues: 0x0004
enum class EGbxBrainAspectSetParamOnStopBehavior : uint32
{
	DoNothing                                = 0,
	RestoreValue                             = 1,
	SetValue                                 = 2,
	EGbxBrainAspectSetParamOnStopBehavior_MAX = 3,
};

// Enum GbxAI.EGbxBrainExec
// NumValues: 0x0004
enum class EGbxBrainExec : uint8
{
	Start                                    = 0,
	Succeeded                                = 1,
	Failed                                   = 2,
	EGbxBrainExec_MAX                        = 3,
};

// Enum GbxAI.EGbxBrainTaskDebugShapeMode
// NumValues: 0x0006
enum class EGbxBrainTaskDebugShapeMode : uint8
{
	Never                                    = 0,
	Selected                                 = 1,
	CannotStart                              = 2,
	Running                                  = 3,
	Always                                   = 4,
	MAX                                      = 5,
};

// Enum GbxAI.EGbxBrainTaskState
// NumValues: 0x0006
enum class EGbxBrainTaskState : uint8
{
	Idle                                     = 0,
	Starting                                 = 1,
	Running                                  = 2,
	Stopped                                  = 3,
	Count                                    = 4,
	EGbxBrainTaskState_MAX                   = 5,
};

// Enum GbxAI.EGbxBrainTaskExecutionStage
// NumValues: 0x0008
enum class EGbxBrainTaskExecutionStage : uint8
{
	Created                                  = 0,
	Starting                                 = 1,
	Running                                  = 2,
	Stopping                                 = 3,
	Stopped                                  = 4,
	CleaningUp                               = 5,
	Destroyed                                = 6,
	EGbxBrainTaskExecutionStage_MAX          = 7,
};

// Enum GbxAI.EGbxBrainTaskCanStartResult
// NumValues: 0x0005
enum class EGbxBrainTaskCanStartResult : uint8
{
	No                                       = 0,
	Unknown                                  = 1,
	Yes                                      = 2,
	Count                                    = 3,
	EGbxBrainTaskCanStartResult_MAX          = 4,
};

// Enum GbxAI.EGbxBrainTaskResult
// NumValues: 0x0007
enum class EGbxBrainTaskResult : uint8
{
	None                                     = 0,
	Succeeded                                = 1,
	Failed                                   = 2,
	Interrupted                              = 3,
	Aborted                                  = 4,
	Count                                    = 5,
	EGbxBrainTaskResult_MAX                  = 6,
};

// Enum GbxAI.EGbxBrainTaskResultDirective
// NumValues: 0x0004
enum class EGbxBrainTaskResultDirective : uint8
{
	Continue                                 = 0,
	Succeed                                  = 1,
	Fail                                     = 2,
	EGbxBrainTaskResultDirective_MAX         = 3,
};

// Enum GbxAI.EGbxBrainTaskResultTransition
// NumValues: 0x0005
enum class EGbxBrainTaskResultTransition : uint8
{
	Stop                                     = 0,
	Continue                                 = 1,
	Restart                                  = 2,
	Count                                    = 3,
	EGbxBrainTaskResultTransition_MAX        = 4,
};

// Enum GbxAI.EGbxBrainTaskCreationMethod
// NumValues: 0x0005
enum class EGbxBrainTaskCreationMethod : uint8
{
	Unknown                                  = 0,
	Composition                              = 1,
	PropertyPanel                            = 2,
	Graph                                    = 3,
	EGbxBrainTaskCreationMethod_MAX          = 4,
};

// Enum GbxAI.EGbxBrainTaskParallelMode
// NumValues: 0x0003
enum class EGbxBrainTaskParallelMode : uint32
{
	Simple                                   = 0,
	Custom                                   = 1,
	EGbxBrainTaskParallelMode_MAX            = 2,
};

// Enum GbxAI.EGbxBrainTaskSequenceCanStartCheck
// NumValues: 0x0003
enum class EGbxBrainTaskSequenceCanStartCheck : uint8
{
	FirstTask                                = 0,
	EachTask                                 = 1,
	EGbxBrainTaskSequenceCanStartCheck_MAX   = 2,
};

// Enum GbxAI.EChildActorState
// NumValues: 0x0006
enum class EChildActorState : uint8
{
	None                                     = 0,
	Spawned                                  = 1,
	SpawnedReplicated                        = 2,
	Dropped                                  = 3,
	Destroyed                                = 4,
	EChildActorState_MAX                     = 5,
};

// Enum GbxAI.EGbxAIHeldFilterType
// NumValues: 0x0004
enum class EGbxAIHeldFilterType : uint8
{
	Identifier                               = 0,
	Socket                                   = 1,
	Tag                                      = 2,
	EGbxAIHeldFilterType_MAX                 = 3,
};

// Enum GbxAI.EGbxSense
// NumValues: 0x0009
enum class EGbxSense : uint8
{
	Sight                                    = 0,
	Prox                                     = 1,
	Damage                                   = 2,
	Bullet                                   = 3,
	Territory                                = 4,
	Team                                     = 5,
	Prediction                               = 6,
	NUM_STIM_TYPES                           = 7,
	EGbxSense_MAX                            = 8,
};

// Enum GbxAI.EGbxTargetScoringBoost
// NumValues: 0x0008
enum class EGbxTargetScoringBoost : uint8
{
	ReduceExtreme                            = 0,
	ReduceModerate                           = 1,
	ReduceLight                              = 2,
	NoBoost                                  = 3,
	AmplifyLight                             = 4,
	AmplifyModerate                          = 5,
	AmplifyExtreme                           = 6,
	EGbxTargetScoringBoost_MAX               = 7,
};

// Enum GbxAI.EAimAssistSnapTargetType
// NumValues: 0x0005
enum class EAimAssistSnapTargetType : uint8
{
	Default                                  = 0,
	Disabled                                 = 1,
	Horizontal                               = 2,
	Center                                   = 3,
	EAimAssistSnapTargetType_MAX             = 4,
};

// Enum GbxAI.ETargetLocationOptionType
// NumValues: 0x0006
enum class ETargetLocationOptionType : uint8
{
	Actor                                    = 0,
	Target                                   = 1,
	Eye                                      = 2,
	Socket                                   = 3,
	MeleeSocket                              = 4,
	ETargetLocationOptionType_MAX            = 5,
};

// Enum GbxAI.EGbxTerritoryArea
// NumValues: 0x0004
enum class EGbxTerritoryArea : uint8
{
	Patrol                                   = 0,
	Combat                                   = 1,
	Threat                                   = 2,
	EGbxTerritoryArea_MAX                    = 3,
};

// Enum GbxAI.EGbxTerritoryDrawStyle
// NumValues: 0x0005
enum class EGbxTerritoryDrawStyle : uint8
{
	None                                     = 0,
	Wire                                     = 1,
	Solid                                    = 2,
	SolidAndWire                             = 3,
	EGbxTerritoryDrawStyle_MAX               = 4,
};

// Enum GbxAI.EGpsContextTerritoryValue
// NumValues: 0x0005
enum class EGpsContextTerritoryValue : uint8
{
	Origin                                   = 0,
	Radius                                   = 1,
	HalfHeight                               = 2,
	Territory                                = 3,
	MAX                                      = 4,
};

// Enum GbxAI.EGpsExec
// NumValues: 0x0003
enum class EGpsExec : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	EGpsExec_MAX                             = 2,
};

// Enum GbxAI.EGpsTimerMode
// NumValues: 0x0004
enum class EGpsTimerMode : uint32
{
	TimeSinceCreated                         = 0,
	TimeSinceNewResult                       = 1,
	TimeSinceArrivedAtResult                 = 2,
	EGpsTimerMode_MAX                        = 3,
};

// Enum GbxAI.EGpsDirectionType
// NumValues: 0x0003
enum class EGpsDirectionType : uint32
{
	Rotation                                 = 0,
	Towards                                  = 1,
	EGpsDirectionType_MAX                    = 2,
};

// Enum GbxAI.EGpsActiveGeneratorAllowedNavType
// NumValues: 0x0004
enum class EGpsActiveGeneratorAllowedNavType : uint8
{
	None                                     = 0,
	Walking                                  = 1,
	Flying                                   = 2,
	EGpsActiveGeneratorAllowedNavType_MAX    = 3,
};

// Enum GbxAI.EGbxTerritoryMovementType
// NumValues: 0x0004
enum class EGbxTerritoryMovementType : uint8
{
	Ground                                   = 0,
	Flight                                   = 1,
	Dynamic                                  = 2,
	EGbxTerritoryMovementType_MAX            = 3,
};

// Enum GbxAI.EGpsTraceGeneratedResult
// NumValues: 0x0005
enum class EGpsTraceGeneratedResult : uint32
{
	FurthestLocation                         = 0,
	HitLocation                              = 1,
	HitActor                                 = 2,
	EndLocation                              = 3,
	MAX                                      = 4,
};

// Enum GbxAI.EGpsTraceDirectionType
// NumValues: 0x0003
enum class EGpsTraceDirectionType : uint32
{
	Direction                                = 0,
	EndPoint                                 = 1,
	MAX                                      = 2,
};

// Enum GbxAI.EGpsModifierType
// NumValues: 0x0005
enum class EGpsModifierType : uint8
{
	Modify                                   = 0,
	Score                                    = 1,
	ModifyAndScore                           = 2,
	FilterAndScore                           = 3,
	MAX                                      = 4,
};

// Enum GbxAI.EGpsModifierNoiseOffsetMode
// NumValues: 0x0004
enum class EGpsModifierNoiseOffsetMode : uint32
{
	Noise2D                                  = 0,
	Noise3D                                  = 1,
	NoiseZ                                   = 2,
	EGpsModifierNoiseOffsetMode_MAX          = 3,
};

// Enum GbxAI.EGpsProjectType
// NumValues: 0x0005
enum class EGpsProjectType : uint8
{
	None                                     = 0,
	Geometry                                 = 1,
	NavMesh                                  = 2,
	FlightNav                                = 3,
	EGpsProjectType_MAX                      = 4,
};

// Enum GbxAI.EGpsExecuteResult
// NumValues: 0x0003
enum class EGpsExecuteResult : uint8
{
	Suspended                                = 0,
	Finished                                 = 1,
	EGpsExecuteResult_MAX                    = 2,
};

// Enum GbxAI.EGpsResultsNodeState
// NumValues: 0x0005
enum class EGpsResultsNodeState : uint8
{
	Idle                                     = 0,
	GeneratingResults                        = 1,
	ScoringResults                           = 2,
	Finished                                 = 3,
	EGpsResultsNodeState_MAX                 = 4,
};

// Enum GbxAI.EGpsExecType
// NumValues: 0x0003
enum class EGpsExecType : uint8
{
	Once                                     = 0,
	Periodic                                 = 1,
	EGpsExecType_MAX                         = 2,
};

// Enum GbxAI.EGpsChoice
// NumValues: 0x0005
enum class EGpsChoice : uint8
{
	Index                                    = 0,
	IndexWrap                                = 1,
	RandomFixed                              = 2,
	RandomPercent                            = 3,
	EGpsChoice_MAX                           = 4,
};

// Enum GbxAI.EGpsQueryExecutionState
// NumValues: 0x0004
enum class EGpsQueryExecutionState : uint8
{
	Idle                                     = 0,
	Running                                  = 1,
	Finished                                 = 2,
	EGpsQueryExecutionState_MAX              = 3,
};

// Enum GbxAI.EGpsFilterType
// NumValues: 0x0005
enum class EGpsFilterType : uint8
{
	Score                                    = 0,
	Filter                                   = 1,
	ScoreAndFilter                           = 2,
	BinaryScore                              = 3,
	EGpsFilterType_MAX                       = 4,
};

// Enum GbxAI.EGpsAngleMode
// NumValues: 0x0004
enum class EGpsAngleMode : uint32
{
	Angle2D                                  = 0,
	Angle3D                                  = 1,
	Pitch                                    = 2,
	EGpsAngleMode_MAX                        = 3,
};

// Enum GbxAI.EGpsAttackersScore
// NumValues: 0x0003
enum class EGpsAttackersScore : uint32
{
	PreferMin                                = 0,
	PreferMax                                = 1,
	EGpsAttackersScore_MAX                   = 2,
};

// Enum GbxAI.EGpsDistanceScore
// NumValues: 0x0005
enum class EGpsDistanceScore : uint32
{
	PreferNear                               = 0,
	PreferFar                                = 1,
	PreferMid                                = 2,
	PreferCustom                             = 3,
	EGpsDistanceScore_MAX                    = 4,
};

// Enum GbxAI.EGpsDistanceMode
// NumValues: 0x0005
enum class EGpsDistanceMode : uint32
{
	Distance2D                               = 0,
	Distance3D                               = 1,
	DistanceZ                                = 2,
	DistanceZAbs                             = 3,
	EGpsDistanceMode_MAX                     = 4,
};

// Enum GbxAI.EGpsDistanceListScore
// NumValues: 0x0003
enum class EGpsDistanceListScore : uint32
{
	PreferFar                                = 0,
	PreferNear                               = 1,
	EGpsDistanceListScore_MAX                = 2,
};

// Enum GbxAI.EGbxEffectAreaAffectType
// NumValues: 0x0004
enum class EGbxEffectAreaAffectType : uint8
{
	AffectsAllies                            = 0,
	AffectsEnemies                           = 1,
	AffectsAlliesAndEnemies                  = 2,
	EGbxEffectAreaAffectType_MAX             = 3,
};

// Enum GbxAI.EGpsEffectAreaScoringMode
// NumValues: 0x0004
enum class EGpsEffectAreaScoringMode : uint8
{
	IncreaseScoreInAllyAreas                 = 0,
	DecreaseScoreInHostileAreas              = 1,
	ModifyScoreInAllyAndHostileAreas         = 2,
	EGpsEffectAreaScoringMode_MAX            = 3,
};

// Enum GbxAI.EGpsTest_MatchingTarget
// NumValues: 0x0003
enum class EGpsTest_MatchingTarget : uint32
{
	PreferMatching                           = 0,
	PreferNotMatching                        = 1,
	EGpsTest_MAX                             = 2,
};

// Enum GbxAI.EGpsNavDistancePreference
// NumValues: 0x0004
enum class EGpsNavDistancePreference : uint32
{
	PreferNear                               = 0,
	PreferFar                                = 1,
	PreferMid                                = 2,
	EGpsNavDistancePreference_MAX            = 3,
};

// Enum GbxAI.EGpsSensedDistanceScore
// NumValues: 0x0005
enum class EGpsSensedDistanceScore : uint32
{
	PreferNear                               = 0,
	PreferFar                                = 1,
	PreferMid                                = 2,
	PreferCustom                             = 3,
	EGpsSensedDistanceScore_MAX              = 4,
};

// Enum GbxAI.EGpsTraceListFilter
// NumValues: 0x0005
enum class EGpsTraceListFilter : uint8
{
	None                                     = 0,
	AtLeastOne                               = 1,
	All                                      = 2,
	CustomPercent                            = 3,
	EGpsTraceListFilter_MAX                  = 4,
};

// Enum GbxAI.EGpsTraceListScore
// NumValues: 0x0003
enum class EGpsTraceListScore : uint8
{
	Trace                                    = 0,
	NumPassed                                = 1,
	EGpsTraceListScore_MAX                   = 2,
};

// Enum GbxAI.EGpsTraceTestType
// NumValues: 0x0003
enum class EGpsTraceTestType : uint8
{
	PreferMiss                               = 0,
	PreferHit                                = 1,
	EGpsTraceTestType_MAX                    = 2,
};

// Enum GbxAI.EGpsShape
// NumValues: 0x0005
enum class EGpsShape : uint8
{
	Line                                     = 0,
	Box                                      = 1,
	Sphere                                   = 2,
	Capsule                                  = 3,
	EGpsShape_MAX                            = 4,
};

// ScriptStruct GbxAI.GbxBrainTaskBaseSettings
// 0x0040 (0x0078 - 0x0038)
struct FGbxBrainTaskBaseSettings : public FGbxGraphNodeSettings
{
public:
	struct FGbxParam                              IsEnabledParam;                                    // 0x0038(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bInvertIsEnabledParam;                             // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxBrainTaskResultTransition                 SuccessTransition;                                 // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxBrainTaskResultTransition                 FailureTransition;                                 // 0x0072(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlwaysReportSuccess;                              // 0x0073(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CanStartPeriod;                                    // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxBrainTaskBaseSettings;

// ScriptStruct GbxAI.GbxBrainAspectSettings
// 0x0008 (0x0080 - 0x0078)
struct FGbxBrainAspectSettings : public FGbxBrainTaskBaseSettings
{
public:
	bool                                          bCanPreventTaskFromStarting;                       // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanCauseTaskToSucceed;                            // 0x0079(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanForceTaskToSucceed;                            // 0x007A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanCauseTaskToFail;                               // 0x007B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMustFinish;                                       // 0x007C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainAspectSettings;

// ScriptStruct GbxAI.GbxBrainAspectSettings_MaxRuns
// 0x0040 (0x00C0 - 0x0080)
struct FGbxBrainAspectSettings_MaxRuns final : public FGbxBrainAspectSettings
{
public:
	struct FGbxParam                              MaxRuns;                                           // 0x0080(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bOnlyCountCertainResults;                          // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCountSuccess;                                     // 0x00B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCountFailure;                                     // 0x00BA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCountInterruption;                                // 0x00BB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCountAborted;                                     // 0x00BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainAspectSettings_MaxRuns;

// ScriptStruct GbxAI.GbxTargetableState
// 0x01C8 (0x01C8 - 0x0000)
struct alignas(0x08) FGbxTargetableState final
{
public:
	uint8                                         Pad_0[0x1C8];                                      // 0x0000(0x01C8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxTargetableState;

// ScriptStruct GbxAI.GpsNodeState
// 0x0000 (0x0050 - 0x0050)
struct FGpsNodeState : public FGbxGraphNodeState
{
};
DUMPER7_ASSERTS_FGpsNodeState;

// ScriptStruct GbxAI.GpsResultsNode
// 0x03C8 (0x0418 - 0x0050)
struct FGpsResultsNode : public FGpsNodeState
{
public:
	uint8                                         Pad_50[0x3C8];                                     // 0x0050(0x03C8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsResultsNode;

// ScriptStruct GbxAI.GbxBrainTaskBase
// 0x0088 (0x00D8 - 0x0050)
struct FGbxBrainTaskBase : public FGbxGraphNodeState
{
public:
	uint8                                         Pad_50[0x88];                                      // 0x0050(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainTaskBase;

// ScriptStruct GbxAI.GbxBrainAspect
// 0x0000 (0x00D8 - 0x00D8)
struct FGbxBrainAspect : public FGbxBrainTaskBase
{
};
DUMPER7_ASSERTS_FGbxBrainAspect;

// ScriptStruct GbxAI.GbxBrainAspect_CountAllies
// 0x0000 (0x00D8 - 0x00D8)
struct FGbxBrainAspect_CountAllies final : public FGbxBrainAspect
{
};
DUMPER7_ASSERTS_FGbxBrainAspect_CountAllies;

// ScriptStruct GbxAI.GpsNodeSettings
// 0x0000 (0x0038 - 0x0038)
struct FGpsNodeSettings : public FGbxGraphNodeSettings
{
};
DUMPER7_ASSERTS_FGpsNodeSettings;

// ScriptStruct GbxAI.GpsScoringNodeSettings
// 0x0020 (0x0058 - 0x0038)
struct FGpsScoringNodeSettings : public FGpsNodeSettings
{
public:
	struct FGbxBinding_Bool                       bEnabled;                                          // 0x0038(0x0020)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGpsScoringNodeSettings;

// ScriptStruct GbxAI.GpsTestSettings
// 0x0028 (0x0080 - 0x0058)
struct FGpsTestSettings : public FGpsScoringNodeSettings
{
public:
	struct FGbxBinding_Float                      Weight;                                            // 0x0058(0x0020)(Edit, NativeAccessSpecifierPublic)
	EGpsFilterType                                FilterType;                                        // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsTestSettings;

// ScriptStruct GbxAI.GpsTestSettings_Targeters
// 0x0060 (0x00E0 - 0x0080)
struct FGpsTestSettings_Targeters final : public FGpsTestSettings
{
public:
	struct FGbxBinding_Float                      MinTargeters;                                      // 0x0080(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGbxBinding_Float                      MaxTargeters;                                      // 0x00A0(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGbxBinding_Bool                       bPreferMoreTargeters;                              // 0x00C0(0x0020)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGpsTestSettings_Targeters;

// ScriptStruct GbxAI.GbxTeamIdHandle
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FGbxTeamIdHandle final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxTeamIdHandle;

// ScriptStruct GbxAI.GpsDirectionSettings
// 0x0160 (0x0160 - 0x0000)
struct FGpsDirectionSettings final
{
public:
	EGpsDirectionType                             DirectionType;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxBinding_Rotator                    Rotation;                                          // 0x0008(0x0060)(Edit, NativeAccessSpecifierPrivate)
	struct FGbxBinding_Vector                     Towards;                                           // 0x0068(0x0098)(Edit, NativeAccessSpecifierPrivate)
	struct FGbxBinding_Rotator                    TowardsRotationOffset;                             // 0x0100(0x0060)(Edit, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGpsDirectionSettings;

// ScriptStruct GbxAI.GpsTestSettings_Angle
// 0x0240 (0x02C0 - 0x0080)
struct FGpsTestSettings_Angle final : public FGpsTestSettings
{
public:
	struct FGbxBinding_Float                      MinAngle;                                          // 0x0080(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGbxBinding_Float                      MaxAngle;                                          // 0x00A0(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGbxBinding_Vector                     Origin;                                            // 0x00C0(0x0098)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGpsDirectionSettings                  Direction;                                         // 0x0158(0x0160)(Edit, Protected, NativeAccessSpecifierProtected)
	EGpsAngleMode                                 Mode;                                              // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsTestSettings_Angle;

// ScriptStruct GbxAI.GbxBrainTask
// 0x0058 (0x0130 - 0x00D8)
struct FGbxBrainTask : public FGbxBrainTaskBase
{
public:
	uint8                                         Pad_D8[0x58];                                      // 0x00D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainTask;

// ScriptStruct GbxAI.GbxBrainTask_FlowControl
// 0x0090 (0x01C0 - 0x0130)
struct FGbxBrainTask_FlowControl : public FGbxBrainTask
{
public:
	uint8                                         Pad_130[0x90];                                     // 0x0130(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainTask_FlowControl;

// ScriptStruct GbxAI.GbxBrainTask_Selector
// 0x0008 (0x01C8 - 0x01C0)
struct FGbxBrainTask_Selector : public FGbxBrainTask_FlowControl
{
public:
	uint8                                         Pad_1C0[0x8];                                      // 0x01C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainTask_Selector;

// ScriptStruct GbxAI.TargetLocationSettings
// 0x0050 (0x0050 - 0x0000)
struct FTargetLocationSettings final
{
public:
	struct FGbxParam                              Enabled;                                           // 0x0000(0x0038)(Edit, NativeAccessSpecifierPublic)
	class FName                                   socket;                                            // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoundsRadius;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoundsHalfHeight;                                  // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBoundsHalfHeight;                              // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAsDefaultLocation;                             // 0x0049(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAsDefaultBounds;                               // 0x004A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTargetLocationSettings;

// ScriptStruct GbxAI.GbxBrainDef
// 0x0080 (0x0088 - 0x0008)
struct FGbxBrainDef : public FGbxHasStructType
{
public:
	bool                                          bRestrictedToCombatTerritory;                      // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGbxBrainTaskData>       MainTask;                                          // 0x0010(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, TSoftObjectPtr<class UGbxBrainTaskData>> TaggedTasks;                  // 0x0038(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxBrainDef;

// ScriptStruct GbxAI.GpsQueryRunData
// 0x01E0 (0x01E0 - 0x0000)
struct FGpsQueryRunData final
{
public:
	class UGpsQueryAsset*                         Query;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxBindingList                        Bindings;                                          // 0x0008(0x01D0)(Edit, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x01D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGpsQueryRunData;

// ScriptStruct GbxAI.GbxTargeterState
// 0x0318 (0x0318 - 0x0000)
struct FGbxTargeterState final
{
public:
	uint8                                         Pad_0[0xC8];                                       // 0x0000(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGpsQueryRunData                       Gps;                                               // 0x00C8(0x01E0)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A8[0x70];                                     // 0x02A8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxTargeterState;

// ScriptStruct GbxAI.GpsCondition
// 0x0008 (0x0058 - 0x0050)
struct FGpsCondition : public FGpsNodeState
{
public:
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsCondition;

// ScriptStruct GbxAI.GpsCondition_IsFirstRun
// 0x0000 (0x0058 - 0x0058)
struct FGpsCondition_IsFirstRun final : public FGpsCondition
{
};
DUMPER7_ASSERTS_FGpsCondition_IsFirstRun;

// ScriptStruct GbxAI.GbxBrainAspectSettings_ClaimCover
// 0x0038 (0x00B8 - 0x0080)
struct FGbxBrainAspectSettings_ClaimCover final : public FGbxBrainAspectSettings
{
public:
	struct FGbxParam                              Cover;                                             // 0x0080(0x0038)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxBrainAspectSettings_ClaimCover;

// ScriptStruct GbxAI.GbxTeamState
// 0x0060 (0x0060 - 0x0000)
struct FGbxTeamState final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                owner;                                             // 0x0018(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x40];                                      // 0x0020(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxTeamState;

// ScriptStruct GbxAI.CoverUseParams
// 0x0110 (0x0110 - 0x0000)
struct FCoverUseParams final
{
public:
	bool                                          bMustHaveViewToTarget;                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMustBeHiddenFromThreats;                          // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              bOverrideIdleTime;                                 // 0x0008(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              IdleTimeOverride;                                  // 0x0040(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              bOverrideFireTime;                                 // 0x0078(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              FireTimeOverride;                                  // 0x00B0(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  DisallowedStyleActionTags;                         // 0x00E8(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          bWantsCombat;                                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCoverUseParams;

// ScriptStruct GbxAI.CoverAction
// 0x0128 (0x0128 - 0x0000)
struct FCoverAction final
{
public:
	class UCoverSlotComponent*                    slot;                                              // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCoverStyleData*                        Style;                                             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 target;                                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCoverUseParams                        params;                                            // 0x0018(0x0110)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCoverAction;

// ScriptStruct GbxAI.CoverReplicatedData
// 0x0138 (0x0138 - 0x0000)
struct FCoverReplicatedData final
{
public:
	int32                                         RandomSeed;                                        // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCoverAction                           Action;                                            // 0x0008(0x0128)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         position;                                          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCoverReplicatedData;

// ScriptStruct GbxAI.CoverUserState
// 0x04D8 (0x04D8 - 0x0000)
struct FCoverUserState final
{
public:
	uint8                                         Pad_0[0x110];                                      // 0x0000(0x0110)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICoverUser>            User;                                              // 0x0110(0x0010)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGbxAICharacter*                        GbxAICharacter;                                    // 0x0120(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCoverUserData*                         CoverUserData;                                     // 0x0128(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnimInstance*                          AnimInstance;                                      // 0x0130(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGbxNavCharacterMovementComponent*      MovementComponent;                                 // 0x0138(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCoverAction                           DesiredAction;                                     // 0x0140(0x0128)(Transient, RepSkip, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FCoverAction                           CurrentAction;                                     // 0x0268(0x0128)(Transient, RepSkip, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UAnimSequence*                          CurrentAnim;                                       // 0x0390(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FCoverReplicatedData                   ReplicatedData;                                    // 0x0398(0x0138)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FRandomStream                          RandomStream;                                      // 0x04D0(0x0008)(ZeroConstructor, Transient, RepSkip, NoDestructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCoverUserState;

// ScriptStruct GbxAI.GbxTerritoryAreaData
// 0x0120 (0x0120 - 0x0000)
struct FGbxTerritoryAreaData final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AVolume*>                        Volumes;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        ShapeObjects;                                      // 0x0018(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class AVolume*>                        ExclusionVolumes;                                  // 0x0028(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0xE0];                                      // 0x0038(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEverywhere;                                       // 0x0118(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHeight;                                        // 0x0119(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxTerritoryAreaData;

// ScriptStruct GbxAI.GpsCondition_Timer
// 0x0050 (0x00A8 - 0x0058)
struct FGpsCondition_Timer final : public FGpsCondition
{
public:
	uint8                                         Pad_58[0x50];                                      // 0x0058(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsCondition_Timer;

// ScriptStruct GbxAI.GbxBrainAspect_StopMoving
// 0x0000 (0x00D8 - 0x00D8)
struct FGbxBrainAspect_StopMoving final : public FGbxBrainAspect
{
};
DUMPER7_ASSERTS_FGbxBrainAspect_StopMoving;

// ScriptStruct GbxAI.GbxTeamDef
// 0x0078 (0x0090 - 0x0018)
struct FGbxTeamDef final : public FGbxDef
{
public:
	struct FGbxInlineStruct                       AttitudeResolver;                                  // 0x0018(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	ETeamAttitude                                 SelfAttitude;                                      // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ETeamAttitude                                 DefaultAttitude;                                   // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ETeamAttitude                                 DefaultAttitudeFromOthers;                         // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseDefaultAttitudeFromOthers;                     // 0x0033(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<FGameDataHandleProperty_, ETeamAttitude> Attitudes;                                         // 0x0038(0x0050)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bTeamCollisionChannelSet;                          // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EExtraCollisionFilterChannel                  TeamCollisionChannel;                              // 0x0089(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxTeamDef;

// ScriptStruct GbxAI.GbxAITicketUseData
// 0x00B8 (0x00B8 - 0x0000)
struct FGbxAITicketUseData final
{
public:
	class UGbxAITicketData*                       Ticket;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxParam                              Value;                                             // 0x0008(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              HoldDuration;                                      // 0x0040(0x0038)(Edit, NativeAccessSpecifierPublic)
	EGbxAITicketHoldType                          HoldType;                                          // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAITicketInterruptCondition                ReserveInterruptCondition;                         // 0x0079(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideTicketTarget;                             // 0x007A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              TicketTargetOverride;                              // 0x0080(0x0038)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxAITicketUseData;

// ScriptStruct GbxAI.GbxBrainAspectSettings_Ticket
// 0x00F8 (0x0178 - 0x0080)
struct FGbxBrainAspectSettings_Ticket final : public FGbxBrainAspectSettings
{
public:
	struct FGbxAITicketUseData                    UserData;                                          // 0x0080(0x00B8)(Edit, NativeAccessSpecifierPublic)
	bool                                          bInvalidateUnavailableOverrideTaget;               // 0x0138(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              UnavailableTargetsToInvalidate;                    // 0x0140(0x0038)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxBrainAspectSettings_Ticket;

// ScriptStruct GbxAI.GbxAttitudeResolver
// 0x0000 (0x0008 - 0x0008)
struct FGbxAttitudeResolver final : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FGbxAttitudeResolver;

// ScriptStruct GbxAI.GpsCondition_Ticket
// 0x00C0 (0x0118 - 0x0058)
struct FGpsCondition_Ticket final : public FGpsCondition
{
public:
	uint8                                         Pad_58[0xC0];                                      // 0x0058(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsCondition_Ticket;

// ScriptStruct GbxAI.GbxBrainAspectSettings_CanSee
// 0x0078 (0x00F8 - 0x0080)
struct FGbxBrainAspectSettings_CanSee final : public FGbxBrainAspectSettings
{
public:
	struct FGbxParam                              target;                                            // 0x0080(0x0038)(Edit, NativeAccessSpecifierPublic)
	ECanSeeAspectTestMode                         Mode;                                              // 0x00B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              Threshold;                                         // 0x00C0(0x0038)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxBrainAspectSettings_CanSee;

// ScriptStruct GbxAI.GpsTestSettings_PlayerDamaging
// 0x0020 (0x00A0 - 0x0080)
struct FGpsTestSettings_PlayerDamaging final : public FGpsTestSettings
{
public:
	struct FGbxBinding_Float                      TimeSinceDamagedMax;                               // 0x0080(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FGpsTestSettings_PlayerDamaging;

// ScriptStruct GbxAI.GbxAggroState
// 0x0108 (0x0108 - 0x0000)
struct alignas(0x08) FGbxAggroState final
{
public:
	uint8                                         Pad_0[0x108];                                      // 0x0000(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAggroState;

// ScriptStruct GbxAI.GbxPerceiverState
// 0x0128 (0x0128 - 0x0000)
struct alignas(0x08) FGbxPerceiverState final
{
public:
	uint8                                         Pad_0[0x128];                                      // 0x0000(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxPerceiverState;

// ScriptStruct GbxAI.GbxAggroValueResolver
// 0x0008 (0x0010 - 0x0008)
struct FGbxAggroValueResolver final : public FAttributeValueResolver
{
public:
	EGbxAggroValue                                Value;                                             // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAggroValueResolver;

// ScriptStruct GbxAI.GbxBrainAspectSettings_HasNavLoS
// 0x00B8 (0x0138 - 0x0080)
struct FGbxBrainAspectSettings_HasNavLoS final : public FGbxBrainAspectSettings
{
public:
	struct FGbxParam                              target;                                            // 0x0080(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              Distance;                                          // 0x00B8(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bIncludeTargetRadius;                              // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              Height;                                            // 0x00F8(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bIncludeTargetHalfHeight;                          // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFailIfNavLineOfSightLost;                         // 0x0131(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0132(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainAspectSettings_HasNavLoS;

// ScriptStruct GbxAI.GpsGenerator
// 0x0000 (0x0418 - 0x0418)
struct FGpsGenerator : public FGpsResultsNode
{
};
DUMPER7_ASSERTS_FGpsGenerator;

// ScriptStruct GbxAI.GpsGenerator_Cover
// 0x0010 (0x0428 - 0x0418)
struct FGpsGenerator_Cover final : public FGpsGenerator
{
public:
	uint8                                         Pad_418[0x10];                                     // 0x0418(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsGenerator_Cover;

// ScriptStruct GbxAI.GbxBrainAspect_InLineOfFire
// 0x0010 (0x00E8 - 0x00D8)
struct FGbxBrainAspect_InLineOfFire final : public FGbxBrainAspect
{
public:
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainAspect_InLineOfFire;

// ScriptStruct GbxAI.CoverTransitionData
// 0x0020 (0x0020 - 0x0000)
struct FCoverTransitionData final
{
public:
