#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxBlockout

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "GbxBlockout_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GbxBlockout.GbxBlockoutComponent
// 0x0030 (0x0750 - 0x0720)
class UGbxBlockoutComponent final : public UStaticMeshComponent
{
public:
	EBlockoutShape                                Shape;                                             // 0x0718(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_719[0x3];                                      // 0x0719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TextureSize;                                       // 0x071C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FLinearColor                           BaseColorOverlay;                                  // 0x0720(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                TextureOffset;                                     // 0x0730(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RelativeOffset;                                    // 0x0748(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         GridOpacity;                                       // 0x074C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxBlockoutComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxBlockoutComponent")
	}
	static class UGbxBlockoutComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxBlockoutComponent>();
	}
};
DUMPER7_ASSERTS_UGbxBlockoutComponent;

// Class GbxBlockout.GbxBlockoutComponentMaterialInterface
// 0x0000 (0x0000 - 0x0000)
class IGbxBlockoutComponentMaterialInterface final
{
public:
	void SetMaterialParameters(class UStaticMeshComponent* StaticMeshComponent, float TextureSize, const struct FLinearColor& BaseColorOverlay, const struct FVector& TextureOffset, float RelativeOffset, float GridOpacity);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxBlockoutComponentMaterialInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxBlockoutComponentMaterialInterface")
	}
	static class IGbxBlockoutComponentMaterialInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxBlockoutComponentMaterialInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxBlockoutComponentMaterialInterface;

// Class GbxBlockout.GbxBlockoutSettings
// 0x0160 (0x0198 - 0x0038)
class UGbxBlockoutSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UStaticMesh>             BlockoutShapeMeshes[0x8];                          // 0x0038(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         BlockoutComponentMaterialInterfaceClass;           // 0x0178(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxBlockoutSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxBlockoutSettings")
	}
	static class UGbxBlockoutSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxBlockoutSettings>();
	}
};
DUMPER7_ASSERTS_UGbxBlockoutSettings;

}

