#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxBlockingVolumes

#include "Basic.hpp"

#include "DeveloperSettings_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GbxBlockingVolumes.BlockingVolumesProjectSettings
// 0x0028 (0x0060 - 0x0038)
class UBlockingVolumesProjectSettings final : public UDeveloperSettings
{
public:
	TSoftObjectPtr<class UMaterial>               PathToBlockingMaterial;                            // 0x0038(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlockingVolumesProjectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlockingVolumesProjectSettings")
	}
	static class UBlockingVolumesProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlockingVolumesProjectSettings>();
	}
};
DUMPER7_ASSERTS_UBlockingVolumesProjectSettings;

// Class GbxBlockingVolumes.BlockingVolumesUserSettings
// 0x0008 (0x0040 - 0x0038)
class UBlockingVolumesUserSettings final : public UDeveloperSettings
{
public:
	float                                         BlockingVolumeOpacity;                             // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvertColors;                                     // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BlockingVolumesUserSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BlockingVolumesUserSettings")
	}
	static class UBlockingVolumesUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlockingVolumesUserSettings>();
	}
};
DUMPER7_ASSERTS_UBlockingVolumesUserSettings;

// Class GbxBlockingVolumes.GbxBlockingVolumeSettings
// 0x0050 (0x0078 - 0x0028)
class UGbxBlockingVolumeSettings final : public UObject
{
public:
	TMap<class FString, class FString>            ChannelsToBlockByProperty;                         // 0x0028(0x0050)(Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxBlockingVolumeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxBlockingVolumeSettings")
	}
	static class UGbxBlockingVolumeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxBlockingVolumeSettings>();
	}
};
DUMPER7_ASSERTS_UGbxBlockingVolumeSettings;

// Class GbxBlockingVolumes.GbxBlockingVolume
// 0x0018 (0x03E0 - 0x03C8)
class AGbxBlockingVolume final : public AVolume
{
public:
	bool                                          bRender;                                           // 0x03C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockGrenades;                                    // 0x03C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockWeaponFire;                                  // 0x03CA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockUsingThings;                                 // 0x03CB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockBoosterPickups;                              // 0x03CC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockVehicles;                                    // 0x03CD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockPawns;                                       // 0x03CE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWalkable;                                         // 0x03CF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<FGbxDefPtrProperty_>                   TeamsToBlock;                                      // 0x03D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxBlockingVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxBlockingVolume")
	}
	static class AGbxBlockingVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxBlockingVolume>();
	}
};
DUMPER7_ASSERTS_AGbxBlockingVolume;

}

