#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxCloudscape

#include "Basic.hpp"

#include "GbxCloudscape_structs.hpp"
#include "Engine_classes.hpp"
#include "Niagara_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GbxCloudscape.GbxCloudscapeActor
// 0x0020 (0x03B0 - 0x0390)
class AGbxCloudscapeActor final : public AActor
{
public:
	uint8                                         Pad_390[0x8];                                      // 0x0390(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UVolumetricCloudComponent*              VolumetricCloudComponent;                          // 0x0398(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxNiagaraCloudscapeComponent*         NiagaraCloudscapeComponent;                        // 0x03A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A8[0x8];                                      // 0x03A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void TransitionToCloudscape(float TransitionTime, class UGbxCloudscapeData* TransitionCloudscapeData);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxCloudscapeActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxCloudscapeActor")
	}
	static class AGbxCloudscapeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxCloudscapeActor>();
	}
};
DUMPER7_ASSERTS_AGbxCloudscapeActor;

// Class GbxCloudscape.GbxCloudscapeData
// 0x0040 (0x0070 - 0x0030)
class UGbxCloudscapeData final : public UDataAsset
{
public:
	TArray<struct FGbxNiagaraCloudscapeLayer>     NiagaraCloudscapeLayers;                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     VolumetricMaterial;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CloudscapeBounds;                                  // 0x0050(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxCloudscapeData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxCloudscapeData")
	}
	static class UGbxCloudscapeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxCloudscapeData>();
	}
};
DUMPER7_ASSERTS_UGbxCloudscapeData;

// Class GbxCloudscape.GbxNiagaraCloudscapeComponent
// 0x0020 (0x0900 - 0x08E0)
class UGbxNiagaraCloudscapeComponent final : public UNiagaraComponent
{
public:
	class UMaterialParameterCollection*           CloudscapeMaterialParameterCollection;             // 0x08D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CloudscapeBoundsMaterialParameterName;             // 0x08E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProcLayer;                                  // 0x08E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E9[0x7];                                      // 0x08E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxCloudscapeData*                     CloudscapeData;                                    // 0x08F0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8F8[0x8];                                      // 0x08F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraCloudscapeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraCloudscapeComponent")
	}
	static class UGbxNiagaraCloudscapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraCloudscapeComponent>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraCloudscapeComponent;

// Class GbxCloudscape.GbxCloudscapePreviewActor
// 0x0000 (0x0000 - 0x0000)
class IGbxCloudscapePreviewActor final
{
public:
	void EndPreview();
	void SetNextPreviewCloudscape(class UGbxCloudscapeData* InPreviewCloudscape);
	void SetPreviewCloudscape(class UGbxCloudscapeData* InPreviewCloudscape);
	void UpdatePreview(float TransitionWeight);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxCloudscapePreviewActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxCloudscapePreviewActor")
	}
	static class IGbxCloudscapePreviewActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxCloudscapePreviewActor>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxCloudscapePreviewActor;

}

