#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GbxCore.EGbxViewFlag
// NumValues: 0x0020
enum class EGbxViewFlag : uint8
{
	FirstPerson                              = 0,
	ThirdPerson                              = 1,
	HideViewTarget                           = 2,
	ViewportOwner                            = 3,
	EngineFlag2                              = 4,
	EngineFlag3                              = 5,
	EngineFlag4                              = 6,
	EngineFlag5                              = 7,
	EngineFlag6                              = 8,
	GameFlag1                                = 9,
	GameFlag2                                = 10,
	GameFlag3                                = 11,
	GameFlag4                                = 12,
	GameFlag5                                = 13,
	GameFlag6                                = 14,
	GameFlag7                                = 15,
	GameFlag8                                = 16,
	GameFlag9                                = 17,
	GameFlag10                               = 18,
	GameFlag11                               = 19,
	GameFlag12                               = 20,
	GameFlag13                               = 21,
	GameFlag14                               = 22,
	PhaseFlag1                               = 23,
	PhaseFlag2                               = 24,
	PhaseFlag3                               = 25,
	PhaseFlag4                               = 26,
	PhaseFlag5                               = 27,
	PhaseFlag6                               = 28,
	PhaseFlag7                               = 29,
	PhaseFlag8                               = 30,
	EGbxViewFlag_MAX                         = 31,
};

// Enum GbxCore.EGbxViewFlagAction
// NumValues: 0x0004
enum class EGbxViewFlagAction : uint8
{
	Set                                      = 0,
	Add                                      = 1,
	Remove                                   = 2,
	EGbxViewFlagAction_MAX                   = 3,
};

// Enum GbxCore.EGbxLLMReport
// NumValues: 0x0004
enum class EGbxLLMReport : uint32
{
	All                                      = 0,
	PeakOnly                                 = 1,
	CurrentOnly                              = 2,
	EGbxLLMReport_MAX                        = 3,
};

// Enum GbxCore.EAnalyticsFileOption
// NumValues: 0x0005
enum class EAnalyticsFileOption : uint8
{
	None                                     = 0,
	Path                                     = 1,
	File                                     = 2,
	Both                                     = 3,
	EAnalyticsFileOption_MAX                 = 4,
};

// Enum GbxCore.EGbxElasticExportOptions
// NumValues: 0x0004
enum class EGbxElasticExportOptions : uint32
{
	ProjectDefault                           = 0,
	NamedFields                              = 1,
	MetricsAsStatValuePair                   = 2,
	EGbxElasticExportOptions_MAX             = 3,
};

// Enum GbxCore.EGbxAttributeModifierType
// NumValues: 0x0006
enum class EGbxAttributeModifierType : uint8
{
	ScaleAdd                                 = 0,
	PreAdd                                   = 1,
	PostAdd                                  = 2,
	ScaleMultiply                            = 3,
	OverrideBaseValue                        = 4,
	EGbxAttributeModifierType_MAX            = 5,
};

// Enum GbxCore.EGbxComparator
// NumValues: 0x0007
enum class EGbxComparator : uint8
{
	LessThan                                 = 0,
	GreaterThan                              = 1,
	LessThanEqualTo                          = 2,
	GreatherThanEqualTo                      = 3,
	EqualTo                                  = 4,
	NotEqualTo                               = 5,
	MAX                                      = 6,
};

// ScriptStruct GbxCore.GbxAnalyticsFileOptions
// 0x0028 (0x0028 - 0x0000)
struct FGbxAnalyticsFileOptions final
{
public:
	class FString                                 path;                                              // 0x0000(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0010(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnalyticsFileOption                          UseMachineName;                                    // 0x0020(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnalyticsFileOption                          UseBranch;                                         // 0x0021(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnalyticsFileOption                          UseBuild;                                          // 0x0022(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnalyticsFileOption                          UseLaunchType;                                     // 0x0023(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTimestamp;                                     // 0x0024(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseEventFolders;                                  // 0x0025(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlush;                                            // 0x0026(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShared;                                           // 0x0027(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxAnalyticsFileOptions;

// ScriptStruct GbxCore.GbxDataCollectorConfig
// 0x000C (0x000C - 0x0000)
struct FGbxDataCollectorConfig final
{
public:
	class FName                                   DataCollectorName;                                 // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptIn;                                            // 0x0008(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxDataCollectorConfig;

// ScriptStruct GbxCore.GbxContextParam
// 0x0000 (0x0008 - 0x0008)
struct FGbxContextParam : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FGbxContextParam;

// ScriptStruct GbxCore.GbxContextParam_Float
// 0x0008 (0x0010 - 0x0008)
struct FGbxContextParam_Float final : public FGbxContextParam
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxContextParam_Float;

// ScriptStruct GbxCore.GbxAttributeBase
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FGbxAttributeBase
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAttributeBase;

// ScriptStruct GbxCore.GbxAnalyticsProviderSetup
// 0x0038 (0x0038 - 0x0000)
struct FGbxAnalyticsProviderSetup final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   Class;                                             // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxAnalyticsProviderBase*              Provider;                                          // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxAnalyticsProviderSetup;

// ScriptStruct GbxCore.GbxAttributeFloat
// 0x0008 (0x000C - 0x0004)
struct FGbxAttributeFloat final : public FGbxAttributeBase
{
public:
	float                                         Value;                                             // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         BaseValue;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxAttributeFloat;

// ScriptStruct GbxCore.TestStructContext
// 0x0010 (0x0018 - 0x0008)
struct FTestStructContext final : public FGbxHasStructType
{
public:
	struct FGbxAttributeFloat                     AttributeProperty;                                 // 0x0008(0x000C)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         FloatProperty;                                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTestStructContext;

// ScriptStruct GbxCore.GbxAttributeInteger
// 0x0008 (0x000C - 0x0004)
struct FGbxAttributeInteger final : public FGbxAttributeBase
{
public:
	int32                                         Value;                                             // 0x0004(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         BaseValue;                                         // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxAttributeInteger;

// ScriptStruct GbxCore.GbxCategoryProvidersSetup
// 0x0020 (0x0020 - 0x0000)
struct FGbxCategoryProvidersSetup final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ProviderNames;                                     // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EGbxElasticExportOptions                      ElasticExportOptions;                              // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxCategoryProvidersSetup;

// ScriptStruct GbxCore.GbxContextParam_TestFloat
// 0x0008 (0x0010 - 0x0008)
struct FGbxContextParam_TestFloat final : public FGbxContextParam
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxContextParam_TestFloat;

// ScriptStruct GbxCore.GbxLock
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxLock final
{
public:
	bool                                          bLocked;                                           // 0x0000(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x27];                                       // 0x0001(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxLock;

// ScriptStruct GbxCore.GbxContextParam_Int
// 0x0008 (0x0010 - 0x0008)
struct FGbxContextParam_Int final : public FGbxContextParam
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxContextParam_Int;

// ScriptStruct GbxCore.GbxContextParam_Bool
// 0x0008 (0x0010 - 0x0008)
struct FGbxContextParam_Bool final : public FGbxContextParam
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxContextParam_Bool;

// ScriptStruct GbxCore.GbxDef_GbxDefPtrCoreTest_SimpleStruct
// 0x0008 (0x0010 - 0x0008)
struct FGbxDef_GbxDefPtrCoreTest_SimpleStruct : public FGbxHasStructType
{
public:
	int32                                         Value;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxDef_GbxDefPtrCoreTest_SimpleStruct;

// ScriptStruct GbxCore.GbxDef_GbxDefPtrCoreTest_DerivedStruct
// 0x0008 (0x0018 - 0x0010)
struct FGbxDef_GbxDefPtrCoreTest_DerivedStruct final : public FGbxDef_GbxDefPtrCoreTest_SimpleStruct
{
public:
	float                                         SubValue;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxDef_GbxDefPtrCoreTest_DerivedStruct;

// ScriptStruct GbxCore.GbxDef_GbxDefPtrCoreTest_DerivedStruct_SameStore
// 0x0008 (0x0018 - 0x0010)
struct FGbxDef_GbxDefPtrCoreTest_DerivedStruct_SameStore final : public FGbxDef_GbxDefPtrCoreTest_SimpleStruct
{
public:
	float                                         SubValue;                                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxDef_GbxDefPtrCoreTest_DerivedStruct_SameStore;

// ScriptStruct GbxCore.GbxDef_GbxDefPtrCoreTest_InvalidDef
// 0x0000 (0x0008 - 0x0008)
struct FGbxDef_GbxDefPtrCoreTest_InvalidDef final : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FGbxDef_GbxDefPtrCoreTest_InvalidDef;

// ScriptStruct GbxCore.GbxDef_GbxDefPtrCoreTest_CycleA
// 0x0018 (0x0020 - 0x0008)
struct FGbxDef_GbxDefPtrCoreTest_CycleA final : public FGbxHasStructType
{
public:
	FGbxDefPtrProperty_                           TestB;                                             // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxDef_GbxDefPtrCoreTest_CycleA;

// ScriptStruct GbxCore.GbxDef_GbxDefPtrCoreTest_CycleB
// 0x0018 (0x0020 - 0x0008)
struct FGbxDef_GbxDefPtrCoreTest_CycleB final : public FGbxHasStructType
{
public:
	FGbxDefPtrProperty_                           TestA;                                             // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxDef_GbxDefPtrCoreTest_CycleB;

// ScriptStruct GbxCore.GbxDef_GbxDefPtrCoreTest_ForeignForward
// 0x0008 (0x0010 - 0x0008)
struct FGbxDef_GbxDefPtrCoreTest_ForeignForward final : public FGbxHasStructType
{
public:
	int32                                         Value;                                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxDef_GbxDefPtrCoreTest_ForeignForward;

// ScriptStruct GbxCore.GbxLevelGameDataCategories_DONTUSE
// 0x0001 (0x0001 - 0x0000)
struct FGbxLevelGameDataCategories_DONTUSE final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxLevelGameDataCategories_DONTUSE;

// ScriptStruct GbxCore.TestInlineStruct
// 0x0028 (0x0030 - 0x0008)
struct FTestInlineStruct : public FGbxHasStructType
{
public:
	struct FGbxAttributeFloat                     AttributeProperty;                                 // 0x0008(0x000C)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringProperty;                                    // 0x0018(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatProperty;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestInlineStruct;

// ScriptStruct GbxCore.TestDerivedInlineStruct
// 0x0008 (0x0038 - 0x0030)
struct FTestDerivedInlineStruct final : public FTestInlineStruct
{
public:
	int32                                         IntProperty;                                       // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestDerivedInlineStruct;

// ScriptStruct GbxCore.TestUnrelatedInlineStruct
// 0x0008 (0x0010 - 0x0008)
struct FTestUnrelatedInlineStruct final : public FGbxHasStructType
{
public:
	bool                                          BoolProperty;                                      // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTestUnrelatedInlineStruct;

// ScriptStruct GbxCore.TEST_InlineStructContainer
// 0x0020 (0x0028 - 0x0008)
struct FTEST_InlineStructContainer final : public FGbxHasStructType
{
public:
	struct FGbxInlineStruct                       InlineStruct;                                      // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
	int32                                         OtherProperty;                                     // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTEST_InlineStructContainer;

// ScriptStruct GbxCore.TEST_InlineStructContainerWithDefault
// 0x0018 (0x0020 - 0x0008)
struct FTEST_InlineStructContainerWithDefault final : public FGbxHasStructType
{
public:
	struct FGbxInlineStruct                       ContainedInlineStruct;                             // 0x0008(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTEST_InlineStructContainerWithDefault;

// ScriptStruct GbxCore.TestForwardDeclaredInlineStruct
// 0x0000 (0x0008 - 0x0008)
struct FTestForwardDeclaredInlineStruct : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FTestForwardDeclaredInlineStruct;

// ScriptStruct GbxCore.TestInvalidForwardDeclaredChildInlineStruct
// 0x0000 (0x0008 - 0x0008)
struct FTestInvalidForwardDeclaredChildInlineStruct final : public FTestForwardDeclaredInlineStruct
{
};
DUMPER7_ASSERTS_FTestInvalidForwardDeclaredChildInlineStruct;

// ScriptStruct GbxCore.ParsedPropertyPathElement
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FParsedPropertyPathElement final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsesArrayIndex;                                   // 0x0008(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ArrayIndex;                                        // 0x0009(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2E];                                       // 0x000A(0x002E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FParsedPropertyPathElement;

// ScriptStruct GbxCore.ParsedProperty
// 0x0150 (0x0150 - 0x0000)
struct FParsedProperty final
{
public:
	struct FParsedPropertyPathElement             ParsedPath[0x5];                                   // 0x0000(0x0038)(Edit, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint32                                        ParsedPathLength;                                  // 0x0118(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PropertyPath;                                      // 0x0120(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 OutputMessage;                                     // 0x0130(0x0010)(Edit, ZeroConstructor, Transient, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0x10];                                     // 0x0140(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FParsedProperty;

// ScriptStruct GbxCore.GbxContextParam_TestInt
// 0x0008 (0x0010 - 0x0008)
struct FGbxContextParam_TestInt final : public FGbxContextParam
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxContextParam_TestInt;

}

