#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxDestruction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GbxDestruction.EGeometryCollectionChunkCollisionOverrideSettings
// NumValues: 0x0004
enum class EGeometryCollectionChunkCollisionOverrideSettings : uint32
{
	None                                     = 0,
	ProjectDefault                           = 1,
	Custom                                   = 2,
	EGeometryCollectionChunkCollisionOverrideSettings_MAX = 3,
};

// Enum GbxDestruction.ESwapType
// NumValues: 0x0003
enum class ESwapType : uint8
{
	EST_MeshSwap                             = 0,
	EST_MaterialSwap                         = 1,
	EST_MAX                                  = 2,
};

// Enum GbxDestruction.EDestructionProjectileType
// NumValues: 0x0005
enum class EDestructionProjectileType : uint8
{
	LightProjectile                          = 0,
	LightBeam                                = 1,
	CauseDamage                              = 2,
	None                                     = 3,
	EDestructionProjectileType_MAX           = 4,
};

// Enum GbxDestruction.EObjectStateTypeEnumMirror
// NumValues: 0x0007
enum class EObjectStateTypeEnumMirror : uint8
{
	Chaos_NONE                               = 0,
	Chaos_Object_Sleeping                    = 1,
	Chaos_Object_Kinematic                   = 2,
	Chaos_Object_Static                      = 3,
	Chaos_Object_Dynamic                     = 4,
	Chaos_Object_UserDefined                 = 100,
	Chaos_Max                                = 101,
};

// Enum GbxDestruction.EClusterConnectionTypeEnumMirror
// NumValues: 0x0007
enum class EClusterConnectionTypeEnumMirror : uint8
{
	Chaos_PointImplicit                      = 0,
	Chaos_DelaunayTriangulation              = 1,
	Chaos_MinimalSpanningSubsetDelaunayTriangulation = 2,
	Chaos_PointImplicitAugmentedWithMinimalDelaunay = 3,
	Chaos_None                               = 5,
	Chaos_EClsuterCreationParameters_Max     = 6,
	Chaos_MAX                                = 7,
};

// ScriptStruct GbxDestruction.GeometryCollectionInstance
// 0x0080 (0x0080 - 0x0000)
struct FGeometryCollectionInstance final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AGeometryCollectionActor> Actor;                                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UGeometryCollectionAsset> Asset;                                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InitTransform;                                     // 0x0020(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGeometryCollectionInstance;

// ScriptStruct GbxDestruction.DestructibleConstraint
// 0x0070 (0x0070 - 0x0000)
struct FDestructibleConstraint final
{
public:
	struct FVector                                PointToAttachTo;                                   // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearConstraint                      LinearLimit;                                       // 0x0018(0x001C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FConeConstraint                        ConeLimit;                                         // 0x0034(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FTwistConstraint                       TwistLimit;                                        // 0x0054(0x001C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDestructibleConstraint;

// ScriptStruct GbxDestruction.DestructionHitProperties
// 0x0150 (0x0150 - 0x0000)
struct alignas(0x10) FDestructionHitProperties final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0100)(BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strain;                                            // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x44];                                     // 0x010C(0x0044)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDestructionHitProperties;

}

