#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxDefaultLoadingScreen

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "GbxUICore_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GbxDefaultLoadingScreen.GbxDefaultLoadingScreenSettings
// 0x0060 (0x0098 - 0x0038)
class UGbxDefaultLoadingScreenSettings final : public UDeveloperSettings
{
public:
	class FString                                 LoadingMovieName;                                  // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StartupLoopEndMapName;                             // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   LoadingWidget;                                     // 0x0058(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowEngineTickDuringLoadingScreen;               // 0x0080(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HoldToSkipDuration;                                // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           SkipCutsceneKeys;                                  // 0x0088(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDefaultLoadingScreenSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDefaultLoadingScreenSettings")
	}
	static class UGbxDefaultLoadingScreenSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDefaultLoadingScreenSettings>();
	}
};
DUMPER7_ASSERTS_UGbxDefaultLoadingScreenSettings;

// Class GbxDefaultLoadingScreen.GbxDefaultLoadingScreenManager
// 0x00D0 (0x0110 - 0x0040)
class UGbxDefaultLoadingScreenManager : public UGbxLoadingScreenManager
{
public:
	uint8                                         Pad_40[0xD0];                                      // 0x0040(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDefaultLoadingScreenManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDefaultLoadingScreenManager")
	}
	static class UGbxDefaultLoadingScreenManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDefaultLoadingScreenManager>();
	}
};
DUMPER7_ASSERTS_UGbxDefaultLoadingScreenManager;

}

