#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxDecorator

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GbxDecorator.GbxDecoratorActor.MonitorPropertyForActorChangedDelegate
// 0x0010 (0x0010 - 0x0000)
struct GbxDecoratorActor_MonitorPropertyForActorChangedDelegate final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDecoratorActor_MonitorPropertyForActorChangedDelegate;

// Function GbxDecorator.GbxDecoratorBlueprintLibrary.ToRotationAxis
// 0x0038 (0x0038 - 0x0000)
struct GbxDecoratorBlueprintLibrary_ToRotationAxis final
{
public:
	struct FRotator                               Rotator;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Axis;                                              // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxDecoratorBlueprintLibrary_ToRotationAxis;

// Function GbxDecorator.GbxDecoratorConstructorInterface.IsOnlyUpdatingWithMoveOrPropertiesChange
// 0x0001 (0x0001 - 0x0000)
struct GbxDecoratorConstructorInterface_IsOnlyUpdatingWithMoveOrPropertiesChange final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDecoratorConstructorInterface_IsOnlyUpdatingWithMoveOrPropertiesChange;

}

