#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxDestruction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GeometryCollectionEngine_classes.hpp"
#include "GbxDestruction_structs.hpp"
#include "ChaosSolverEngine_classes.hpp"
#include "Chaos_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GbxDestruction.CustomFractureFieldEffects
// 0x0000 (0x0028 - 0x0028)
class UCustomFractureFieldEffects final : public UObject
{
public:
	void OnApplyField(class UWorld* World, const struct FVector& Location, const struct FVector& Direction, float Radius, float Magnitude, float Strain);
	void OnApplyFieldWithProperties(class UWorld* World, const struct FDestructionHitProperties& Properties);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CustomFractureFieldEffects")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CustomFractureFieldEffects")
	}
	static class UCustomFractureFieldEffects* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomFractureFieldEffects>();
	}
};
DUMPER7_ASSERTS_UCustomFractureFieldEffects;

// Class GbxDestruction.DestructionSolverGeometryRenderComponent
// 0x0010 (0x0630 - 0x0620)
class UDestructionSolverGeometryRenderComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_620[0x10];                                     // 0x0620(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DestructionSolverGeometryRenderComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DestructionSolverGeometryRenderComponent")
	}
	static class UDestructionSolverGeometryRenderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestructionSolverGeometryRenderComponent>();
	}
};
DUMPER7_ASSERTS_UDestructionSolverGeometryRenderComponent;

// Class GbxDestruction.DestructionSolverGeometryManagerComponent
// 0x0070 (0x0320 - 0x02B0)
class UDestructionSolverGeometryManagerComponent final : public USceneComponent
{
public:
	TArray<TWeakObjectPtr<class UPrimitiveComponent>> StaticComponents;                              // 0x02A8(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FGeometryCollectionInstance>    GeometryCollections;                               // 0x02B8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C8[0x58];                                     // 0x02C8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBreakMakeFracturedChunksTransient(const struct FChaosBreakEvent& BreakEvent);
	void OnBreakRemoveWorldQueryCollision(const struct FChaosBreakEvent& BreakEvent);
	void OnBreakSetFracturedChunksCollisionFilterData(const struct FChaosBreakEvent& BreakEvent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DestructionSolverGeometryManagerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DestructionSolverGeometryManagerComponent")
	}
	static class UDestructionSolverGeometryManagerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestructionSolverGeometryManagerComponent>();
	}
};
DUMPER7_ASSERTS_UDestructionSolverGeometryManagerComponent;

// Class GbxDestruction.DestructionSolver
// 0x0060 (0x05D8 - 0x0578)
class ADestructionSolver final : public AChaosSolverActor
{
public:
	struct FBox                                   Bounds;                                            // 0x0578(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B0[0x10];                                     // 0x05B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UDestructionSolverGeometryManagerComponent* StaticGeometryComponent;                       // 0x05C0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C8[0x10];                                     // 0x05C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DestructionSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DestructionSolver")
	}
	static class ADestructionSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADestructionSolver>();
	}
};
DUMPER7_ASSERTS_ADestructionSolver;

// Class GbxDestruction.GbxDestructibleData
// 0x00A8 (0x00D8 - 0x0030)
class UGbxDestructibleData : public UDataAsset
{
public:
	struct FDestructibleConstraint                Constraint;                                        // 0x0030(0x0070)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseConstraint;                                    // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            PreFractureMesh;                                   // 0x00A8(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            PostFractureMesh;                                  // 0x00B0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          PreFractureSkeletalMesh;                           // 0x00B8(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          PostFractureSkeletalMesh;                          // 0x00C0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCollection*                    FractureMesh;                                      // 0x00C8(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFXSystemAsset*                         OnFractureParticleEffect;                          // 0x00D0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDestructibleData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDestructibleData")
	}
	static class UGbxDestructibleData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDestructibleData>();
	}
};
DUMPER7_ASSERTS_UGbxDestructibleData;

// Class GbxDestruction.GbxDestructibleGeometryCollectionData
// 0x01E8 (0x02C0 - 0x00D8)
class UGbxDestructibleGeometryCollectionData : public UGbxDestructibleData
{
public:
	EObjectStateTypeEnum                          InitialState;                                      // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LinearDamping;                                     // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularDamping;                                    // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOutwardBiasedVelocityApplication;              // 0x00E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutwardVelocityApplicationBias;                    // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDirectionalVelocity;                           // 0x00EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StrainRadiusScale;                                 // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityApplicationRadiusScale;                    // 0x00F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCollection*                    FractureMesh_GbxDestructibleGeometryCollectionData; // 0x00F8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransientChunkFraction;                            // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverrideChunkVolumeThreshold;                      // 0x0104(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConsideredFracturedPercentage;                     // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideDestroyChunksOutsideBox;                   // 0x010C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OverrideDestroyChunksOutsideBoxExtend;             // 0x0110(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideChunkBodyData;                            // 0x0128(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EGeometryCollectionChunkCollisionOverrideSettings OverrideChunkBodyData;                         // 0x012C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBodyInstance                          BodyInstanceOverride;                              // 0x0130(0x0188)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bKeepBoundingBoxInGame;                            // 0x02B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableBoundingBoxOnFracture;                     // 0x02B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TSubclassOf<class UGbxGeometryCollectionComponent> GetGeometryCollectionComponentClass() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDestructibleGeometryCollectionData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDestructibleGeometryCollectionData")
	}
	static class UGbxDestructibleGeometryCollectionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDestructibleGeometryCollectionData>();
	}
};
DUMPER7_ASSERTS_UGbxDestructibleGeometryCollectionData;

// Class GbxDestruction.GbxDestructibleInterface
// 0x0000 (0x0000 - 0x0000)
class IGbxDestructibleInterface final
{
public:
	void DoFracture(const struct FVector& FractureOrigin, const struct FVector& FractureForce);
	void DoMaxStrainFractureSphere_Local(const struct FVector& OriginOffset, float ChunkFlyOffMagnitude, float Radius);
	void DoMaxStrainFractureSphere_World(const struct FVector& Origin, float ChunkFlyOffMagnitude, float Radius);
	void DoMaxStrainFractureWhole();
	void SetIsFractureable(bool NewIsFractureable);

	bool GetIsFractureable() const;
	bool IsFractured() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDestructibleInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDestructibleInterface")
	}
	static class IGbxDestructibleInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxDestructibleInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxDestructibleInterface;

// Class GbxDestruction.GbxDestructibleScriptInterface
// 0x0000 (0x0000 - 0x0000)
class IGbxDestructibleScriptInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDestructibleScriptInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDestructibleScriptInterface")
	}
	static class IGbxDestructibleScriptInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxDestructibleScriptInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxDestructibleScriptInterface;

// Class GbxDestruction.GbxDestructibleSkeletalMeshData
// 0x0018 (0x00F0 - 0x00D8)
class UGbxDestructibleSkeletalMeshData final : public UGbxDestructibleData
{
public:
	class USkeletalMesh*                          PreFractureMesh_GbxDestructibleSkeletalMeshData;   // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          PostFractureMesh_GbxDestructibleSkeletalMeshData;  // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFXSystemAsset*                         OnFractureParticleEffect_GbxDestructibleSkeletalMeshData; // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class UFXSystemAsset* GetOnFractureParticleEffect() const;
	class USkeletalMesh* GetPostFractureMesh() const;
	class USkeletalMesh* GetPreFractureMesh() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDestructibleSkeletalMeshData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDestructibleSkeletalMeshData")
	}
	static class UGbxDestructibleSkeletalMeshData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDestructibleSkeletalMeshData>();
	}
};
DUMPER7_ASSERTS_UGbxDestructibleSkeletalMeshData;

// Class GbxDestruction.GbxDestructibleStaticMeshData
// 0x0048 (0x0120 - 0x00D8)
class UGbxDestructibleStaticMeshData : public UGbxDestructibleData
{
public:
	bool                                          bSimulatePhysics;                                  // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartAwake;                                       // 0x00D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SwapTypes;                                         // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            PreFractureMesh_GbxDestructibleStaticMeshData;     // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            PostFractureMesh_GbxDestructibleStaticMeshData;    // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             InitialMaterials;                                  // 0x00F0(0x0010)(Edit, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             SwapToMaterials;                                   // 0x0100(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                         StrainThreshold;                                   // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAccumulateStrain;                                 // 0x0114(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0xB];                                      // 0x0115(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UStaticMesh* GetPostFractureMesh() const;
	class UStaticMesh* GetPreFractureMesh() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDestructibleStaticMeshData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDestructibleStaticMeshData")
	}
	static class UGbxDestructibleStaticMeshData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDestructibleStaticMeshData>();
	}
};
DUMPER7_ASSERTS_UGbxDestructibleStaticMeshData;

// Class GbxDestruction.GbxDestructionMapDataAsset
// 0x0050 (0x0080 - 0x0030)
class UGbxDestructionMapDataAsset final : public UDataAsset
{
public:
	TMap<TSoftObjectPtr<class UStaticMesh>, TSoftObjectPtr<class UGbxDestructibleData>> MeshDestructibleMap; // 0x0030(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDestructionMapDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDestructionMapDataAsset")
	}
	static class UGbxDestructionMapDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDestructionMapDataAsset>();
	}
};
DUMPER7_ASSERTS_UGbxDestructionMapDataAsset;

// Class GbxDestruction.GbxDestructionSettings
// 0x00C8 (0x0100 - 0x0038)
class UGbxDestructionSettings final : public UDeveloperSettings
{
public:
	float                                         ChunkVolumeThreshold;                              // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCustomFractureFieldEffects> CustomFractureFieldEffects;                       // 0x0040(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultFractureStrain;                             // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultFractureRadius;                             // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultFractureForce;                              // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           GeometryCollectionAssetsPathFilter;                // 0x0058(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         DefaultMaxNumberOfDoFractureCalls;                 // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PostBreakDuration;                                 // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BreakRemovalDuration;                              // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DestroyChunksOutsideBoxScale;                      // 0x0074(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFractureNoise;                                 // 0x0078(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NoiseMinRange;                                     // 0x007C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseMaxRange;                                     // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseScaleBase;                                    // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseScaleMultiplier;                              // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDirectionalVelocity;                           // 0x008C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAngularMomentum;                               // 0x008D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TorqueMultiplier;                                  // 0x0090(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ImportedChunksFolderPath;                          // 0x0098(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GeometryCollectionsFolderPath;                     // 0x00A8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannelToBlockForBoundingBox;             // 0x00B8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DefaultDestructibleChunkCollisionProfileName;      // 0x00BC(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UGbxDestructionMapDataAsset> DestructionMapFromSM;                          // 0x00C8(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GravityGroupOneZ;                                  // 0x00F0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightObjectImpactScale;                            // 0x00F4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MediumObjectImpactScale;                           // 0x00F8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeavyObjectImpactScale;                            // 0x00FC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDestructionSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDestructionSettings")
	}
	static class UGbxDestructionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDestructionSettings>();
	}
};
DUMPER7_ASSERTS_UGbxDestructionSettings;

// Class GbxDestruction.GbxDestructionStatics
// 0x0000 (0x0028 - 0x0028)
class UGbxDestructionStatics final : public UBlueprintFunctionLibrary
{
public:
	static void DoFracture(const struct FDestructionHitProperties& Properties);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDestructionStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDestructionStatics")
	}
	static class UGbxDestructionStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDestructionStatics>();
	}
};
DUMPER7_ASSERTS_UGbxDestructionStatics;

// Class GbxDestruction.GbxGeometryCollectionActor
// 0x0008 (0x03A8 - 0x03A0)
class AGbxGeometryCollectionActor final : public AGeometryCollectionActor
{
public:
	bool                                          bAlwaysDestructible;                               // 0x03A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGeometryCollectionActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGeometryCollectionActor")
	}
	static class AGbxGeometryCollectionActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxGeometryCollectionActor>();
	}
};
DUMPER7_ASSERTS_AGbxGeometryCollectionActor;

// Class GbxDestruction.GbxGeometryCollectionComponent
// 0x04C0 (0x0FB0 - 0x0AF0)
class UGbxGeometryCollectionComponent : public UGeometryCollectionComponent
{
public:
	uint8                                         Pad_AF0[0x8];                                      // 0x0AF0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxDestructibleGeometryCollectionData* DestructibleData;                                  // 0x0AF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B00[0x64];                                     // 0x0B00(0x0064)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsThereAnyStaticLeafChunk;                        // 0x0B64(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_B65[0x3];                                      // 0x0B65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConstraintInstance                    ConstraintInstance;                                // 0x0B68(0x0288)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_DF0[0x1C0];                                    // 0x0DF0(0x01C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const class UGbxDestructibleGeometryCollectionData* GetDestructibleData();
	void OnBreakRunDestructionCallbacks(const struct FChaosBreakEvent& BreakEvent);
	void SetDestructibleData(const class UGbxDestructibleData* data);

	float GetPercentageOfChunksFractured() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGeometryCollectionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGeometryCollectionComponent")
	}
	static class UGbxGeometryCollectionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGeometryCollectionComponent>();
	}
};
DUMPER7_ASSERTS_UGbxGeometryCollectionComponent;

// Class GbxDestruction.GeometryCollectionAsset
// 0x00A0 (0x00D0 - 0x0030)
class UGeometryCollectionAsset final : public UDataAsset
{
public:
	struct FSoftObjectPath                        SearchMesh;                                        // 0x0030(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        GeometryCollection;                                // 0x0050(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        StaticCore;                                        // 0x0070(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimulating;                                       // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectStateTypeEnumMirror                    ObjectType;                                        // 0x0091(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableClustering;                                  // 0x0092(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ClusterGroupIndex;                                 // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxClusterLevel;                                   // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 DamageThreshold;                                   // 0x00A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EClusterConnectionTypeEnumMirror              ClusterConnectionType;                             // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CollisionGroup;                                    // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransientChunkFraction;                            // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x14];                                      // 0x00BC(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GeometryCollectionAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GeometryCollectionAsset")
	}
	static class UGeometryCollectionAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeometryCollectionAsset>();
	}
};
DUMPER7_ASSERTS_UGeometryCollectionAsset;

}

