#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxDestruction

#include "Basic.hpp"

#include "GbxDestruction_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GbxDestruction.CustomFractureFieldEffects.OnApplyField
// 0x0048 (0x0048 - 0x0000)
struct CustomFractureFieldEffects_OnApplyField final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Direction;                                         // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Magnitude;                                         // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strain;                                            // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CustomFractureFieldEffects_OnApplyField;

// Function GbxDestruction.CustomFractureFieldEffects.OnApplyFieldWithProperties
// 0x0160 (0x0160 - 0x0000)
struct CustomFractureFieldEffects_OnApplyFieldWithProperties final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDestructionHitProperties              Properties;                                        // 0x0010(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CustomFractureFieldEffects_OnApplyFieldWithProperties;

// Function GbxDestruction.DestructionSolverGeometryManagerComponent.OnBreakMakeFracturedChunksTransient
// 0x0078 (0x0078 - 0x0000)
struct DestructionSolverGeometryManagerComponent_OnBreakMakeFracturedChunksTransient final
{
public:
	struct FChaosBreakEvent                       BreakEvent;                                        // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DestructionSolverGeometryManagerComponent_OnBreakMakeFracturedChunksTransient;

// Function GbxDestruction.DestructionSolverGeometryManagerComponent.OnBreakRemoveWorldQueryCollision
// 0x0078 (0x0078 - 0x0000)
struct DestructionSolverGeometryManagerComponent_OnBreakRemoveWorldQueryCollision final
{
public:
	struct FChaosBreakEvent                       BreakEvent;                                        // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DestructionSolverGeometryManagerComponent_OnBreakRemoveWorldQueryCollision;

// Function GbxDestruction.DestructionSolverGeometryManagerComponent.OnBreakSetFracturedChunksCollisionFilterData
// 0x0078 (0x0078 - 0x0000)
struct DestructionSolverGeometryManagerComponent_OnBreakSetFracturedChunksCollisionFilterData final
{
public:
	struct FChaosBreakEvent                       BreakEvent;                                        // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DestructionSolverGeometryManagerComponent_OnBreakSetFracturedChunksCollisionFilterData;

// Function GbxDestruction.GbxDestructibleGeometryCollectionData.GetGeometryCollectionComponentClass
// 0x0008 (0x0008 - 0x0000)
struct GbxDestructibleGeometryCollectionData_GetGeometryCollectionComponentClass final
{
public:
	TSubclassOf<class UGbxGeometryCollectionComponent> ReturnValue;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleGeometryCollectionData_GetGeometryCollectionComponentClass;

// Function GbxDestruction.GbxDestructibleInterface.DoFracture
// 0x0030 (0x0030 - 0x0000)
struct GbxDestructibleInterface_DoFracture final
{
public:
	struct FVector                                FractureOrigin;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FractureForce;                                     // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleInterface_DoFracture;

// Function GbxDestruction.GbxDestructibleInterface.DoMaxStrainFractureSphere_Local
// 0x0020 (0x0020 - 0x0000)
struct GbxDestructibleInterface_DoMaxStrainFractureSphere_Local final
{
public:
	struct FVector                                OriginOffset;                                      // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChunkFlyOffMagnitude;                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleInterface_DoMaxStrainFractureSphere_Local;

// Function GbxDestruction.GbxDestructibleInterface.DoMaxStrainFractureSphere_World
// 0x0020 (0x0020 - 0x0000)
struct GbxDestructibleInterface_DoMaxStrainFractureSphere_World final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChunkFlyOffMagnitude;                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleInterface_DoMaxStrainFractureSphere_World;

// Function GbxDestruction.GbxDestructibleInterface.SetIsFractureable
// 0x0001 (0x0001 - 0x0000)
struct GbxDestructibleInterface_SetIsFractureable final
{
public:
	bool                                          NewIsFractureable;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleInterface_SetIsFractureable;

// Function GbxDestruction.GbxDestructibleInterface.GetIsFractureable
// 0x0001 (0x0001 - 0x0000)
struct GbxDestructibleInterface_GetIsFractureable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleInterface_GetIsFractureable;

// Function GbxDestruction.GbxDestructibleInterface.IsFractured
// 0x0001 (0x0001 - 0x0000)
struct GbxDestructibleInterface_IsFractured final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleInterface_IsFractured;

// Function GbxDestruction.GbxDestructibleSkeletalMeshData.GetOnFractureParticleEffect
// 0x0008 (0x0008 - 0x0000)
struct GbxDestructibleSkeletalMeshData_GetOnFractureParticleEffect final
{
public:
	class UFXSystemAsset*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleSkeletalMeshData_GetOnFractureParticleEffect;

// Function GbxDestruction.GbxDestructibleSkeletalMeshData.GetPostFractureMesh
// 0x0008 (0x0008 - 0x0000)
struct GbxDestructibleSkeletalMeshData_GetPostFractureMesh final
{
public:
	class USkeletalMesh*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleSkeletalMeshData_GetPostFractureMesh;

// Function GbxDestruction.GbxDestructibleSkeletalMeshData.GetPreFractureMesh
// 0x0008 (0x0008 - 0x0000)
struct GbxDestructibleSkeletalMeshData_GetPreFractureMesh final
{
public:
	class USkeletalMesh*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleSkeletalMeshData_GetPreFractureMesh;

// Function GbxDestruction.GbxDestructibleStaticMeshData.GetPostFractureMesh
// 0x0008 (0x0008 - 0x0000)
struct GbxDestructibleStaticMeshData_GetPostFractureMesh final
{
public:
	class UStaticMesh*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleStaticMeshData_GetPostFractureMesh;

// Function GbxDestruction.GbxDestructibleStaticMeshData.GetPreFractureMesh
// 0x0008 (0x0008 - 0x0000)
struct GbxDestructibleStaticMeshData_GetPreFractureMesh final
{
public:
	class UStaticMesh*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructibleStaticMeshData_GetPreFractureMesh;

// Function GbxDestruction.GbxDestructionStatics.DoFracture
// 0x0150 (0x0150 - 0x0000)
struct GbxDestructionStatics_DoFracture final
{
public:
	struct FDestructionHitProperties              Properties;                                        // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxDestructionStatics_DoFracture;

// Function GbxDestruction.GbxGeometryCollectionComponent.GetDestructibleData
// 0x0008 (0x0008 - 0x0000)
struct GbxGeometryCollectionComponent_GetDestructibleData final
{
public:
	const class UGbxDestructibleGeometryCollectionData* ReturnValue;                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxGeometryCollectionComponent_GetDestructibleData;

// Function GbxDestruction.GbxGeometryCollectionComponent.OnBreakRunDestructionCallbacks
// 0x0078 (0x0078 - 0x0000)
struct GbxGeometryCollectionComponent_OnBreakRunDestructionCallbacks final
{
public:
	struct FChaosBreakEvent                       BreakEvent;                                        // 0x0000(0x0078)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxGeometryCollectionComponent_OnBreakRunDestructionCallbacks;

// Function GbxDestruction.GbxGeometryCollectionComponent.SetDestructibleData
// 0x0008 (0x0008 - 0x0000)
struct GbxGeometryCollectionComponent_SetDestructibleData final
{
public:
	const class UGbxDestructibleData*             data;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxGeometryCollectionComponent_SetDestructibleData;

// Function GbxDestruction.GbxGeometryCollectionComponent.GetPercentageOfChunksFractured
// 0x0004 (0x0004 - 0x0000)
struct GbxGeometryCollectionComponent_GetPercentageOfChunksFractured final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxGeometryCollectionComponent_GetPercentageOfChunksFractured;

}

