#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxDecorator

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GbxGame_structs.hpp"


namespace SDK
{

// Class GbxDecorator.GbxDecoratorActor
// 0x0000 (0x0390 - 0x0390)
class AGbxDecoratorActor : public AActor
{
public:
	void MonitorPropertyForActorChangedDelegate(const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDecoratorActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDecoratorActor")
	}
	static class AGbxDecoratorActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxDecoratorActor>();
	}
};
DUMPER7_ASSERTS_AGbxDecoratorActor;

// Class GbxDecorator.GbxDecoratorBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UGbxDecoratorBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ToRotationAxis(const struct FRotator& Rotator, struct FVector* Axis, float* Angle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDecoratorBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDecoratorBlueprintLibrary")
	}
	static class UGbxDecoratorBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDecoratorBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UGbxDecoratorBlueprintLibrary;

// Class GbxDecorator.GbxDecoratorConstructorInterface
// 0x0000 (0x0000 - 0x0000)
class IGbxDecoratorConstructorInterface final
{
public:
	void EditorConstructionScript();
	bool IsOnlyUpdatingWithMoveOrPropertiesChange();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDecoratorConstructorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDecoratorConstructorInterface")
	}
	static class IGbxDecoratorConstructorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxDecoratorConstructorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxDecoratorConstructorInterface;

// Class GbxDecorator.GbxDecoratorDataAssetBase
// 0x0000 (0x0030 - 0x0030)
class UGbxDecoratorDataAssetBase : public UDataAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDecoratorDataAssetBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDecoratorDataAssetBase")
	}
	static class UGbxDecoratorDataAssetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDecoratorDataAssetBase>();
	}
};
DUMPER7_ASSERTS_UGbxDecoratorDataAssetBase;

// Class GbxDecorator.GbxDecoratorFactComponent
// 0x0068 (0x0178 - 0x0110)
class UGbxDecoratorFactComponent : public UActorComponent
{
public:
	class FName                                   FactAddressName;                                   // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFactAddress                           FactAddress;                                       // 0x0118(0x0038)(Edit, BlueprintVisible, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FullFactAddressString;                             // 0x0150(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseNamedFactValues;                               // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DefaultFactValues;                                 // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDecoratorFactComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDecoratorFactComponent")
	}
	static class UGbxDecoratorFactComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDecoratorFactComponent>();
	}
};
DUMPER7_ASSERTS_UGbxDecoratorFactComponent;

// Class GbxDecorator.GbxDecoratorSettings
// 0x0010 (0x0048 - 0x0038)
class UGbxDecoratorSettings final : public UDeveloperSettings
{
public:
	TArray<class FName>                           MissingPackages;                                   // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDecoratorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDecoratorSettings")
	}
	static class UGbxDecoratorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDecoratorSettings>();
	}
};
DUMPER7_ASSERTS_UGbxDecoratorSettings;

// Class GbxDecorator.GbxDecoratorValidationSettings
// 0x0008 (0x0030 - 0x0028)
class UGbxDecoratorValidationSettings final : public UObject
{
public:
	bool                                          bRestrictOneDepthInheritance;                      // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDecoratorValidationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDecoratorValidationSettings")
	}
	static class UGbxDecoratorValidationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDecoratorValidationSettings>();
	}
};
DUMPER7_ASSERTS_UGbxDecoratorValidationSettings;

// Class GbxDecorator.GbxDecoratorWithFactsSubsystem
// 0x0050 (0x0080 - 0x0030)
class UGbxDecoratorWithFactsSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDecoratorWithFactsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDecoratorWithFactsSubsystem")
	}
	static class UGbxDecoratorWithFactsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDecoratorWithFactsSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxDecoratorWithFactsSubsystem;

}

