#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxEnhancedInput

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct GbxEnhancedInput.GbxPreSwizzleInputModifierList
// 0x0010 (0x0010 - 0x0000)
struct FGbxPreSwizzleInputModifierList final
{
public:
	TArray<class UInputModifier*>                 Modifiers;                                         // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxPreSwizzleInputModifierList;

// ScriptStruct GbxEnhancedInput.MappingContextMapEntry
// 0x0018 (0x0018 - 0x0000)
struct FMappingContextMapEntry final
{
public:
	TArray<TSoftObjectPtr<class UInputMappingContext>> MappingContexts;                              // 0x0000(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         priority;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDebug;                                          // 0x0014(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisterWithSettings;                             // 0x0015(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMappingContextMapEntry;

}

