#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxEnhancedInput

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "EnhancedInput_classes.hpp"
#include "GbxEnhancedInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GbxEnhancedInput.GbxEnhancedInputAction
// 0x0030 (0x00A8 - 0x0078)
class UGbxEnhancedInputAction final : public UInputAction
{
public:
	struct FGameplayTag                           InputTag;                                          // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GlyphManagerPriority;                              // 0x0080(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowForGlyphManager;                              // 0x0084(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_85[0x23];                                      // 0x0085(0x0023)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxEnhancedInputAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxEnhancedInputAction")
	}
	static class UGbxEnhancedInputAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxEnhancedInputAction>();
	}
};
DUMPER7_ASSERTS_UGbxEnhancedInputAction;

// Class GbxEnhancedInput.GbxEnhancedInputActionHandler
// 0x0008 (0x0030 - 0x0028)
class UGbxEnhancedInputActionHandler : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxEnhancedInputActionHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxEnhancedInputActionHandler")
	}
	static class UGbxEnhancedInputActionHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxEnhancedInputActionHandler>();
	}
};
DUMPER7_ASSERTS_UGbxEnhancedInputActionHandler;

// Class GbxEnhancedInput.GbxEnhancedInputComponent
// 0x0010 (0x01E0 - 0x01D0)
class UGbxEnhancedInputComponent : public UEnhancedInputComponent
{
public:
	TArray<class UGbxEnhancedInputActionHandler*> BoundActionHandlerList;                            // 0x01D0(0x0010)(ZeroConstructor, DuplicateTransient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxEnhancedInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxEnhancedInputComponent")
	}
	static class UGbxEnhancedInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxEnhancedInputComponent>();
	}
};
DUMPER7_ASSERTS_UGbxEnhancedInputComponent;

// Class GbxEnhancedInput.GbxPreSwizzleInputModifiers
// 0x0050 (0x0080 - 0x0030)
class UGbxPreSwizzleInputModifiers final : public UDataAsset
{
public:
	TMap<struct FKey, struct FGbxPreSwizzleInputModifierList> PreSwizzleInputModifiers;              // 0x0030(0x0050)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxPreSwizzleInputModifiers")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxPreSwizzleInputModifiers")
	}
	static class UGbxPreSwizzleInputModifiers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxPreSwizzleInputModifiers>();
	}
};
DUMPER7_ASSERTS_UGbxPreSwizzleInputModifiers;

// Class GbxEnhancedInput.GbxInputModifier_AxialDeadZone
// 0x0008 (0x0030 - 0x0028)
class UGbxInputModifier_AxialDeadZone final : public UInputModifier
{
public:
	float                                         AxialDeadZone_Inner;                               // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AxialDeadZone_Outer;                               // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxInputModifier_AxialDeadZone")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxInputModifier_AxialDeadZone")
	}
	static class UGbxInputModifier_AxialDeadZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxInputModifier_AxialDeadZone>();
	}
};
DUMPER7_ASSERTS_UGbxInputModifier_AxialDeadZone;

// Class GbxEnhancedInput.GbxInputModifier_NonLinear
// 0x0008 (0x0030 - 0x0028)
class UGbxInputModifier_NonLinear final : public UInputModifier
{
public:
	float                                         NonLinearExponent;                                 // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxInputModifier_NonLinear")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxInputModifier_NonLinear")
	}
	static class UGbxInputModifier_NonLinear* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxInputModifier_NonLinear>();
	}
};
DUMPER7_ASSERTS_UGbxInputModifier_NonLinear;

// Class GbxEnhancedInput.GbxInputModifier_Acceleration
// 0x0048 (0x0070 - 0x0028)
class UGbxInputModifier_Acceleration final : public UInputModifier
{
public:
	float                                         Accel_Threshold;                                   // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Accel_Delay;                                       // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Accel_Duration;                                    // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Accel_Scale;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Decel_Duration;                                    // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Decel_Angle;                                       // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxInputModifier_Acceleration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxInputModifier_Acceleration")
	}
	static class UGbxInputModifier_Acceleration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxInputModifier_Acceleration>();
	}
};
DUMPER7_ASSERTS_UGbxInputModifier_Acceleration;

// Class GbxEnhancedInput.GbxEnhancedInputPlayerMappableKeySettings
// 0x0000 (0x0078 - 0x0078)
class UGbxEnhancedInputPlayerMappableKeySettings : public UPlayerMappableKeySettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxEnhancedInputPlayerMappableKeySettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxEnhancedInputPlayerMappableKeySettings")
	}
	static class UGbxEnhancedInputPlayerMappableKeySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxEnhancedInputPlayerMappableKeySettings>();
	}
};
DUMPER7_ASSERTS_UGbxEnhancedInputPlayerMappableKeySettings;

// Class GbxEnhancedInput.GbxEnhancedInputSettings
// 0x0070 (0x00A8 - 0x0038)
class UGbxEnhancedInputSettings final : public UDeveloperSettings
{
public:
	TArray<struct FMappingContextMapEntry>        DefaultMappingContexts;                            // 0x0038(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, struct FMappingContextMapEntry> AdditionalMappingContexts;             // 0x0048(0x0050)(Edit, Config, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UGbxPreSwizzleInputModifiers>> PreSwizzleInputModifiers;             // 0x0098(0x0010)(Edit, ZeroConstructor, Config, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxEnhancedInputSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxEnhancedInputSettings")
	}
	static class UGbxEnhancedInputSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxEnhancedInputSettings>();
	}
};
DUMPER7_ASSERTS_UGbxEnhancedInputSettings;

// Class GbxEnhancedInput.GbxInputTriggerPulse
// 0x0028 (0x0080 - 0x0058)
class UGbxInputTriggerPulse final : public UInputTriggerTimedBase
{
public:
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bTriggerOnStart;                                   // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DelayBeforeInitialPulse;                           // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseDelayBetweenPulses;                            // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PulseDelayAcceleration;                            // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FinalDelayBetweenPulses;                           // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TriggerLimit;                                      // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxInputTriggerPulse")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxInputTriggerPulse")
	}
	static class UGbxInputTriggerPulse* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxInputTriggerPulse>();
	}
};
DUMPER7_ASSERTS_UGbxInputTriggerPulse;

// Class GbxEnhancedInput.GbxEnhancedInputUserSettings
// 0x0000 (0x0120 - 0x0120)
class UGbxEnhancedInputUserSettings : public UEnhancedInputUserSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxEnhancedInputUserSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxEnhancedInputUserSettings")
	}
	static class UGbxEnhancedInputUserSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxEnhancedInputUserSettings>();
	}
};
DUMPER7_ASSERTS_UGbxEnhancedInputUserSettings;

// Class GbxEnhancedInput.GbxEnhancedPlayerInput
// 0x0050 (0x0898 - 0x0848)
class UGbxEnhancedPlayerInput final : public UEnhancedPlayerInput
{
public:
	TMap<struct FKey, struct FGbxPreSwizzleInputModifierList> PreSwizzleInputModifiers;              // 0x0848(0x0050)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void OnControlMappingsRebuilt();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxEnhancedPlayerInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxEnhancedPlayerInput")
	}
	static class UGbxEnhancedPlayerInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxEnhancedPlayerInput>();
	}
};
DUMPER7_ASSERTS_UGbxEnhancedPlayerInput;

// Class GbxEnhancedInput.GbxLiveInputModifier
// 0x0000 (0x0000 - 0x0000)
class IGbxLiveInputModifier final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxLiveInputModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxLiveInputModifier")
	}
	static class IGbxLiveInputModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxLiveInputModifier>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxLiveInputModifier;

}

