#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxElasticTelemetry

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GbxElasticTelemetry.GbxElasticTelemetryBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UGbxElasticTelemetryBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AreTelemetryRequestsPending();
	static bool GetTelemetryContextProperty(const class FString& Name_0, class FString* Value);
	static void SetTelemetryContextPropertyFloat(const class FString& Name_0, float Value);
	static void SetTelemetryContextPropertyInt(const class FString& Name_0, int32 Value);
	static void SetTelemetryContextPropertyRotator(const class FString& Name_0, const struct FRotator& Value);
	static void SetTelemetryContextPropertyString(const class FString& Name_0, const class FString& Value);
	static void SetTelemetryContextPropertyVector(const class FString& Name_0, const struct FVector& Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxElasticTelemetryBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxElasticTelemetryBlueprintLibrary")
	}
	static class UGbxElasticTelemetryBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxElasticTelemetryBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UGbxElasticTelemetryBlueprintLibrary;

// Class GbxElasticTelemetry.GbxElasticTelemetrySettings
// 0x0050 (0x0088 - 0x0038)
class UGbxElasticTelemetrySettings final : public UDeveloperSettings
{
public:
	class FString                                 ElasticIndexDocumentURL;                           // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ElasticIndexSearchURL;                             // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ElasticBulkURL;                                    // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxBulkRequestCount;                               // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxBulkRequestSizeBytes;                           // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FlushBulkRequestsTime;                             // 0x0070(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ElasticAPIKeyEncrypted;                            // 0x0078(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxElasticTelemetrySettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxElasticTelemetrySettings")
	}
	static class UGbxElasticTelemetrySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxElasticTelemetrySettings>();
	}
};
DUMPER7_ASSERTS_UGbxElasticTelemetrySettings;

}

