#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxEngine

#include "Basic.hpp"

#include "GbxEngine_structs.hpp"
#include "GbxCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GbxEngine.GbxActorStateOwner.OnActorStateChangedBP
// 0x0024 (0x0024 - 0x0000)
struct GbxActorStateOwner_OnActorStateChangedBP final
{
public:
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          NewState;                                          // 0x000C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          PreviousState;                                     // 0x0018(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateOwner_OnActorStateChangedBP;

// Function GbxEngine.GbxActorStateBlueprintLibrary.Conv_GbxActorStateMachineKey_Index
// 0x0010 (0x0010 - 0x0000)
struct GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineKey_Index final
{
public:
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineKey_Index;

// Function GbxEngine.GbxActorStateBlueprintLibrary.Conv_GbxActorStateMachineKey_Name
// 0x0014 (0x0014 - 0x0000)
struct GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineKey_Name final
{
public:
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineKey_Name;

// Function GbxEngine.GbxActorStateBlueprintLibrary.Conv_GbxActorStateMachineKey_String
// 0x0020 (0x0020 - 0x0000)
struct GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineKey_String final
{
public:
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineKey_String;

// Function GbxEngine.GbxActorStateBlueprintLibrary.Conv_GbxActorStateMachineStateKey_Bool
// 0x0010 (0x0010 - 0x0000)
struct GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineStateKey_Bool final
{
public:
	struct FGbxActorStateMachineStateKey          State;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineStateKey_Bool;

// Function GbxEngine.GbxActorStateBlueprintLibrary.Conv_GbxActorStateMachineStateKey_Index
// 0x0010 (0x0010 - 0x0000)
struct GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineStateKey_Index final
{
public:
	struct FGbxActorStateMachineStateKey          State;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineStateKey_Index;

// Function GbxEngine.GbxActorStateBlueprintLibrary.Conv_GbxActorStateMachineStateKey_Name
// 0x0014 (0x0014 - 0x0000)
struct GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineStateKey_Name final
{
public:
	struct FGbxActorStateMachineStateKey          State;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x000C(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineStateKey_Name;

// Function GbxEngine.GbxActorStateBlueprintLibrary.Conv_GbxActorStateMachineStateKey_String
// 0x0020 (0x0020 - 0x0000)
struct GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineStateKey_String final
{
public:
	struct FGbxActorStateMachineStateKey          State;                                             // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_Conv_GbxActorStateMachineStateKey_String;

// Function GbxEngine.GbxActorStateBlueprintLibrary.Conv_Name_GbxActorStateMachineKey
// 0x0014 (0x0014 - 0x0000)
struct GbxActorStateBlueprintLibrary_Conv_Name_GbxActorStateMachineKey final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_Conv_Name_GbxActorStateMachineKey;

// Function GbxEngine.GbxActorStateBlueprintLibrary.Conv_Name_GbxActorStateMachineStateKey
// 0x0014 (0x0014 - 0x0000)
struct GbxActorStateBlueprintLibrary_Conv_Name_GbxActorStateMachineStateKey final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_Conv_Name_GbxActorStateMachineStateKey;

// Function GbxEngine.GbxActorStateBlueprintLibrary.GetActorState
// 0x0020 (0x0020 - 0x0000)
struct GbxActorStateBlueprintLibrary_GetActorState final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          ReturnValue;                                       // 0x0014(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_GetActorState;

// Function GbxEngine.GbxActorStateBlueprintLibrary.GetActorStateAsBool
// 0x0018 (0x0018 - 0x0000)
struct GbxActorStateBlueprintLibrary_GetActorStateAsBool final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_GetActorStateAsBool;

// Function GbxEngine.GbxActorStateBlueprintLibrary.GetActorStateAsInt
// 0x0018 (0x0018 - 0x0000)
struct GbxActorStateBlueprintLibrary_GetActorStateAsInt final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_GetActorStateAsInt;

// Function GbxEngine.GbxActorStateBlueprintLibrary.GetActorStateMachines
// 0x0018 (0x0018 - 0x0000)
struct GbxActorStateBlueprintLibrary_GetActorStateMachines final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGbxActorStateMachineKey>       ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_GetActorStateMachines;

// Function GbxEngine.GbxActorStateBlueprintLibrary.GetActorStateMachineStates
// 0x0028 (0x0028 - 0x0000)
struct GbxActorStateBlueprintLibrary_GetActorStateMachineStates final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActorStateMachineStateKey>  ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_GetActorStateMachineStates;

// Function GbxEngine.GbxActorStateBlueprintLibrary.GetActorStateValue
// 0x0020 (0x0020 - 0x0000)
struct GbxActorStateBlueprintLibrary_GetActorStateValue final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateName;                                         // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0014(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_GetActorStateValue;

// Function GbxEngine.GbxActorStateBlueprintLibrary.GetTimeSinceStateChanged
// 0x0018 (0x0018 - 0x0000)
struct GbxActorStateBlueprintLibrary_GetTimeSinceStateChanged final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_GetTimeSinceStateChanged;

// Function GbxEngine.GbxActorStateBlueprintLibrary.IsInActorState
// 0x0028 (0x0028 - 0x0000)
struct GbxActorStateBlueprintLibrary_IsInActorState final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          State;                                             // 0x0014(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_IsInActorState;

// Function GbxEngine.GbxActorStateBlueprintLibrary.SetActorState
// 0x0028 (0x0028 - 0x0000)
struct GbxActorStateBlueprintLibrary_SetActorState final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          State;                                             // 0x0014(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_SetActorState;

// Function GbxEngine.GbxActorStateBlueprintLibrary.SetActorStateAsBool
// 0x0018 (0x0018 - 0x0000)
struct GbxActorStateBlueprintLibrary_SetActorStateAsBool final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          State;                                             // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_SetActorStateAsBool;

// Function GbxEngine.GbxActorStateBlueprintLibrary.SetActorStateDefaultOverride
// 0x0020 (0x0020 - 0x0000)
struct GbxActorStateBlueprintLibrary_SetActorStateDefaultOverride final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          State;                                             // 0x0014(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_SetActorStateDefaultOverride;

// Function GbxEngine.GbxActorStateBlueprintLibrary.SetActorStateValue
// 0x0028 (0x0028 - 0x0000)
struct GbxActorStateBlueprintLibrary_SetActorStateValue final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateName;                                         // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          StateValue;                                        // 0x0014(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_SetActorStateValue;

// Function GbxEngine.GbxActorStateBlueprintLibrary.SetNextActorState
// 0x0020 (0x0020 - 0x0000)
struct GbxActorStateBlueprintLibrary_SetNextActorState final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          ReturnValue;                                       // 0x0014(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_SetNextActorState;

// Function GbxEngine.GbxActorStateBlueprintLibrary.ToggleActorState
// 0x0018 (0x0018 - 0x0000)
struct GbxActorStateBlueprintLibrary_ToggleActorState final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorStateBlueprintLibrary_ToggleActorState;

// Function GbxEngine.GbxAssetManagerBlueprintFunctionLibrary.PurgeWeakAssetCacheForOwningLevel
// 0x0008 (0x0008 - 0x0000)
struct GbxAssetManagerBlueprintFunctionLibrary_PurgeWeakAssetCacheForOwningLevel final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAssetManagerBlueprintFunctionLibrary_PurgeWeakAssetCacheForOwningLevel;

// Function GbxEngine.GbxAttributeBlueprintLibrary.AddModifierToGbxAttribute
// 0x0040 (0x0040 - 0x0000)
struct GbxAttributeBlueprintLibrary_AddModifierToGbxAttribute final
{
public:
	FGbxDefPtrProperty_                           attribute;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAttributeModifierType                     ModifierType;                                      // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         modifiervalue;                                     // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoRefresh;                                      // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAttributeModifierActionExecOutput         ModifierActionResult;                              // 0x0029(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeModifierHandle            ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_AddModifierToGbxAttribute;

// Function GbxEngine.GbxAttributeBlueprintLibrary.BindEventToOnAttributeChanged
// 0x0078 (0x0078 - 0x0000)
struct GbxAttributeBlueprintLibrary_BindEventToOnAttributeChanged final
{
public:
	class FName                                   AttributeDef;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(float OldValue, float NewValue)> Delegate;                                        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeDelegateBindingHandle     ReturnValue;                                       // 0x0020(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_BindEventToOnAttributeChanged;

// Function GbxEngine.GbxAttributeBlueprintLibrary.BindEventToOnFloatAttributeChanged
// 0x001C (0x001C - 0x0000)
struct GbxAttributeBlueprintLibrary_BindEventToOnFloatAttributeChanged final
{
public:
	struct FGbxAttributeFloat                     attribute;                                         // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(float OldValue, float NewValue)> Delegate;                                        // 0x000C(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_BindEventToOnFloatAttributeChanged;

// Function GbxEngine.GbxAttributeBlueprintLibrary.BindEventToOnIntegerAttributeChanged
// 0x001C (0x001C - 0x0000)
struct GbxAttributeBlueprintLibrary_BindEventToOnIntegerAttributeChanged final
{
public:
	struct FGbxAttributeInteger                   attribute;                                         // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(float OldValue, float NewValue)> Delegate;                                        // 0x000C(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_BindEventToOnIntegerAttributeChanged;

// Function GbxEngine.GbxAttributeBlueprintLibrary.BreakGbxAttributeFloat
// 0x0014 (0x0014 - 0x0000)
struct GbxAttributeBlueprintLibrary_BreakGbxAttributeFloat final
{
public:
	struct FGbxAttributeFloat                     attribute;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BaseValue;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_BreakGbxAttributeFloat;

// Function GbxEngine.GbxAttributeBlueprintLibrary.BreakGbxAttributeInteger
// 0x0014 (0x0014 - 0x0000)
struct GbxAttributeBlueprintLibrary_BreakGbxAttributeInteger final
{
public:
	struct FGbxAttributeInteger                   attribute;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BaseValue;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_BreakGbxAttributeInteger;

// Function GbxEngine.GbxAttributeBlueprintLibrary.Conv_GbxAttributeFloatToFloat
// 0x0010 (0x0010 - 0x0000)
struct GbxAttributeBlueprintLibrary_Conv_GbxAttributeFloatToFloat final
{
public:
	struct FGbxAttributeFloat                     attribute;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_Conv_GbxAttributeFloatToFloat;

// Function GbxEngine.GbxAttributeBlueprintLibrary.Conv_GbxAttributeFloatToString
// 0x0020 (0x0020 - 0x0000)
struct GbxAttributeBlueprintLibrary_Conv_GbxAttributeFloatToString final
{
public:
	struct FGbxAttributeFloat                     attribute;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_Conv_GbxAttributeFloatToString;

// Function GbxEngine.GbxAttributeBlueprintLibrary.Conv_GbxAttributeIntegerToInteger
// 0x0010 (0x0010 - 0x0000)
struct GbxAttributeBlueprintLibrary_Conv_GbxAttributeIntegerToInteger final
{
public:
	struct FGbxAttributeInteger                   attribute;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_Conv_GbxAttributeIntegerToInteger;

// Function GbxEngine.GbxAttributeBlueprintLibrary.Conv_GbxAttributeIntegerToString
// 0x0020 (0x0020 - 0x0000)
struct GbxAttributeBlueprintLibrary_Conv_GbxAttributeIntegerToString final
{
public:
	struct FGbxAttributeInteger                   attribute;                                         // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_Conv_GbxAttributeIntegerToString;

// Function GbxEngine.GbxAttributeBlueprintLibrary.Conv_GbxAttributeModifierHandleToString
// 0x0020 (0x0020 - 0x0000)
struct GbxAttributeBlueprintLibrary_Conv_GbxAttributeModifierHandleToString final
{
public:
	struct FGbxAttributeModifierHandle            attribute;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_Conv_GbxAttributeModifierHandleToString;

// Function GbxEngine.GbxAttributeBlueprintLibrary.EqualEqual_GbxAttributeFloat
// 0x001C (0x001C - 0x0000)
struct GbxAttributeBlueprintLibrary_EqualEqual_GbxAttributeFloat final
{
public:
	struct FGbxAttributeFloat                     A;                                                 // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                     B;                                                 // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_EqualEqual_GbxAttributeFloat;

// Function GbxEngine.GbxAttributeBlueprintLibrary.EqualEqual_GbxAttributeFloatValue
// 0x0014 (0x0014 - 0x0000)
struct GbxAttributeBlueprintLibrary_EqualEqual_GbxAttributeFloatValue final
{
public:
	struct FGbxAttributeFloat                     A;                                                 // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         B;                                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_EqualEqual_GbxAttributeFloatValue;

// Function GbxEngine.GbxAttributeBlueprintLibrary.EqualEqual_GbxAttributeInteger
// 0x001C (0x001C - 0x0000)
struct GbxAttributeBlueprintLibrary_EqualEqual_GbxAttributeInteger final
{
public:
	struct FGbxAttributeInteger                   A;                                                 // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGbxAttributeInteger                   B;                                                 // 0x000C(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_EqualEqual_GbxAttributeInteger;

// Function GbxEngine.GbxAttributeBlueprintLibrary.EqualEqual_GbxAttributeIntegerValue
// 0x0014 (0x0014 - 0x0000)
struct GbxAttributeBlueprintLibrary_EqualEqual_GbxAttributeIntegerValue final
{
public:
	struct FGbxAttributeInteger                   A;                                                 // 0x0000(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         B;                                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_EqualEqual_GbxAttributeIntegerValue;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetAttributeAsActor
// 0x0038 (0x0038 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetAttributeAsActor final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     Class_0;                                           // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 DefaultValue;                                      // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetAttributeAsActor;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetAttributeAsBool
// 0x0028 (0x0028 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetAttributeAsBool final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DefaultValue;                                      // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetAttributeAsBool;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetAttributeAsFloat
// 0x0028 (0x0028 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetAttributeAsFloat final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultValue;                                      // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetAttributeAsFloat;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetAttributeAsInt
// 0x0028 (0x0028 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetAttributeAsInt final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultValue;                                      // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetAttributeAsInt;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetAttributeAsNumericRange
// 0x0030 (0x0030 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetAttributeAsNumericRange final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNumericRange                          DefaultValue;                                      // 0x0020(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNumericRange                          ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetAttributeAsNumericRange;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetAttributeAsObject
// 0x0038 (0x0038 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetAttributeAsObject final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 Class_0;                                           // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                DefaultValue;                                      // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetAttributeAsObject;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetAttributeAsRotator
// 0x0050 (0x0050 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetAttributeAsRotator final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               DefaultValue;                                      // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetAttributeAsRotator;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetAttributeAsVector
// 0x0050 (0x0050 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetAttributeAsVector final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                DefaultValue;                                      // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetAttributeAsVector;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetSummary_GbxAttributeInit
// 0x0060 (0x0060 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetSummary_GbxAttributeInit final
{
public:
	struct FGbxAttributeInit                      Init;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetSummary_GbxAttributeInit;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetSummary_GbxWeightedAttributeInit
// 0x00C8 (0x00C8 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetSummary_GbxWeightedAttributeInit final
{
public:
	struct FGbxWeightedAttributeInit              Init;                                              // 0x0000(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x00B8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetSummary_GbxWeightedAttributeInit;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetValueOfAttribute
// 0x0018 (0x0018 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetValueOfAttribute final
{
public:
	class FName                                   AttributeDef;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultValue;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetValueOfAttribute;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetValueOfAttributeAsBoolean
// 0x0018 (0x0018 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetValueOfAttributeAsBoolean final
{
public:
	class FName                                   AttributeDef;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DefaultValue;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetValueOfAttributeAsBoolean;

// Function GbxEngine.GbxAttributeBlueprintLibrary.GetValueOfAttributeAsInteger
// 0x0018 (0x0018 - 0x0000)
struct GbxAttributeBlueprintLibrary_GetValueOfAttributeAsInteger final
{
public:
	class FName                                   AttributeDef;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DefaultValue;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_GetValueOfAttributeAsInteger;

// Function GbxEngine.GbxAttributeBlueprintLibrary.MakeGbxAttributeFloat
// 0x0010 (0x0010 - 0x0000)
struct GbxAttributeBlueprintLibrary_MakeGbxAttributeFloat final
{
public:
	float                                         BaseValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                     ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_MakeGbxAttributeFloat;

// Function GbxEngine.GbxAttributeBlueprintLibrary.MakeGbxAttributeInteger
// 0x0010 (0x0010 - 0x0000)
struct GbxAttributeBlueprintLibrary_MakeGbxAttributeInteger final
{
public:
	int32                                         BaseValue;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeInteger                   ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_MakeGbxAttributeInteger;

// Function GbxEngine.GbxAttributeBlueprintLibrary.RefreshBindingToOnAttributeChangedEvent
// 0x00B8 (0x00B8 - 0x0000)
struct GbxAttributeBlueprintLibrary_RefreshBindingToOnAttributeChangedEvent final
{
public:
	struct FGbxAttributeDelegateBindingHandle     BindingHandle;                                     // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0058(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeDelegateBindingHandle     ReturnValue;                                       // 0x0060(0x0058)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_RefreshBindingToOnAttributeChangedEvent;

// Function GbxEngine.GbxAttributeBlueprintLibrary.RemoveAttributeModifier
// 0x0018 (0x0018 - 0x0000)
struct GbxAttributeBlueprintLibrary_RemoveAttributeModifier final
{
public:
	struct FGbxAttributeModifierHandle            ModifierHandle;                                    // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_RemoveAttributeModifier;

// Function GbxEngine.GbxAttributeBlueprintLibrary.RemoveModifierFromGbxAttribute
// 0x0018 (0x0018 - 0x0000)
struct GbxAttributeBlueprintLibrary_RemoveModifierFromGbxAttribute final
{
public:
	struct FGbxAttributeModifierHandle            ModifierHandle;                                    // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EGbxAttributeModifierActionExecOutput         ModifierActionResult;                              // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_RemoveModifierFromGbxAttribute;

// Function GbxEngine.GbxAttributeBlueprintLibrary.RemoveMultipleAttributeModifiers
// 0x0010 (0x0010 - 0x0000)
struct GbxAttributeBlueprintLibrary_RemoveMultipleAttributeModifiers final
{
public:
	TArray<struct FGbxAttributeModifierHandle>    ModifierHandles;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_RemoveMultipleAttributeModifiers;

// Function GbxEngine.GbxAttributeBlueprintLibrary.ResetAttributeBaseValue
// 0x0020 (0x0020 - 0x0000)
struct GbxAttributeBlueprintLibrary_ResetAttributeBaseValue final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_ResetAttributeBaseValue;

// Function GbxEngine.GbxAttributeBlueprintLibrary.SetAttributeByPercentage
// 0x0040 (0x0040 - 0x0000)
struct GbxAttributeBlueprintLibrary_SetAttributeByPercentage final
{
public:
	class UObject*                                ContextSource;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      attribute;                                         // 0x0008(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      MaxAttribute;                                      // 0x0020(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Percentage;                                        // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPercentage;                                     // 0x003C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_SetAttributeByPercentage;

// Function GbxEngine.GbxAttributeBlueprintLibrary.SetAttributeToActor
// 0x0028 (0x0028 - 0x0000)
struct GbxAttributeBlueprintLibrary_SetAttributeToActor final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Value;                                             // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAttributeBlueprintLibrary_SetAttributeToActor;

// Function GbxEngine.GbxAttributeBlueprintLibrary.SetAttributeToBool
