#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxEngine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxNexus_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum GbxEngine.EGbxAnimationPerformanceFilterType
// NumValues: 0x0003
enum class EGbxAnimationPerformanceFilterType : uint32
{
	ScreenSize                               = 0,
	LOD                                      = 1,
	EGbxAnimationPerformanceFilterType_MAX   = 2,
};

// Enum GbxEngine.EGbxAnimAssetRefType
// NumValues: 0x0003
enum class EGbxAnimAssetRefType : uint32
{
	AnimSetKey                               = 0,
	AnimAssetPtr                             = 1,
	EGbxAnimAssetRefType_MAX                 = 2,
};

// Enum GbxEngine.EGbxAttributeModifierActionExecOutput
// NumValues: 0x0003
enum class EGbxAttributeModifierActionExecOutput : uint8
{
	Success                                  = 0,
	Failure                                  = 1,
	EGbxAttributeModifierActionExecOutput_MAX = 2,
};

// Enum GbxEngine.EGbxAttributeEvaluatorType
// NumValues: 0x0004
enum class EGbxAttributeEvaluatorType : uint8
{
	Attribute_External                       = 0,
	ValueResolver                            = 1,
	Attribute_Inline                         = 2,
	EGbxAttributeEvaluatorType_MAX           = 3,
};

// Enum GbxEngine.EGbxBindSource
// NumValues: 0x0004
enum class EGbxBindSource : uint8
{
	Constant                                 = 0,
	Binding                                  = 1,
	Context                                  = 2,
	EGbxBindSource_MAX                       = 3,
};

// Enum GbxEngine.EGbxPoseOptions
// NumValues: 0x0007
enum class EGbxPoseOptions : uint8
{
	None                                     = 0,
	Translation                              = 1,
	Rotation                                 = 2,
	LinearVelocity                           = 4,
	AngularVelocity                          = 8,
	All                                      = 15,
	EGbxPoseOptions_MAX                      = 16,
};

// Enum GbxEngine.EQueryInterfaceExec
// NumValues: 0x0003
enum class EQueryInterfaceExec : uint8
{
	Success                                  = 0,
	NotFound                                 = 1,
	EQueryInterfaceExec_MAX                  = 2,
};

// Enum GbxEngine.EGbxTestResult
// NumValues: 0x0004
enum class EGbxTestResult : uint8
{
	Running                                  = 0,
	Success                                  = 1,
	Failure                                  = 2,
	EGbxTestResult_MAX                       = 3,
};

// Enum GbxEngine.EAttributeExpressionOperator
// NumValues: 0x0011
enum class EAttributeExpressionOperator : uint8
{
	NOP                                      = 0,
	Pow                                      = 1,
	Mul                                      = 2,
	Div                                      = 3,
	Mod                                      = 4,
	Add                                      = 5,
	Sub                                      = 6,
	Lt                                       = 7,
	LtEq                                     = 8,
	Gt                                       = 9,
	GtEq                                     = 10,
	Equal                                    = 11,
	NotEq                                    = 12,
	And                                      = 13,
	Or                                       = 14,
	UnsupportedOp                            = 15,
	EAttributeExpressionOperator_MAX         = 16,
};

// Enum GbxEngine.EGbxGraphNodeSettingsRefType
// NumValues: 0x0007
enum class EGbxGraphNodeSettingsRefType : uint8
{
	None                                     = 0,
	Child                                    = 1,
	Input                                    = 2,
	Output                                   = 3,
	InputValue                               = 4,
	OutputValue                              = 5,
	EGbxGraphNodeSettingsRefType_MAX         = 6,
};

// Enum GbxEngine.EGbxMovementMode
// NumValues: 0x000E
enum class EGbxMovementMode : uint8
{
	None                                     = 0,
	Walking                                  = 1,
	NavWalking                               = 2,
	Falling                                  = 3,
	Swimming                                 = 4,
	Flying                                   = 5,
	Mantling                                 = 6,
	RootMotion                               = 7,
	Ragdoll                                  = 8,
	Trajectory                               = 9,
	Climbing                                 = 10,
	GbxSwimming                              = 11,
	Grappling                                = 12,
	EGbxMovementMode_MAX                     = 13,
};

// Enum GbxEngine.EParticleParameterType
// NumValues: 0x0006
enum class EParticleParameterType : uint8
{
	Parameter_Int                            = 0,
	Parameter_Float                          = 1,
	Parameter_Vector                         = 2,
	Parameter_LinearColor                    = 3,
	Parameter_Bool                           = 4,
	Parameter_MAX                            = 5,
};

// Enum GbxEngine.EGbxRelativeLocationType
// NumValues: 0x0005
enum class EGbxRelativeLocationType : uint8
{
	ActorLocation                            = 0,
	Socket                                   = 1,
	Feet                                     = 2,
	Eye                                      = 3,
	EGbxRelativeLocationType_MAX             = 4,
};

// Enum GbxEngine.EGbxRelativeRotationType
// NumValues: 0x000C
enum class EGbxRelativeRotationType : uint8
{
	Body                                     = 0,
	Aim                                      = 1,
	Velocity                                 = 2,
	Acceleration                             = 3,
	Random                                   = 4,
	RandomUpwards                            = 5,
	RandomDownwards                          = 6,
	RandomOnHorizontalPlane                  = 7,
	StraightUp                               = 8,
	StraightDown                             = 9,
	Socket                                   = 10,
	EGbxRelativeRotationType_MAX             = 11,
};

// Enum GbxEngine.EGbxRelativeRotationModifier
// NumValues: 0x0005
enum class EGbxRelativeRotationModifier : uint8
{
	None                                     = 0,
	Inverse                                  = 1,
	TwoD                                     = 2,
	Inverse2D                                = 3,
	EGbxRelativeRotationModifier_MAX         = 4,
};

// Enum GbxEngine.EGbxTransformResolverValue
// NumValues: 0x0008
enum class EGbxTransformResolverValue : uint32
{
	Location                                 = 0,
	Rotation                                 = 1,
	Velocity                                 = 2,
	VelocityDirection                        = 3,
	Radius                                   = 4,
	Height                                   = 5,
	HalfHeight                               = 6,
	EGbxTransformResolverValue_MAX           = 7,
};

// Enum GbxEngine.EGbxType
// NumValues: 0x0024
enum class EGbxType : uint8
{
	None                                     = 0,
	Bool                                     = 1,
	Int                                      = 2,
	Float                                    = 3,
	Vector                                   = 4,
	Rotator                                  = 5,
	Object                                   = 6,
	Actor                                    = 7,
	String                                   = 8,
	NavSpot                                  = 9,
	Attribute                                = 10,
	NumericRange                             = 11,
	TargetInfo                               = 12,
	GraphNodeOutput                          = 13,
	SceneComponent                           = 14,
	TrajectoryOptions                        = 15,
	Waypoint                                 = 16,
	GraphParam                               = 17,
	Name                                     = 18,
	WorldStateRegistryActor                  = 19,
	Blackboard                               = 20,
	Double                                   = 21,
	MissionAliasRef                          = 22,
	DataTable                                = 23,
	LinearColor                              = 24,
	HitResult                                = 25,
	ForceSelection                           = 26,
	Text                                     = 27,
	Asset                                    = 28,
	GbxDef                                   = 29,
	WeightedAttributeInit                    = 30,
	FactAddress                              = 31,
	DialogEnumValue                          = 32,
	AttributeEvaluator                       = 33,
	GameplayTag                              = 34,
	MAX                                      = 35,
};

// Enum GbxEngine.EGbxWeightedAttributeInitMode
// NumValues: 0x0003
enum class EGbxWeightedAttributeInitMode : uint8
{
	WeightedValue                            = 0,
	BasePlusWeightedValue                    = 1,
	EGbxWeightedAttributeInitMode_MAX        = 2,
};

// Enum GbxEngine.EGenerateMapYamlBehavior
// NumValues: 0x0004
enum class EGenerateMapYamlBehavior : uint8
{
	AutoDetect                               = 0,
	Always                                   = 1,
	Never                                    = 2,
	EGenerateMapYamlBehavior_MAX             = 3,
};

// Enum GbxEngine.EEnforceWorldPartitionUsageMode
// NumValues: 0x0004
enum class EEnforceWorldPartitionUsageMode : uint32
{
	Disabled                                 = 0,
	Warn                                     = 1,
	Error                                    = 2,
	EEnforceWorldPartitionUsageMode_MAX      = 3,
};

// Enum GbxEngine.ENumericRangeEditMode
// NumValues: 0x0005
enum class ENumericRangeEditMode : uint8
{
	MinMax                                   = 0,
	ValueVariance                            = 1,
	Variance                                 = 2,
	Value                                    = 3,
	ENumericRangeEditMode_MAX                = 4,
};

// ScriptStruct GbxEngine.DeveloperSettingsDef
// 0x0028 (0x0040 - 0x0018)
struct FDeveloperSettingsDef final : public FGbxDef
{
public:
	TSoftClassPtr<class UClass>                   SettingsClass;                                     // 0x0018(0x0028)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FDeveloperSettingsDef;

// ScriptStruct GbxEngine.GbxActorStateMachineKey
// 0x000C (0x000C - 0x0000)
struct FGbxActorStateMachineKey final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxActorStateMachineKey;

// ScriptStruct GbxEngine.GbxActorStateMachineStateKey
// 0x000C (0x000C - 0x0000)
struct FGbxActorStateMachineStateKey final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxActorStateMachineStateKey;

// ScriptStruct GbxEngine.GbxActorStateMachineDefault
// 0x0018 (0x0018 - 0x0000)
struct FGbxActorStateMachineDefault final
{
public:
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          DefaultState;                                      // 0x000C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxActorStateMachineDefault;

// ScriptStruct GbxEngine.GbxActorStateDefaults
// 0x0010 (0x0010 - 0x0000)
struct FGbxActorStateDefaults final
{
public:
	TArray<struct FGbxActorStateMachineDefault>   StateMachines;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxActorStateDefaults;

// ScriptStruct GbxEngine.GbxActorState
// 0x0070 (0x0070 - 0x0000)
struct FGbxActorState final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateDefaults                 StateMachineDefaults;                              // 0x0020(0x0010)(Edit, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGbxActorStateMachineKey& StateMachine, const struct FGbxActorStateMachineStateKey& NewState, const struct FGbxActorStateMachineStateKey& PreviousState)> ChangedEventBP; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x30];                                      // 0x0040(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxActorState;

// ScriptStruct GbxEngine.GbxAttributeEvaluator
// 0x0038 (0x0038 - 0x0000)
struct FGbxAttributeEvaluator final
{
public:
	EGbxAttributeEvaluatorType                    type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxInlineStruct                       InlineStruct;                                      // 0x0008(0x0018)(Edit, NativeAccessSpecifierPrivate)
	FGameDataHandleProperty_                      ExternalAttribute;                                 // 0x0020(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxAttributeEvaluator;

// ScriptStruct GbxEngine.GbxActorStateMachineAspectSettings
// 0x0058 (0x0060 - 0x0008)
struct FGbxActorStateMachineAspectSettings : public FGbxHasStructType
{
public:
	struct FGbxActorStateMachineStateKey          State;                                             // 0x0008(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          FromState;                                         // 0x0014(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFromState;                                     // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeEvaluator                 Condition;                                         // 0x0028(0x0038)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxActorStateMachineAspectSettings;

// ScriptStruct GbxEngine.GbxParam
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FGbxParam
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxParam;

// ScriptStruct GbxEngine.GbxEngineAnimInstanceProxy
// 0x00C0 (0x0970 - 0x08B0)
struct FGbxEngineAnimInstanceProxy : public FAnimInstanceProxy
{
public:
	uint8                                         Pad_8A8[0xA8];                                     // 0x08A8(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxEngineAnimInstance*                 EngineAnimInstance;                                // 0x0950(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_958[0x18];                                     // 0x0958(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxEngineAnimInstanceProxy;

// ScriptStruct GbxEngine.AttributeContextResolver
// 0x0000 (0x0008 - 0x0008)
struct FAttributeContextResolver : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FAttributeContextResolver;

// ScriptStruct GbxEngine.GameStateContextResolver
// 0x0000 (0x0008 - 0x0008)
struct FGameStateContextResolver final : public FAttributeContextResolver
{
};
DUMPER7_ASSERTS_FGameStateContextResolver;

// ScriptStruct GbxEngine.GbxGraphParamOverrides
// 0x0080 (0x0080 - 0x0000)
struct FGbxGraphParamOverrides final
{
public:
	TMap<class FName, struct FGbxParam>           Overrides;                                         // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxGraphParamOverrides;

// ScriptStruct GbxEngine.GbxActorStateSchemaSource
// 0x0050 (0x0050 - 0x0000)
struct FGbxActorStateSchemaSource final
{
public:
	TSoftObjectPtr<class UObject>                 ObjectPtr;                                         // 0x0000(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           NexusDefPtr;                                       // 0x0028(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxActorStateSchemaSource;

// ScriptStruct GbxEngine.GbxActorStateMachineSchema
// 0x0090 (0x0090 - 0x0000)
struct FGbxActorStateMachineSchema final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           States;                                            // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          DefaultState;                                      // 0x0018(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorStateSchemaSource             Source;                                            // 0x0028(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FGbxInlineStruct>               Aspects;                                           // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsBool;                                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxActorStateMachineSchema;

// ScriptStruct GbxEngine.AttributeValueResolver
// 0x0000 (0x0008 - 0x0008)
struct FAttributeValueResolver : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FAttributeValueResolver;

// ScriptStruct GbxEngine.GbxConditionValueResolver
// 0x0008 (0x0010 - 0x0008)
struct FGbxConditionValueResolver : public FAttributeValueResolver
{
public:
	bool                                          bInvert;                                           // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxConditionValueResolver;

// ScriptStruct GbxEngine.GbxAnimSetPickerExBase
// 0x0000 (0x0008 - 0x0008)
struct FGbxAnimSetPickerExBase : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FGbxAnimSetPickerExBase;

// ScriptStruct GbxEngine.GbxUEDataTableRowHandle
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FGbxUEDataTableRowHandle final
{
public:
	FGameDataHandleProperty_                      DataTable;                                         // 0x0000(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RowName;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUEDataTableRowHandle;

// ScriptStruct GbxEngine.GbxBlackboardEntryRef
// 0x000C (0x000C - 0x0000)
struct FGbxBlackboardEntryRef final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x4];                                        // 0x0008(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBlackboardEntryRef;

// ScriptStruct GbxEngine.GbxActorStateSchema
// 0x0080 (0x0088 - 0x0008)
struct FGbxActorStateSchema final : public FGbxHasStructType
{
public:
	uint8                                         Pad_8[0x70];                                       // 0x0008(0x0070)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxActorStateMachineSchema>    StateMachines;                                     // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxActorStateSchema;

// ScriptStruct GbxEngine.GbxAttributeDefinedContextResolver
// 0x0018 (0x0020 - 0x0008)
struct FGbxAttributeDefinedContextResolver final : public FAttributeContextResolver
{
public:
	FGameDataHandleProperty_                      ContextAttribute;                                  // 0x0008(0x0018)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FGbxAttributeDefinedContextResolver;

// ScriptStruct GbxEngine.NumericRange
// 0x0008 (0x0008 - 0x0000)
struct FNumericRange final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Variance;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNumericRange;

// ScriptStruct GbxEngine.DataTableValueHandle
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FDataTableValueHandle final
{
public:
	FGbxDefPtrProperty_                           DataTable;                                         // 0x0000(0x0018)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   RowName;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   ColumnName;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FDataTableValueHandle;

// ScriptStruct GbxEngine.GbxAttributeInit
// 0x0050 (0x0050 - 0x0000)
struct FGbxAttributeInit final
{
public:
	float                                         constant;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableValueHandle                  DataTableValue;                                    // 0x0008(0x0028)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      attribute;                                         // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PostScale;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAttributeInit;

// ScriptStruct GbxEngine.GbxAttributeDef
// 0x0030 (0x0048 - 0x0018)
struct FGbxAttributeDef final : public FGbxDef
{
public:
	struct FGbxInlineStruct                       Context;                                           // 0x0018(0x0018)(Edit, NativeAccessSpecifierPrivate)
	struct FGbxInlineStruct                       Value;                                             // 0x0030(0x0018)(Edit, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxAttributeDef;

// ScriptStruct GbxEngine.GbxParticleParameter
// 0x0058 (0x0058 - 0x0000)
struct FGbxParticleParameter final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EParticleParameterType                        type;                                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BoolParameter;                                     // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntParameter;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatParameter;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VectorParameter;                                   // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ColorParameter;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           Condition;                                         // 0x0040(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxParticleParameter;

// ScriptStruct GbxEngine.GbxCondition_MeshViewFlag
// 0x0008 (0x0018 - 0x0010)
struct FGbxCondition_MeshViewFlag final : public FGbxConditionValueResolver
{
public:
	EGbxViewFlag                                  type;                                              // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxCondition_MeshViewFlag;

// ScriptStruct GbxEngine.GbxUEDataTableDef
// 0x0088 (0x00A0 - 0x0018)
struct FGbxUEDataTableDef final : public FGbxDef
{
public:
	TSoftObjectPtr<class UScriptStruct>           RowStructPath;                                     // 0x0018(0x0028)(Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x60];                                      // 0x0040(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUEDataTableDef;

// ScriptStruct GbxEngine.GbxEasingFunc
// 0x000C (0x000C - 0x0000)
struct FGbxEasingFunc final
{
public:
	EEasingFunc                                   func;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         steps;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxEasingFunc;

// ScriptStruct GbxEngine.GbxSelectorValueResolver
// 0x0010 (0x0018 - 0x0008)
struct FGbxSelectorValueResolver final : public FAttributeValueResolver
{
public:
	TArray<FGbxDefPtrProperty_>                   Attributes;                                        // 0x0008(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FGbxSelectorValueResolver;

// ScriptStruct GbxEngine.GbxAnimSetValue
// 0x0038 (0x0038 - 0x0000)
struct FGbxAnimSetValue final
{
public:
	TSoftObjectPtr<class UAnimationAsset>         Asset;                                             // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHardRef;                                       // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimationAsset*                        HardRef;                                           // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxAnimSetValue;

// ScriptStruct GbxEngine.GbxRelativeRotation
// 0x0030 (0x0030 - 0x0000)
struct FGbxRelativeRotation final
{
public:
	EGbxRelativeRotationType                      type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxRelativeRotationModifier                  Modifier;                                          // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Offset;                                            // 0x0008(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ConeAroundDirection;                               // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   socket;                                            // 0x0024(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxRelativeRotation;

// ScriptStruct GbxEngine.AnimNodeDirectionState
// 0x0001 (0x0001 - 0x0000)
struct FAnimNodeDirectionState final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimNodeDirectionState;

// ScriptStruct GbxEngine.GbxAnimSetProxyState
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FGbxAnimSetProxyState final
{
public:
	uint8                                         Pad_0[0x60];                                       // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAnimSetProxyState;

// ScriptStruct GbxEngine.GbxGraphState
// 0x0128 (0x0130 - 0x0008)
struct FGbxGraphState : public FGbxHasStructType
{
public:
	uint8                                         Pad_8[0x128];                                      // 0x0008(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxGraphState;

// ScriptStruct GbxEngine.GbxRelativeLocation
// 0x0060 (0x0060 - 0x0000)
struct FGbxRelativeLocation final
{
public:
	EGbxRelativeLocationType                      type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   socket;                                            // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxRelativeRotation                   OffsetDirection;                                   // 0x0010(0x0030)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         OffsetDistance;                                    // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OffsetVector;                                      // 0x0048(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxRelativeLocation;

// ScriptStruct GbxEngine.GbxBlackboard
// 0x0960 (0x0960 - 0x0000)
struct FGbxBlackboard final
{
public:
	uint8                                         Pad_0[0x928];                                      // 0x0000(0x0928)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FGbxBlackboardEntryRef& Entry)> ValueChangedEventBP;  // 0x0928(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_938[0x28];                                     // 0x0938(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBlackboard;

// ScriptStruct GbxEngine.GbxAnimPoseRef
// 0x0010 (0x0010 - 0x0000)
struct FGbxAnimPoseRef final
{
public:
	class UAnimSequence*                          Anim;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         time;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAnimPoseRef;

// ScriptStruct GbxEngine.GbxBlackboardExtensionSet
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FGbxBlackboardExtensionSet final
{
public:
	uint8                                         Pad_0[0x4];                                        // 0x0000(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBlackboardExtensionSet;

// ScriptStruct GbxEngine.GbxBlackboardEntryDefault
// 0x0020 (0x0058 - 0x0038)
struct FGbxBlackboardEntryDefault final : public FGbxParam
{
public:
	class FName                                   Name;                                              // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxBlackboardExtensionSet             EnabledExtensions;                                 // 0x0050(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bReplicateToClients;                               // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInherited;                                        // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBlackboardEntryDefault;

// ScriptStruct GbxEngine.GbxBlackboardDefaults
// 0x0018 (0x0018 - 0x0000)
struct FGbxBlackboardDefaults final
{
public:
	TArray<struct FGbxBlackboardEntryDefault>     Entries;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x8];                                       // 0x0010(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBlackboardDefaults;

// ScriptStruct GbxEngine.GbxAnimSetPair
// 0x0010 (0x0010 - 0x0000)
struct FGbxAnimSetPair final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxAnimSet*                            AnimSet;                                           // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxAnimSetPair;

// ScriptStruct GbxEngine.AnimInstanceContextResolver
// 0x0000 (0x0008 - 0x0008)
struct FAnimInstanceContextResolver : public FAttributeContextResolver
{
};
DUMPER7_ASSERTS_FAnimInstanceContextResolver;

// ScriptStruct GbxEngine.ActorRootComponentContextResolver
// 0x0000 (0x0008 - 0x0008)
struct FActorRootComponentContextResolver final : public FAttributeContextResolver
{
};
DUMPER7_ASSERTS_FActorRootComponentContextResolver;

// ScriptStruct GbxEngine.AttributePropertyValueResolverTestStruct
// 0x0080 (0x0080 - 0x0000)
struct FAttributePropertyValueResolverTestStruct final
{
public:
	float                                         FloatProp;                                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                     AttributeFloatProp;                                // 0x0004(0x000C)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         FloatPropStaticArray[0x3];                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 FloatPropDynamicArray;                             // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxAttributeFloat>             AttributeFloatPropDynamicArray;                    // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        VectorPropDynamicArray;                            // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UAttributePropertyValueResolverTestContext* ObjectProp;                                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAttributePropertyValueResolverTestContext* ObjectPropStaticArray[0x3];                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAttributePropertyValueResolverTestContext*> ObjectPropDynamicArray;                // 0x0070(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAttributePropertyValueResolverTestStruct;

// ScriptStruct GbxEngine.GbxDef_GbxDefPtrEngineTest_StructRefs
// 0x0048 (0x0050 - 0x0008)
struct FGbxDef_GbxDefPtrEngineTest_StructRefs final : public FGbxHasStructType
{
public:
	FGbxDefPtrProperty_                           GenericRef;                                        // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           SameFileFwdRef;                                    // 0x0020(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           ForeignFwdRef;                                     // 0x0038(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxDef_GbxDefPtrEngineTest_StructRefs;

// ScriptStruct GbxEngine.GbxBaseMapAutoSaveData
// 0x0000 (0x0008 - 0x0008)
struct FGbxBaseMapAutoSaveData : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FGbxBaseMapAutoSaveData;

// ScriptStruct GbxEngine.DefSelectorBaseDef
// 0x0010 (0x0028 - 0x0018)
struct FDefSelectorBaseDef : public FGbxDef
{
public:
	uint8                                         Pad_18[0x4];                                       // 0x0018(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DefaultState;                                      // 0x001C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFallbackToSelf;                                   // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDefSelectorBaseDef;

// ScriptStruct GbxEngine.GbxAttributeEffect
// 0x0070 (0x0070 - 0x0000)
struct FGbxAttributeEffect final
{
public:
	FGameDataHandleProperty_                      AttributeToModify;                                 // 0x0000(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAttributeModifierType                     ModifierType;                                      // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      modifiervalue;                                     // 0x0020(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxAttributeEffect;

// ScriptStruct GbxEngine.GbxManagerTickFunction
// 0x0010 (0x0038 - 0x0028)
struct FGbxManagerTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxManagerTickFunction;

// ScriptStruct GbxEngine.GbxBindingList
// 0x01D0 (0x01D0 - 0x0000)
struct FGbxBindingList final
{
public:
	TMap<class FName, struct FGbxParam>           params;                                            // 0x0000(0x0050)(Edit, EditFixedSize, NativeAccessSpecifierPublic)
	TMap<class FName, struct FGbxParam>           Defaults;                                          // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0x130];                                     // 0x00A0(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBindingList;

// ScriptStruct GbxEngine.ContextResolverChain
// 0x0010 (0x0018 - 0x0008)
struct FContextResolverChain final : public FAttributeContextResolver
{
public:
	TArray<struct FGbxInlineStruct>               Chain;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FContextResolverChain;

// ScriptStruct GbxEngine.GbxAnimSetState
// 0x0178 (0x0178 - 0x0000)
struct FGbxAnimSetState final
{
public:
	TArray<struct FGbxAnimSetPair>                AlwaysLoadedAnimSets;                              // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UGbxAnimSetPickerBase*>          AnimSetPickers;                                    // 0x0010(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20[0x60];                                      // 0x0020(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGbxAnimSet*>                    TransientAnimSets;                                 // 0x0080(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGbxAnimSet*>                    CalculatedAnimSets;                                // 0x00B0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UGbxAnimSet*>                    CalculatedProviderAnimSets;                        // 0x00C0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<struct FGameplayTag, struct FGbxAnimSetValue> AnimSetDictionary;                            // 0x00D0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_120[0x58];                                     // 0x0120(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAnimSetState;

// ScriptStruct GbxEngine.ActorContextResolver
// 0x0000 (0x0008 - 0x0008)
struct FActorContextResolver final : public FAttributeContextResolver
{
};
DUMPER7_ASSERTS_FActorContextResolver;

// ScriptStruct GbxEngine.AttributeDefinedValueRow
// 0x0000 (0x0008 - 0x0008)
struct FAttributeDefinedValueRow : public FTableRowBase
{
};
DUMPER7_ASSERTS_FAttributeDefinedValueRow;

// ScriptStruct GbxEngine.CharacterAnimInstanceContextResolver
// 0x0000 (0x0008 - 0x0008)
struct FCharacterAnimInstanceContextResolver final : public FAnimInstanceContextResolver
{
};
DUMPER7_ASSERTS_FCharacterAnimInstanceContextResolver;

// ScriptStruct GbxEngine.GbxActorStateMachine
// 0x0088 (0x0088 - 0x0000)
struct alignas(0x08) FGbxActorStateMachine final
{
public:
	uint8                                         Pad_0[0x88];                                       // 0x0000(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxActorStateMachine;

// ScriptStruct GbxEngine.GbxActorStateMachineAspect
// 0x0048 (0x0050 - 0x0008)
struct FGbxActorStateMachineAspect : public FGbxHasStructType
{
public:
	uint8                                         Pad_8[0x48];                                       // 0x0008(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxActorStateMachineAspect;

// ScriptStruct GbxEngine.GbxActorStateMachineAspectSettings_SetState
// 0x0018 (0x0078 - 0x0060)
struct FGbxActorStateMachineAspectSettings_SetState final : public FGbxActorStateMachineAspectSettings
{
public:
	struct FGbxActorStateMachineKey               StateMachineToSet;                                 // 0x0060(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineStateKey          StateToSet;                                        // 0x006C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxActorStateMachineAspectSettings_SetState;

// ScriptStruct GbxEngine.GbxActorStateMachineAspect_SetState
// 0x0000 (0x0050 - 0x0050)
struct FGbxActorStateMachineAspect_SetState final : public FGbxActorStateMachineAspect
{
};
DUMPER7_ASSERTS_FGbxActorStateMachineAspect_SetState;

// ScriptStruct GbxEngine.GbxActorStateMachineSchemaRef
// 0x0060 (0x0060 - 0x0000)
struct FGbxActorStateMachineSchemaRef final
{
public:
	struct FGbxActorStateSchemaSource             Source;                                            // 0x0000(0x0050)(NativeAccessSpecifierPublic)
	struct FGbxActorStateMachineKey               Key;                                               // 0x0050(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxActorStateMachineSchemaRef;

// ScriptStruct GbxEngine.GbxActorStateValueResolver
// 0x0018 (0x0028 - 0x0010)
struct FGbxActorStateValueResolver final : public FGbxConditionValueResolver
{
public:
	struct FGbxActorStateMachineKey               StateMachine;                                      // 0x0010(0x000C)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGbxActorStateMachineStateKey          State;                                             // 0x001C(0x000C)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
DUMPER7_ASSERTS_FGbxActorStateValueResolver;

// ScriptStruct GbxEngine.GbxAnimAssetRef
// 0x0018 (0x0018 - 0x0000)
struct FGbxAnimAssetRef
{
public:
	struct FGameplayTag                           AnimSetKey;                                        // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                        Asset;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAnimAssetRefType                          type;                                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAnimAssetRef;

// ScriptStruct GbxEngine.GbxAnimSeqRef
// 0x0000 (0x0018 - 0x0018)
struct FGbxAnimSeqRef final : public FGbxAnimAssetRef
{
};
DUMPER7_ASSERTS_FGbxAnimSeqRef;

// ScriptStruct GbxEngine.GbxAnimationPerformanceFeatureData
// 0x0020 (0x0020 - 0x0000)
struct FGbxAnimationPerformanceFeatureData final
{
public:
	TArray<TSoftObjectPtr<class UScriptStruct>>   NodeTypes;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	EGbxAnimationPerformanceFilterType            FilterType;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisabledScreenSizeSquared;                         // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Hysteresis;                                        // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODThreshold;                                      // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxAnimationPerformanceFeatureData;

// ScriptStruct GbxEngine.GbxAnimationPerformanceGlobals
// 0x0018 (0x0038 - 0x0020)
struct FGbxAnimationPerformanceGlobals final : public FGbxGlobalDef
{
public:
	TArray<struct FGbxAnimationPerformanceFeatureData> FeatureSettings;                              // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        TickBudget;                                        // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RelevancyDistance;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxAnimationPerformanceGlobals;

// ScriptStruct GbxEngine.GbxAnimFrame
// 0x0010 (0x0010 - 0x0000)
struct FGbxAnimFrame
{
public:
	class UAnimSequence*                          Anim;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         FrameIdx;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAnimFrame;

// ScriptStruct GbxEngine.GbxAnimLoader
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FGbxAnimLoader final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAnimLoader;

// ScriptStruct GbxEngine.GbxAnimNode_Insertion
// 0x0028 (0x0038 - 0x0010)
struct FGbxAnimNode_Insertion final : public FAnimNode_Base
{
public:
	struct FGameplayTag                           label;                                             // 0x0010(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FComponentSpacePoseLink                ComponentPose;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAnimNode_Insertion;

// ScriptStruct GbxEngine.GbxAnimSetPreview
// 0x0001 (0x0001 - 0x0000)
struct FGbxAnimSetPreview final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAnimSetPreview;

// ScriptStruct GbxEngine.DefSelectorStateBaseDef
// 0x0010 (0x0028 - 0x0018)
struct FDefSelectorStateBaseDef : public FGbxDef
{
public:
	uint8                                         Pad_18[0x4];                                       // 0x0018(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   State;                                             // 0x001C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDefSelectorStateBaseDef;

// ScriptStruct GbxEngine.GbxAttributeDelegateBindingHandle
// 0x0058 (0x0058 - 0x0000)
struct alignas(0x08) FGbxAttributeDelegateBindingHandle final
{
public:
	uint8                                         Pad_0[0x58];                                       // 0x0000(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAttributeDelegateBindingHandle;

// ScriptStruct GbxEngine.GbxAttributeGameDataCategories_DONTUSE
// 0x0001 (0x0001 - 0x0000)
struct FGbxAttributeGameDataCategories_DONTUSE final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxAttributeGameDataCategories_DONTUSE;

// ScriptStruct GbxEngine.GbxAttributeModifierHandle
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FGbxAttributeModifierHandle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
