#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxFaceFX

#include "Basic.hpp"

#include "GbxAudio_structs.hpp"


namespace SDK::Params
{

// Function GbxFaceFX.FaceFXOwner.PlayFaceFXAnim
// 0x0008 (0x0008 - 0x0000)
struct FaceFXOwner_PlayFaceFXAnim final
{
public:
	class UFaceFXAnim*                            FaceFXAnim;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FaceFXOwner_PlayFaceFXAnim;

// Function GbxFaceFX.FaceFXOwner.PlayFaceFXAnimById
// 0x0048 (0x0048 - 0x0000)
struct FaceFXOwner_PlayFaceFXAnimById final
{
public:
	class UFaceFXAnimSet*                         FaceFXAnimSet;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Group;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AnimName;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAudioPlaybackInstance              OptionalAudioInstance;                             // 0x0020(0x0018)(Parm, NativeAccessSpecifierPublic)
	const class UObject*                          Caller;                                            // 0x0038(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FaceFXOwner_PlayFaceFXAnimById;

}

