#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxGame

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GbxAI_structs.hpp"
#include "GbxAI_classes.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxEngine_classes.hpp"
#include "GbxAudio_structs.hpp"
#include "GbxAudio_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GbxGame_structs.hpp"
#include "GbxSpawn_structs.hpp"
#include "GbxSpawn_classes.hpp"
#include "AIModule_structs.hpp"
#include "NiagaraAnimNotifies_classes.hpp"
#include "GbxNexus_structs.hpp"
#include "GbxNexus_classes.hpp"
#include "Landscape_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Niagara_classes.hpp"
#include "GbxNav_structs.hpp"
#include "GbxNav_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "GbxCore_structs.hpp"
#include "GbxCore_classes.hpp"
#include "GbxPhysics_structs.hpp"
#include "GbxDestruction_classes.hpp"
#include "CommonUI_classes.hpp"
#include "GbxDynamicWind_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_structs.hpp"
#include "MovieSceneTracks_classes.hpp"


namespace SDK
{

// Class GbxGame.GbxSkillManagedResourceType
// 0x0158 (0x0180 - 0x0028)
class UGbxSkillManagedResourceType : public UObject
{
public:
	uint8                                         Pad_28[0x150];                                     // 0x0028(0x0150)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EventProp;                                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxSkillManagedResourceType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxSkillManagedResourceType")
	}
	static class UGbxSkillManagedResourceType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxSkillManagedResourceType>();
	}
};
DUMPER7_ASSERTS_UGbxSkillManagedResourceType;

// Class GbxGame.GbxActivityAreaStampDrawComponent
// 0x0020 (0x0640 - 0x0620)
class UGbxActivityAreaStampDrawComponent final : public UPrimitiveComponent
{
public:
	TMulticastInlineDelegate<void()>              OnLayoutListUpdated;                               // 0x0620(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	bool                                          bHasLayoutListBeenUpdated;                         // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxActivityAreaStamp*                  OwnerStamp;                                        // 0x0638(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxActivityAreaStampDrawComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxActivityAreaStampDrawComponent")
	}
	static class UGbxActivityAreaStampDrawComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxActivityAreaStampDrawComponent>();
	}
};
DUMPER7_ASSERTS_UGbxActivityAreaStampDrawComponent;

// Class GbxGame.GbxMomentData
// 0x0010 (0x0060 - 0x0050)
class UGbxMomentData final : public UGbxGraphAsset
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FName> GetDialogScriptIdents() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxMomentData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxMomentData")
	}
	static class UGbxMomentData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxMomentData>();
	}
};
DUMPER7_ASSERTS_UGbxMomentData;

// Class GbxGame.projectile
// 0x1190 (0x1520 - 0x0390)
class alignas(0x10) Aprojectile : public AActor
{
public:
	uint8                                         Pad_390[0xB0];                                     // 0x0390(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorData                          GbxActorData;                                      // 0x0440(0x0108)(Net, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_548[0x228];                                    // 0x0548(0x0228)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorScriptOwnerState              ScriptData;                                        // 0x0770(0x0080)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FReplicatedGestaltPartsData            ReplicatedGestaltParts;                            // 0x07F0(0x0020)(Net, Transient, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                         Pad_810[0x10];                                     // 0x0810(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxHealthState                        HealthState;                                       // 0x0820(0x00F8)(Net, Transient, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGbxInlineStruct                       DamageState;                                       // 0x0918(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_930[0x8];                                      // 0x0930(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxTargetableState                    TargetableState;                                   // 0x0938(0x01C8)(Protected, NativeAccessSpecifierProtected)
	struct FGameResourcePoolManager               ResourcePoolManager;                               // 0x0B00(0x0040)(Net, Protected, NativeAccessSpecifierProtected)
	int32                                         gamestage;                                         // 0x0B40(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B44[0x4];                                      // 0x0B44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBalancedActorData                     DamageBalanceData;                                 // 0x0B48(0x0030)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B78[0x10];                                     // 0x0B78(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxTeamState                          TeamState;                                         // 0x0B88(0x0060)(NativeAccessSpecifierPublic)
	uint8                                         Pad_BE8[0x20];                                     // 0x0BE8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxTrickState                         TrickData;                                         // 0x0C08(0x00F0)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_CF8[0x18];                                     // 0x0CF8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FHitResult& Hit)> OnHitWorld;                         // 0x0D10(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FHitResult& Hit)> OnHitDamageable;                    // 0x0D20(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FHitResult& Hit)> OnHitFriendly;                      // 0x0D30(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FHitResult& Hit)> OnHitEnemy;                         // 0x0D40(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FHitResult& Hit)> OnHitNeutral;                       // 0x0D50(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnBeginExplode;                                    // 0x0D60(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* projectile)> OnExplode;                        // 0x0D70(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FProjectileTakingDamageDetails& Details)> OnTakingDamage; // 0x0D80(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* OverlappedActor, const struct FHitResult& Info)> OnBeginOverlapEnemy; // 0x0D90(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* OverlappedActor, const struct FHitResult& Info)> OnBeginOverlapNeutral; // 0x0DA0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* OverlappedActor, const struct FHitResult& Info)> OnBeginOverlapFriendly; // 0x0DB0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* OverlappedActor)> OnEndOverlapEnemy;           // 0x0DC0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* OverlappedActor)> OnEndOverlapNeutral;         // 0x0DD0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* OverlappedActor)> OnEndOverlapFriendly;        // 0x0DE0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class AActor* ViableActor)> OnProximityTrigger;              // 0x0DF0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_E00[0x30];                                     // 0x0E00(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxProjectileMovementComponent*        MovementComponent;                                 // 0x0E30(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         damage;                                            // 0x0E38(0x0004)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         damageradius;                                      // 0x0E3C(0x0004)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ImpactForce;                                       // 0x0E40(0x0004)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint16                                        DamageModifierFlags;                               // 0x0E44(0x0002)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E46[0x12];                                     // 0x0E46(0x0012)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      DamageType;                                        // 0x0E58(0x0018)(BlueprintVisible, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FDamageSourceContainer                 DamageSource;                                      // 0x0E70(0x0040)(BlueprintVisible, Net, Protected, NativeAccessSpecifierProtected)
	struct FDamageTags                            DamageTags;                                        // 0x0EB0(0x0020)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         bDisableDamage : 1;                                // 0x0ED0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_ED0_1 : 1;                                  // 0x0ED0(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bExplodeAfterLifetime : 1;                         // 0x0ED0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bDestroyOnExplode : 1;                             // 0x0ED0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bExplodeOnHitWorld : 1;                            // 0x0ED0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bExplodeOnHitDamageable : 1;                       // 0x0ED0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bExplodeOnHitEnemy : 1;                            // 0x0ED0(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bExplodeOnTakeDamage : 1;                          // 0x0ED0(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_ED1[0x3];                                      // 0x0ED1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         hitcountneeded;                                    // 0x0ED4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bDamageOnExplode : 1;                              // 0x0ED8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPlayExplosionEffectOnExplode : 1;                 // 0x0ED8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bPayloadEffectPostExplosion : 1;                   // 0x0ED8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bProximityTrigger : 1;                             // 0x0ED8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         ProjectileFlags;                                   // 0x0ED9(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EDA[0x2];                                      // 0x0EDA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FuseTime;                                          // 0x0EDC(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EE0[0x28];                                     // 0x0EE0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	struct FImpactEffectSelection                 ExplosionEffect;                                   // 0x0F08(0x0018)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_F20[0x4C];                                     // 0x0F20(0x004C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsHoming;                                         // 0x0F6C(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F6D[0x3];                                      // 0x0F6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProjectileHomingTargetData            HomingTarget;                                      // 0x0F70(0x0038)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class USceneComponent*                        CachedHomingTargetComponent;                       // 0x0FA8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FB0[0x20];                                     // 0x0FB0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         RepAttachedState;                                  // 0x0FD0(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_FD1[0x7];                                      // 0x0FD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EHomingTargetLostReason reason)> HomingTargetLost;                 // 0x0FD8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnHomingTargetReached;                             // 0x0FE8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              OnStopHomingDistanceReached;                       // 0x0FF8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	float                                         HomingTurnSpeedScale;                              // 0x1008(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DrunkenMovementSeed;                               // 0x100C(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FHitResult                             LastImpact;                                        // 0x1010(0x0100)(BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_1110[0x8];                                     // 0x1110(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const class AActor* TargetActor)> AttachedToTarget;                // 0x1118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              DetachedFromTarget;                                // 0x1128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         bAttachOnImpact : 1;                               // 0x1138(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1139[0x7];                                     // 0x1139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SourceActor;                                       // 0x1140(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCollideWithTeamProjectiles;                       // 0x1148(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1149[0x3];                                     // 0x1149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CustomGravityScale;                                // 0x114C(0x0004)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SpawnSpeedScale;                                   // 0x1150(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1154[0x4];                                     // 0x1154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRepProjectileVelocity                 ReplicatedVelocity;                                // 0x1158(0x0020)(Net, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint16                                        RepExploded;                                       // 0x1178(0x0002)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bWaitingToBeDestroyed;                             // 0x117A(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_117B[0x1];                                     // 0x117B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        HitCount;                                          // 0x117C(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_117E[0x2];                                     // 0x117E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     TrailComponent;                                    // 0x1180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFXSystemComponent*                     FuseComponent;                                     // 0x1188(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1190[0x60];                                    // 0x1190(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorState                         ActorState;                                        // 0x11F0(0x0070)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1260[0xC8];                                    // 0x1260(0x00C8)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnThrownEvent;                                     // 0x1328(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnDroppedEvent;                                    // 0x1338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnPrimedEvent;                                     // 0x1348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_1358[0x2];                                     // 0x1358(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bThrown;                                           // 0x135A(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDropped;                                          // 0x135B(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInFlight;                                         // 0x135C(0x0001)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_135D[0x43];                                    // 0x135D(0x0043)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFactsConduit                          FactsConduit;                                      // 0x13A0(0x00D0)(Edit, Net, DisableEditOnTemplate, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         IgnoredActors;                                     // 0x1470(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1480[0x90];                                    // 0x1480(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnDestroyManagedActor;                             // 0x1510(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)

public:
	bool AttachToTarget(const struct FHitResult& target, bool bSnapToTarget, EProjectileDetachAction DetachedAction);
	void CauseDamage();
	void DetachFromTarget(EProjectileDetachAction DetachAction);
	void Explode(uint8 Flags_0);
	void OnAttachedActorDestroyed(class AActor* Actor);
	void OnAttachedDestructibleFractured(bool bMeshSwap);
	void OnHomingTargetDestroyed(class AActor* Actor);
	void OnRep_AttachedState();
	void OnRep_CustomGravityScale();
	void OnRep_DamageModifierFlags();
	void OnRep_Dropped();
	void OnRep_DrunkenMovementSeed();
	void OnRep_Exploded();
	void OnRep_FactsConduit();
	void OnRep_GestaltMeshParts();
	void OnRep_HealthState();
	void OnRep_HomingTarget();
	void OnRep_InFlight();
	void OnRep_IsHoming();
	void OnRep_StartFuse();
	void OnRep_Thrown();
	void OnRep_Velocity();
	void SetCustomGravityScale(float GravityScale);
	void SetDrunkenMovementState(bool bEnabled);
	void SetHoming(bool bHoming);
	void SetHomingTarget(class AActor* Actor, class USceneComponent* Component, class FName socket, const struct FVector& Offset);
	void SetHomingTargetLocation(const struct FVector& Location);
	void SetSpawnSpeedScale(float SpeedScale);
	void SetSpawnVelocity(const struct FVector& InSpawnVelocity);
	void SetupProximityTrigger(const struct FHitResult& HitResult);
	void SetVelocity(const struct FVector& NewVelocity);
	void SimulatePhysics(bool bSimulate);
	void StartFuse(float FuseTime_0);
	void StartSimAudio();
	void StopBlockingPawns();
	void StopSimAudio();
	void ToggleProximityTrigger(const bool bTrigger);

	uint8 GetExplosionFlags() const;
	class FName GetGpsQueryName() const;
	struct FImpactEffectSelection GetHeldImpactEffect() const;
	bool GetImpactedActorHitResult(struct FHitResult* OutResult) const;
	bool HasDamageModifierFlag(EDamageModifierFlag Flag) const;
	bool HasExploded() const;
	bool IsHeld() const;
	bool IsInFlight() const;
	bool ShouldAttachToTarget(class AActor* TargetActor, const struct FProjectileAttachFilterData& AttachTo) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("projectile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"projectile")
	}
	static class Aprojectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<Aprojectile>();
	}
};
DUMPER7_ASSERTS_Aprojectile;

// Class GbxGame.AIHeldProjectile
// 0x0000 (0x1520 - 0x1520)
class AAIHeldProjectile : public Aprojectile
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIHeldProjectile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIHeldProjectile")
	}
	static class AAIHeldProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIHeldProjectile>();
	}
};
DUMPER7_ASSERTS_AAIHeldProjectile;

// Class GbxGame.AIHeldExplosiveProjectile
// 0x0000 (0x1520 - 0x1520)
class AAIHeldExplosiveProjectile final : public AAIHeldProjectile
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIHeldExplosiveProjectile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIHeldExplosiveProjectile")
	}
	static class AAIHeldExplosiveProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIHeldExplosiveProjectile>();
	}
};
DUMPER7_ASSERTS_AAIHeldExplosiveProjectile;

// Class GbxGame.GbxSkillManagedResourceType_Actor
// 0x0008 (0x0188 - 0x0180)
class UGbxSkillManagedResourceType_Actor final : public UGbxSkillManagedResourceType
{
public:
	class AActor*                                 ValueProp;                                         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static void Destroy(class UGbxSkillScript* Context, class AActor* Value);
	static void Register(class UGbxSkillScript* Context, class AActor* Value, class FName Handler, FGbxDefPtrProperty_ Group);
	static void Unregister(class UGbxSkillScript* Context, class AActor* Value, FGbxDefPtrProperty_ Group);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxSkillManagedResourceType_Actor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxSkillManagedResourceType_Actor")
	}
	static class UGbxSkillManagedResourceType_Actor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxSkillManagedResourceType_Actor>();
	}
};
DUMPER7_ASSERTS_UGbxSkillManagedResourceType_Actor;

// Class GbxGame.GbxMomentFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UGbxMomentFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void EndMoment(class UObject* WorldContext, class UGbxMomentData* Moment);
	static void LoadMoment(class UObject* WorldContext, class UGbxMomentData* Moment);
	static void RunMoment(class UObject* WorldContext, class UGbxMomentData* Moment, const TArray<struct FGbxGraphParam>& Parameters, const struct FLatentActionInfo& LatentInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxMomentFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxMomentFunctionLibrary")
	}
	static class UGbxMomentFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxMomentFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UGbxMomentFunctionLibrary;

// Class GbxGame.NexusConfigStoreGbxInputContext
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStoreGbxInputContext final : public UNexusConfigStoreBasic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreGbxInputContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreGbxInputContext")
	}
	static class UNexusConfigStoreGbxInputContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreGbxInputContext>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreGbxInputContext;

// Class GbxGame.NexusConfigStoreActivityRequest
// 0x0000 (0x0380 - 0x0380)
class UNexusConfigStoreActivityRequest final : public UNexusConfigStoreBasicDefFlat
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreActivityRequest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreActivityRequest")
	}
	static class UNexusConfigStoreActivityRequest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreActivityRequest>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreActivityRequest;

// Class GbxGame.GbxAIHeldProjectileComponent
// 0x0040 (0x03F0 - 0x03B0)
class UGbxAIHeldProjectileComponent : public UGbxAIHeldActorComponent
{
public:
	FGameDataHandleProperty_                      ProjDef;                                           // 0x03A8(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           AudioProviderTag;                                  // 0x03C0(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAudioProviderTag;                              // 0x03C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C9[0x27];                                     // 0x03C9(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class Aprojectile* GetHeldProjectile();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxAIHeldProjectileComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxAIHeldProjectileComponent")
	}
	static class UGbxAIHeldProjectileComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxAIHeldProjectileComponent>();
	}
};
DUMPER7_ASSERTS_UGbxAIHeldProjectileComponent;

// Class GbxGame.GbxAIHeldExplosiveComponent
// 0x0000 (0x03F0 - 0x03F0)
class UGbxAIHeldExplosiveComponent final : public UGbxAIHeldProjectileComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxAIHeldExplosiveComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxAIHeldExplosiveComponent")
	}
	static class UGbxAIHeldExplosiveComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxAIHeldExplosiveComponent>();
	}
};
DUMPER7_ASSERTS_UGbxAIHeldExplosiveComponent;

// Class GbxGame.GbxBodyData
// 0x0010 (0x0060 - 0x0050)
class UGbxBodyData : public UGbxGraphAsset
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class FName GetBodySwitchState(class FName Switch, class UObject* OwnerContext, const class FString& Prefix);
	static bool GetBodySwitchStateAsBool(class FName Switch, class UObject* OwnerContext, const class FString& Prefix);
	static void SetBodySwitchState(class FName Switch, class FName State, class UObject* OwnerContext, const class FString& Prefix);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxBodyData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxBodyData")
	}
	static class UGbxBodyData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxBodyData>();
	}
};
DUMPER7_ASSERTS_UGbxBodyData;

// Class GbxGame.InteractiveObjectBodyData
// 0x0000 (0x0060 - 0x0060)
class UInteractiveObjectBodyData : public UGbxBodyData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InteractiveObjectBodyData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InteractiveObjectBodyData")
	}
	static class UInteractiveObjectBodyData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteractiveObjectBodyData>();
	}
};
DUMPER7_ASSERTS_UInteractiveObjectBodyData;

// Class GbxGame.GbxSkillManagedResourceType_ActorComponent
// 0x0008 (0x0188 - 0x0180)
class UGbxSkillManagedResourceType_ActorComponent final : public UGbxSkillManagedResourceType
{
public:
	class UActorComponent*                        ValueProp;                                         // 0x0180(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static void Destroy(class UGbxSkillScript* Context, class UActorComponent* Value);
	static void Register(class UGbxSkillScript* Context, class UActorComponent* Value, class FName Handler, FGbxDefPtrProperty_ Group);
	static void Unregister(class UGbxSkillScript* Context, class UActorComponent* Value, FGbxDefPtrProperty_ Group);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxSkillManagedResourceType_ActorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxSkillManagedResourceType_ActorComponent")
	}
	static class UGbxSkillManagedResourceType_ActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxSkillManagedResourceType_ActorComponent>();
	}
};
DUMPER7_ASSERTS_UGbxSkillManagedResourceType_ActorComponent;

// Class GbxGame.NexusConfigStore_GbxActivityAreaStampGroupLayout
// 0x0000 (0x0380 - 0x0380)
class UNexusConfigStore_GbxActivityAreaStampGroupLayout final : public UNexusConfigStoreBasicDefFlat
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStore_GbxActivityAreaStampGroupLayout")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStore_GbxActivityAreaStampGroupLayout")
	}
	static class UNexusConfigStore_GbxActivityAreaStampGroupLayout* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStore_GbxActivityAreaStampGroupLayout>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStore_GbxActivityAreaStampGroupLayout;

// Class GbxGame.GbxActorScript
// 0x0078 (0x00A0 - 0x0028)
class UGbxActorScript : public UGbxScript
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     AssociatedClass;                                   // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRunConstructionScriptsWhenSpawned;                // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceReenableEnabledEventGraphsOnBeginPlay;       // 0x0041(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_42[0x5E];                                      // 0x0042(0x005E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void StaticGetInterfaceScripts(class UObject* ContextSource, TSubclassOf<class IInterface> InterfaceClass, TArray<class UGbxActorScript*>* Scripts);
	static bool StaticIsScriptStateEnabled(class FName GraphName, class UObject* ContextSource);
	static void StaticSetScriptStateEnabled(class FName GraphName, bool bEnabled, class UObject* ContextSource);

	void OnBeginPlay();
	void OnEndPlay(EEndPlayReason EndPlayReason);
	void OnInit();
	void OnStateDisabled();
	void OnStateEnabled();
	void SetScriptStateEnabled(class FName GraphName, bool bEnabled);

	class AActor* GetAssociatedActor() const;
	TScriptInterface<class IGbxActorScriptInterface> GetOwner() const;
	struct FRandomStream GetStableRandomStream(int32 SeedOffset) const;
	bool HasAuthority() const;
	bool IsScriptStateEnabled(class FName GraphName) const;
	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxActorScript")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxActorScript")
	}
	static class UGbxActorScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxActorScript>();
	}
};
DUMPER7_ASSERTS_UGbxActorScript;

// Class GbxGame.ActivityRequester
// 0x0028 (0x00C8 - 0x00A0)
class UActivityRequester final : public UGbxActorScript
{
public:
	TArray<FGbxDefPtrProperty_>                   ActivityRequestDefs;                               // 0x00A0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      AssociatedRegion;                                  // 0x00B0(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActivityRequester")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivityRequester")
	}
	static class UActivityRequester* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivityRequester>();
	}
};
DUMPER7_ASSERTS_UActivityRequester;

// Class GbxGame.ClimbablePresentationSetAsset
// 0x00C8 (0x00F8 - 0x0030)
class UClimbablePresentationSetAsset final : public UDataAsset
{
public:
	struct FClimbablePresenationSet               PresentationSet;                                   // 0x0030(0x00C8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClimbablePresentationSetAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClimbablePresentationSetAsset")
	}
	static class UClimbablePresentationSetAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClimbablePresentationSetAsset>();
	}
};
DUMPER7_ASSERTS_UClimbablePresentationSetAsset;

// Class GbxGame.GbxGameViewportClient
// 0x0020 (0x0430 - 0x0410)
class UGbxGameViewportClient : public UCommonGameViewportClient
{
public:
	uint8                                         Pad_410[0x20];                                     // 0x0410(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameViewportClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameViewportClient")
	}
	static class UGbxGameViewportClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameViewportClient>();
	}
};
DUMPER7_ASSERTS_UGbxGameViewportClient;

// Class GbxGame.GbxActivityAreaDrawComponent
// 0x0030 (0x0650 - 0x0620)
class UGbxActivityAreaDrawComponent final : public UPrimitiveComponent
{
public:
	uint8                                         Pad_620[0x20];                                     // 0x0620(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxActivityArea*                       OwnerPoA;                                          // 0x0640(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_648[0x8];                                      // 0x0648(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxActivityAreaDrawComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxActivityAreaDrawComponent")
	}
	static class UGbxActivityAreaDrawComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxActivityAreaDrawComponent>();
	}
};
DUMPER7_ASSERTS_UGbxActivityAreaDrawComponent;

// Class GbxGame.GbxOpportunisticAmbientAudioProceduralActor
// 0x0000 (0x0390 - 0x0390)
class AGbxOpportunisticAmbientAudioProceduralActor final : public APartitionActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxOpportunisticAmbientAudioProceduralActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxOpportunisticAmbientAudioProceduralActor")
	}
	static class AGbxOpportunisticAmbientAudioProceduralActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxOpportunisticAmbientAudioProceduralActor>();
	}
};
DUMPER7_ASSERTS_AGbxOpportunisticAmbientAudioProceduralActor;

// Class GbxGame.NexusConfigStoreActivityRequestSettings
// 0x0000 (0x0380 - 0x0380)
class UNexusConfigStoreActivityRequestSettings final : public UNexusConfigStoreBasicDefFlat
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreActivityRequestSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreActivityRequestSettings")
	}
	static class UNexusConfigStoreActivityRequestSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreActivityRequestSettings>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreActivityRequestSettings;

// Class GbxGame.HazardInteractionComponent
// 0x07A0 (0x0A50 - 0x02B0)
class UHazardInteractionComponent final : public USceneComponent
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnabled;                                          // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      Interaction;                                       // 0x02B8(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(FGameDataHandleProperty_ State, bool bIsInitialState)> OnInteractionStarted; // 0x02D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bDamageOverride;                                   // 0x02E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      damage;                                            // 0x02E8(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EHazardPrimitiveCollectionType                DamagePrimitiveType;                               // 0x0338(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DamagePrimitiveNames;                              // 0x0340(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EHazardPrimitiveCollectionType                InteractionPrimitiveType;                          // 0x0350(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           InteractionPrimitiveNames;                         // 0x0358(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           EffectPrimitiveNames;                              // 0x0368(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EHazardEffectSizeSourceType                   EffectSizeSource;                                  // 0x0378(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EffectSizeOverride;                                // 0x037C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHazardInteractionState                HazardInteraction;                                 // 0x0380(0x0658)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FHazardInteractionReplicationState     RepHazardInteractionState;                         // 0x09D8(0x0070)(Net, Transient, RepNotify, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A48[0x8];                                      // 0x0A48(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginInteraction(FGameDataHandleProperty_ NewState, bool bIsSource, float SourceDuration, class AActor* NewInstigator);
	void OnRep_InteractionState();
	void SetDamageInstigator(class AActor* NewInstigator);
	void SetEnabled(bool bNewEnabled);

	bool IsEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HazardInteractionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HazardInteractionComponent")
	}
	static class UHazardInteractionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHazardInteractionComponent>();
	}
};
DUMPER7_ASSERTS_UHazardInteractionComponent;

// Class GbxGame.GbxGameTestActor
// 0x0110 (0x0510 - 0x0400)
class AGbxGameTestActor : public AGbxEngineTestActor
{
public:
	uint8                                         Pad_400[0x38];                                     // 0x0400(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUsableActorState                      UsableActorState;                                  // 0x0438(0x00D0)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class USphereComponent*                       TriggerComponent;                                  // 0x0508(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameTestActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameTestActor")
	}
	static class AGbxGameTestActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxGameTestActor>();
	}
};
DUMPER7_ASSERTS_AGbxGameTestActor;

// Class GbxGame.GbxNavTest_NavMeshPath
// 0x00A0 (0x05B0 - 0x0510)
class AGbxNavTest_NavMeshPath final : public AGbxGameTestActor
{
public:
	class ASpawner*                               Spawner;                                           // 0x0510(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGbxNavTestAgentData>           Agents;                                            // 0x0518(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGbxNavGoalModifiers                   Modifiers;                                         // 0x0528(0x0080)(Edit, NativeAccessSpecifierPrivate)
	class ALevelSequenceActor*                    Sequence;                                          // 0x05A8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void SetGbxActorDef(const FGameDataHandleProperty_& NewGbxActorDef);
	void SetStance(const FGameDataHandleProperty_& NewStance);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNavTest_NavMeshPath")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNavTest_NavMeshPath")
	}
	static class AGbxNavTest_NavMeshPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxNavTest_NavMeshPath>();
	}
};
DUMPER7_ASSERTS_AGbxNavTest_NavMeshPath;

// Class GbxGame.ClimbableBodyData
// 0x0000 (0x0060 - 0x0060)
class UClimbableBodyData final : public UInteractiveObjectBodyData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ClimbableBodyData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ClimbableBodyData")
	}
	static class UClimbableBodyData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClimbableBodyData>();
	}
};
DUMPER7_ASSERTS_UClimbableBodyData;

// Class GbxGame.GbxSequenceDialogTrack
// 0x0018 (0x0110 - 0x00F8)
class UGbxSequenceDialogTrack final : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             sections;                                          // 0x00F8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxSequenceDialogTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxSequenceDialogTrack")
	}
	static class UGbxSequenceDialogTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxSequenceDialogTrack>();
	}
};
DUMPER7_ASSERTS_UGbxSequenceDialogTrack;

// Class GbxGame.GbxWorldAudioSystemBase
// 0x0010 (0x0038 - 0x0028)
class UGbxWorldAudioSystemBase : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxWorldAudioSystemBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxWorldAudioSystemBase")
	}
	static class UGbxWorldAudioSystemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxWorldAudioSystemBase>();
	}
};
DUMPER7_ASSERTS_UGbxWorldAudioSystemBase;

// Class GbxGame.AIHeldMeleeProjectile
// 0x0000 (0x1520 - 0x1520)
class AAIHeldMeleeProjectile final : public AAIHeldProjectile
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIHeldMeleeProjectile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIHeldMeleeProjectile")
	}
	static class AAIHeldMeleeProjectile* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIHeldMeleeProjectile>();
	}
};
DUMPER7_ASSERTS_AAIHeldMeleeProjectile;

// Class GbxGame.GbxGameInstance
// 0x0260 (0x0420 - 0x01C0)
class UGbxGameInstance : public UGameInstance
{
public:
	uint8                                         Pad_1C0[0x20];                                     // 0x01C0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxGameSingletons*                     GameSingletons;                                    // 0x01E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E8[0xF3];                                     // 0x01E8(0x00F3)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSavePlayerProfileOnQuit;                          // 0x02DB(0x0001)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2DC[0xFC];                                     // 0x02DC(0x00FC)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         GlobalInputManagerClass;                           // 0x03D8(0x0020)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGbxGlobalInputManager*                 GlobalInputManager;                                // 0x03F8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_400[0x20];                                     // 0x0400(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameInstance")
	}
	static class UGbxGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameInstance>();
	}
};
DUMPER7_ASSERTS_UGbxGameInstance;

// Class GbxGame.LightProjectile
// 0x0768 (0x0790 - 0x0028)
class ULightProjectile : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SyncID;                                            // 0x0058(0x0004)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x2C];                                      // 0x005C(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         damage;                                            // 0x0088(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         damageradius;                                      // 0x008C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x48];                                      // 0x0090(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ImpactForce;                                       // 0x00D8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DestructibleForce;                                 // 0x00DC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DestructibleStrain;                                // 0x00E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E4[0x34];                                      // 0x00E4(0x0034)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientLightProjectileState            ClientState;                                       // 0x0118(0x0160)(Net, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
