#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxGameSettings

#include "Basic.hpp"

#include "GbxGameSettings_structs.hpp"
#include "Engine_classes.hpp"
#include "GameSettings_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GbxGameSettings.GbxGameSettingCollectionData
// 0x0078 (0x00A8 - 0x0030)
class UGbxGameSettingCollectionData final : public UDataAsset
{
public:
	struct FGbxGameSettingData_Collection         CollectionData;                                    // 0x0030(0x0078)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameSettingCollectionData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameSettingCollectionData")
	}
	static class UGbxGameSettingCollectionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameSettingCollectionData>();
	}
};
DUMPER7_ASSERTS_UGbxGameSettingCollectionData;

// Class GbxGameSettings.GbxGameSettingRegistry
// 0x0130 (0x01E0 - 0x00B0)
class UGbxGameSettingRegistry final : public UGameSettingRegistry
{
public:
	uint8                                         Pad_B0[0x18];                                      // 0x00B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UGbxGameSettingCollectionData*, class UGameSettingCollection*> CollectionMap;         // 0x00C8(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FName, class UGameSettingCollection*> SpecialCollectionMap;                           // 0x0118(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_168[0x78];                                     // 0x0168(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameSettingRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameSettingRegistry")
	}
	static class UGbxGameSettingRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameSettingRegistry>();
	}
};
DUMPER7_ASSERTS_UGbxGameSettingRegistry;

// Class GbxGameSettings.GbxGameSettingRegistrySubsystem
// 0x0008 (0x0038 - 0x0030)
class UGbxGameSettingRegistrySubsystem final : public ULocalPlayerSubsystem
{
public:
	class UGbxGameSettingRegistry*                registry;                                          // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameSettingRegistrySubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameSettingRegistrySubsystem")
	}
	static class UGbxGameSettingRegistrySubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameSettingRegistrySubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxGameSettingRegistrySubsystem;

// Class GbxGameSettings.GbxGameSettingValue
// 0x0000 (0x0000 - 0x0000)
class IGbxGameSettingValue final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameSettingValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameSettingValue")
	}
	static class IGbxGameSettingValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxGameSettingValue>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxGameSettingValue;

}

