#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxNav_structs.hpp"
#include "GbxAI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EngineSettings_structs.hpp"
#include "GbxDestruction_structs.hpp"
#include "MovieScene_structs.hpp"
#include "GbxAudio_structs.hpp"
#include "GbxNexus_structs.hpp"
#include "ChaosSolverEngine_structs.hpp"
#include "GbxPhysics_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function GbxGame.GbxMomentData.GetDialogScriptIdents
// 0x0010 (0x0010 - 0x0000)
struct GbxMomentData_GetDialogScriptIdents final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxMomentData_GetDialogScriptIdents;

// Function GbxGame.projectile.AttachToTarget
// 0x0108 (0x0108 - 0x0000)
struct projectile_AttachToTarget final
{
public:
	struct FHitResult                             target;                                            // 0x0000(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bSnapToTarget;                                     // 0x0100(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProjectileDetachAction                       DetachedAction;                                    // 0x0101(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0102(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_projectile_AttachToTarget;

// Function GbxGame.projectile.DetachFromTarget
// 0x0001 (0x0001 - 0x0000)
struct projectile_DetachFromTarget final
{
public:
	EProjectileDetachAction                       DetachAction;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_DetachFromTarget;

// Function GbxGame.projectile.Explode
// 0x0001 (0x0001 - 0x0000)
struct projectile_Explode final
{
public:
	uint8                                         Flags_0;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_Explode;

// Function GbxGame.projectile.OnAttachedActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct projectile_OnAttachedActorDestroyed final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_OnAttachedActorDestroyed;

// Function GbxGame.projectile.OnAttachedDestructibleFractured
// 0x0001 (0x0001 - 0x0000)
struct projectile_OnAttachedDestructibleFractured final
{
public:
	bool                                          bMeshSwap;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_OnAttachedDestructibleFractured;

// Function GbxGame.projectile.OnHomingTargetDestroyed
// 0x0008 (0x0008 - 0x0000)
struct projectile_OnHomingTargetDestroyed final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_OnHomingTargetDestroyed;

// Function GbxGame.projectile.SetCustomGravityScale
// 0x0004 (0x0004 - 0x0000)
struct projectile_SetCustomGravityScale final
{
public:
	float                                         GravityScale;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SetCustomGravityScale;

// Function GbxGame.projectile.SetDrunkenMovementState
// 0x0001 (0x0001 - 0x0000)
struct projectile_SetDrunkenMovementState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SetDrunkenMovementState;

// Function GbxGame.projectile.SetHoming
// 0x0001 (0x0001 - 0x0000)
struct projectile_SetHoming final
{
public:
	bool                                          bHoming;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SetHoming;

// Function GbxGame.projectile.SetHomingTarget
// 0x0030 (0x0030 - 0x0000)
struct projectile_SetHomingTarget final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   socket;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SetHomingTarget;

// Function GbxGame.projectile.SetHomingTargetLocation
// 0x0018 (0x0018 - 0x0000)
struct projectile_SetHomingTargetLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SetHomingTargetLocation;

// Function GbxGame.projectile.SetSpawnSpeedScale
// 0x0004 (0x0004 - 0x0000)
struct projectile_SetSpawnSpeedScale final
{
public:
	float                                         SpeedScale;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SetSpawnSpeedScale;

// Function GbxGame.projectile.SetSpawnVelocity
// 0x0018 (0x0018 - 0x0000)
struct projectile_SetSpawnVelocity final
{
public:
	struct FVector                                InSpawnVelocity;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SetSpawnVelocity;

// Function GbxGame.projectile.SetupProximityTrigger
// 0x0100 (0x0100 - 0x0000)
struct projectile_SetupProximityTrigger final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SetupProximityTrigger;

// Function GbxGame.projectile.SetVelocity
// 0x0018 (0x0018 - 0x0000)
struct projectile_SetVelocity final
{
public:
	struct FVector                                NewVelocity;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SetVelocity;

// Function GbxGame.projectile.SimulatePhysics
// 0x0001 (0x0001 - 0x0000)
struct projectile_SimulatePhysics final
{
public:
	bool                                          bSimulate;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_SimulatePhysics;

// Function GbxGame.projectile.StartFuse
// 0x0004 (0x0004 - 0x0000)
struct projectile_StartFuse final
{
public:
	float                                         FuseTime_0;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_StartFuse;

// Function GbxGame.projectile.ToggleProximityTrigger
// 0x0001 (0x0001 - 0x0000)
struct projectile_ToggleProximityTrigger final
{
public:
	bool                                          bTrigger;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_ToggleProximityTrigger;

// Function GbxGame.projectile.GetExplosionFlags
// 0x0001 (0x0001 - 0x0000)
struct projectile_GetExplosionFlags final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_GetExplosionFlags;

// Function GbxGame.projectile.GetGpsQueryName
// 0x0008 (0x0008 - 0x0000)
struct projectile_GetGpsQueryName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_GetGpsQueryName;

// Function GbxGame.projectile.GetHeldImpactEffect
// 0x0018 (0x0018 - 0x0000)
struct projectile_GetHeldImpactEffect final
{
public:
	struct FImpactEffectSelection                 ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_GetHeldImpactEffect;

// Function GbxGame.projectile.GetImpactedActorHitResult
// 0x0108 (0x0108 - 0x0000)
struct projectile_GetImpactedActorHitResult final
{
public:
	struct FHitResult                             OutResult;                                         // 0x0000(0x0100)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0100(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_projectile_GetImpactedActorHitResult;

// Function GbxGame.projectile.HasDamageModifierFlag
// 0x0002 (0x0002 - 0x0000)
struct projectile_HasDamageModifierFlag final
{
public:
	EDamageModifierFlag                           Flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_HasDamageModifierFlag;

// Function GbxGame.projectile.HasExploded
// 0x0001 (0x0001 - 0x0000)
struct projectile_HasExploded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_HasExploded;

// Function GbxGame.projectile.IsHeld
// 0x0001 (0x0001 - 0x0000)
struct projectile_IsHeld final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_IsHeld;

// Function GbxGame.projectile.IsInFlight
// 0x0001 (0x0001 - 0x0000)
struct projectile_IsInFlight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_projectile_IsInFlight;

// Function GbxGame.projectile.ShouldAttachToTarget
// 0x0018 (0x0018 - 0x0000)
struct projectile_ShouldAttachToTarget final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FProjectileAttachFilterData            AttachTo;                                          // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_projectile_ShouldAttachToTarget;

// Function GbxGame.GbxSkillManagedResourceType_Actor.Destroy
// 0x0010 (0x0010 - 0x0000)
struct GbxSkillManagedResourceType_Actor_Destroy final
{
public:
	class UGbxSkillScript*                        Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Value;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxSkillManagedResourceType_Actor_Destroy;

// Function GbxGame.GbxSkillManagedResourceType_Actor.Register
// 0x0030 (0x0030 - 0x0000)
struct GbxSkillManagedResourceType_Actor_Register final
{
public:
	class UGbxSkillScript*                        Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Value;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Handler;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           Group;                                             // 0x0018(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxSkillManagedResourceType_Actor_Register;

// Function GbxGame.GbxSkillManagedResourceType_Actor.Unregister
// 0x0028 (0x0028 - 0x0000)
struct GbxSkillManagedResourceType_Actor_Unregister final
{
public:
	class UGbxSkillScript*                        Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Value;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           Group;                                             // 0x0010(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxSkillManagedResourceType_Actor_Unregister;

// Function GbxGame.GbxMomentFunctionLibrary.EndMoment
// 0x0010 (0x0010 - 0x0000)
struct GbxMomentFunctionLibrary_EndMoment final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxMomentData*                         Moment;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxMomentFunctionLibrary_EndMoment;

// Function GbxGame.GbxMomentFunctionLibrary.LoadMoment
// 0x0010 (0x0010 - 0x0000)
struct GbxMomentFunctionLibrary_LoadMoment final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxMomentData*                         Moment;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxMomentFunctionLibrary_LoadMoment;

// Function GbxGame.GbxMomentFunctionLibrary.RunMoment
// 0x0038 (0x0038 - 0x0000)
struct GbxMomentFunctionLibrary_RunMoment final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxMomentData*                         Moment;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGbxGraphParam>                 Parameters;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0020(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxMomentFunctionLibrary_RunMoment;

// Function GbxGame.GbxAIHeldProjectileComponent.GetHeldProjectile
// 0x0008 (0x0008 - 0x0000)
struct GbxAIHeldProjectileComponent_GetHeldProjectile final
{
public:
	class Aprojectile*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxAIHeldProjectileComponent_GetHeldProjectile;

// Function GbxGame.GbxBodyData.GetBodySwitchState
// 0x0028 (0x0028 - 0x0000)
struct GbxBodyData_GetBodySwitchState final
{
public:
	class FName                                   Switch;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OwnerContext;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Prefix;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBodyData_GetBodySwitchState;

// Function GbxGame.GbxBodyData.GetBodySwitchStateAsBool
// 0x0028 (0x0028 - 0x0000)
struct GbxBodyData_GetBodySwitchStateAsBool final
{
public:
	class FName                                   Switch;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OwnerContext;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Prefix;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxBodyData_GetBodySwitchStateAsBool;

// Function GbxGame.GbxBodyData.SetBodySwitchState
// 0x0028 (0x0028 - 0x0000)
struct GbxBodyData_SetBodySwitchState final
{
public:
	class FName                                   Switch;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OwnerContext;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Prefix;                                            // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxBodyData_SetBodySwitchState;

// Function GbxGame.GbxSkillManagedResourceType_ActorComponent.Destroy
// 0x0010 (0x0010 - 0x0000)
struct GbxSkillManagedResourceType_ActorComponent_Destroy final
{
public:
	class UGbxSkillScript*                        Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        Value;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxSkillManagedResourceType_ActorComponent_Destroy;

// Function GbxGame.GbxSkillManagedResourceType_ActorComponent.Register
// 0x0030 (0x0030 - 0x0000)
struct GbxSkillManagedResourceType_ActorComponent_Register final
{
public:
	class UGbxSkillScript*                        Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        Value;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Handler;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           Group;                                             // 0x0018(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxSkillManagedResourceType_ActorComponent_Register;

// Function GbxGame.GbxSkillManagedResourceType_ActorComponent.Unregister
// 0x0028 (0x0028 - 0x0000)
struct GbxSkillManagedResourceType_ActorComponent_Unregister final
{
public:
	class UGbxSkillScript*                        Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                        Value;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           Group;                                             // 0x0010(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxSkillManagedResourceType_ActorComponent_Unregister;

// Function GbxGame.GbxActorScript.StaticGetInterfaceScripts
// 0x0020 (0x0020 - 0x0000)
struct GbxActorScript_StaticGetInterfaceScripts final
{
public:
	class UObject*                                ContextSource;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class IInterface>                 InterfaceClass;                                    // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UGbxActorScript*>                Scripts;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorScript_StaticGetInterfaceScripts;

// Function GbxGame.GbxActorScript.StaticIsScriptStateEnabled
// 0x0018 (0x0018 - 0x0000)
struct GbxActorScript_StaticIsScriptStateEnabled final
{
public:
	class FName                                   GraphName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextSource;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorScript_StaticIsScriptStateEnabled;

// Function GbxGame.GbxActorScript.StaticSetScriptStateEnabled
// 0x0018 (0x0018 - 0x0000)
struct GbxActorScript_StaticSetScriptStateEnabled final
{
public:
	class FName                                   GraphName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ContextSource;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorScript_StaticSetScriptStateEnabled;

// Function GbxGame.GbxActorScript.OnEndPlay
// 0x0001 (0x0001 - 0x0000)
struct GbxActorScript_OnEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorScript_OnEndPlay;

// Function GbxGame.GbxActorScript.SetScriptStateEnabled
// 0x000C (0x000C - 0x0000)
struct GbxActorScript_SetScriptStateEnabled final
{
public:
	class FName                                   GraphName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorScript_SetScriptStateEnabled;

// Function GbxGame.GbxActorScript.GetAssociatedActor
// 0x0008 (0x0008 - 0x0000)
struct GbxActorScript_GetAssociatedActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorScript_GetAssociatedActor;

// Function GbxGame.GbxActorScript.GetOwner
// 0x0010 (0x0010 - 0x0000)
struct GbxActorScript_GetOwner final
{
public:
	TScriptInterface<class IGbxActorScriptInterface> ReturnValue;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorScript_GetOwner;

// Function GbxGame.GbxActorScript.GetStableRandomStream
// 0x000C (0x000C - 0x0000)
struct GbxActorScript_GetStableRandomStream final
{
public:
	int32                                         SeedOffset;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRandomStream                          ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorScript_GetStableRandomStream;

// Function GbxGame.GbxActorScript.HasAuthority
// 0x0001 (0x0001 - 0x0000)
struct GbxActorScript_HasAuthority final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorScript_HasAuthority;

// Function GbxGame.GbxActorScript.IsScriptStateEnabled
// 0x000C (0x000C - 0x0000)
struct GbxActorScript_IsScriptStateEnabled final
{
public:
	class FName                                   GraphName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxActorScript_IsScriptStateEnabled;

// Function GbxGame.GbxActorScript.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct GbxActorScript_UserConstructionScript final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorScript_UserConstructionScript;

// Function GbxGame.HazardInteractionComponent.BeginInteraction
// 0x0028 (0x0028 - 0x0000)
struct HazardInteractionComponent_BeginInteraction final
{
public:
	FGameDataHandleProperty_                      NewState;                                          // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSource;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SourceDuration;                                    // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 NewInstigator;                                     // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HazardInteractionComponent_BeginInteraction;

// Function GbxGame.HazardInteractionComponent.SetDamageInstigator
// 0x0008 (0x0008 - 0x0000)
struct HazardInteractionComponent_SetDamageInstigator final
{
public:
	class AActor*                                 NewInstigator;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HazardInteractionComponent_SetDamageInstigator;

// Function GbxGame.HazardInteractionComponent.SetEnabled
// 0x0001 (0x0001 - 0x0000)
struct HazardInteractionComponent_SetEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HazardInteractionComponent_SetEnabled;

// Function GbxGame.HazardInteractionComponent.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct HazardInteractionComponent_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HazardInteractionComponent_IsEnabled;

// Function GbxGame.GbxNavTest_NavMeshPath.SetGbxActorDef
// 0x0018 (0x0018 - 0x0000)
struct GbxNavTest_NavMeshPath_SetGbxActorDef final
{
public:
	FGameDataHandleProperty_                      NewGbxActorDef;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxNavTest_NavMeshPath_SetGbxActorDef;

// Function GbxGame.GbxNavTest_NavMeshPath.SetStance
// 0x0018 (0x0018 - 0x0000)
struct GbxNavTest_NavMeshPath_SetStance final
{
public:
	FGameDataHandleProperty_                      NewStance;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxNavTest_NavMeshPath_SetStance;

// Function GbxGame.LightProjectile.ApplyAreaDamage
// 0x0128 (0x0128 - 0x0000)
struct LightProjectile_ApplyAreaDamage final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 HitActor;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0020(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bIgnoreHitActor;                                   // 0x0120(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LightProjectile_ApplyAreaDamage;

// Function GbxGame.LightProjectile.Explode
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_Explode final
{
public:
	float                                         delay;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyProjectile;                                // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LightProjectile_Explode;

// Function GbxGame.LightProjectile.K2_ApplyImpactDamage
// 0x0108 (0x0108 - 0x0000)
struct LightProjectile_K2_ApplyImpactDamage final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         ImpactDamage;                                      // 0x0100(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPenetrated;                                       // 0x0104(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanReflect;                                       // 0x0105(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LightProjectile_K2_ApplyImpactDamage;

// Function GbxGame.LightProjectile.OnAttachedActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_OnAttachedActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_OnAttachedActorDestroyed;

// Function GbxGame.LightProjectile.OnAttachedActorFractured
// 0x0030 (0x0030 - 0x0000)
struct LightProjectile_OnAttachedActorFractured final
{
public:
	struct FVector                                HitPoint;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitDirection;                                      // 0x0018(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_OnAttachedActorFractured;

// Function GbxGame.LightProjectile.OnAttachedComponentCollisionChanged
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_OnAttachedComponentCollisionChanged final
{
public:
	class UPrimitiveComponent*                    ChangedComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_OnAttachedComponentCollisionChanged;

// Function GbxGame.LightProjectile.OnAttachedComponentUnregistered
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_OnAttachedComponentUnregistered final
{
public:
	class UActorComponent*                        UnregisteredComponent;                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_OnAttachedComponentUnregistered;

// Function GbxGame.LightProjectile.OnAttachedDestructibleFractured
// 0x0001 (0x0001 - 0x0000)
struct LightProjectile_OnAttachedDestructibleFractured final
{
public:
	bool                                          bMeshSwap;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_OnAttachedDestructibleFractured;

// Function GbxGame.LightProjectile.OnHomingTargetDestroyed
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_OnHomingTargetDestroyed final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_OnHomingTargetDestroyed;

// Function GbxGame.LightProjectile.OnParticleSystemFinished
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_OnParticleSystemFinished final
{
public:
	class UFXSystemComponent*                     FinishedComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_OnParticleSystemFinished;

// Function GbxGame.LightProjectile.SetDrunkenMovementState
// 0x0001 (0x0001 - 0x0000)
struct LightProjectile_SetDrunkenMovementState final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_SetDrunkenMovementState;

// Function GbxGame.LightProjectile.SetHoming
// 0x0001 (0x0001 - 0x0000)
struct LightProjectile_SetHoming final
{
public:
	bool                                          bHoming;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_SetHoming;

// Function GbxGame.LightProjectile.SetHomingTarget
// 0x0030 (0x0030 - 0x0000)
struct LightProjectile_SetHomingTarget final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        Component;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   socket;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_SetHomingTarget;

// Function GbxGame.LightProjectile.SetHomingTargetLocation
// 0x0018 (0x0018 - 0x0000)
struct LightProjectile_SetHomingTargetLocation final
{
public:
	struct FVector                                Location_0;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_SetHomingTargetLocation;

// Function GbxGame.LightProjectile.SetLifetime
// 0x0004 (0x0004 - 0x0000)
struct LightProjectile_SetLifetime final
{
public:
	float                                         NewLifetime;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_SetLifetime;

// Function GbxGame.LightProjectile.GetAssociatedActor
// 0x0010 (0x0010 - 0x0000)
struct LightProjectile_GetAssociatedActor final
{
public:
	ELightProjectileQueryActorType                ActorType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetAssociatedActor;

// Function GbxGame.LightProjectile.GetAttachedActor
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_GetAttachedActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetAttachedActor;

// Function GbxGame.LightProjectile.GetAttachedDamageReceiverActor
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_GetAttachedDamageReceiverActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetAttachedDamageReceiverActor;

// Function GbxGame.LightProjectile.GetAttachedImpactNormal
// 0x0018 (0x0018 - 0x0000)
struct LightProjectile_GetAttachedImpactNormal final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetAttachedImpactNormal;

// Function GbxGame.LightProjectile.GetAttitudeTowards
// 0x0010 (0x0010 - 0x0000)
struct LightProjectile_GetAttitudeTowards final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETeamAttitude                                 ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LightProjectile_GetAttitudeTowards;

// Function GbxGame.LightProjectile.GetDamageCauser
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_GetDamageCauser final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetDamageCauser;

// Function GbxGame.LightProjectile.GetDamageTags
// 0x0020 (0x0020 - 0x0000)
struct LightProjectile_GetDamageTags final
{
public:
	struct FDamageTags                            ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetDamageTags;

// Function GbxGame.LightProjectile.GetFiringPatternID
// 0x0001 (0x0001 - 0x0000)
struct LightProjectile_GetFiringPatternID final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetFiringPatternID;

// Function GbxGame.LightProjectile.GetGpsQueryName
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_GetGpsQueryName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetGpsQueryName;

// Function GbxGame.LightProjectile.GetInstigator
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_GetInstigator final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetInstigator;

// Function GbxGame.LightProjectile.GetSource
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_GetSource final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetSource;

// Function GbxGame.LightProjectile.GetTarget
// 0x0008 (0x0008 - 0x0000)
struct LightProjectile_GetTarget final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_GetTarget;

// Function GbxGame.LightProjectile.HasDamageModifierFlag
// 0x0002 (0x0002 - 0x0000)
struct LightProjectile_HasDamageModifierFlag final
{
public:
	EDamageModifierFlag                           Flag;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_HasDamageModifierFlag;

// Function GbxGame.LightProjectile.InitChildData
// 0x01C8 (0x01C8 - 0x0000)
struct LightProjectile_InitChildData final
{
public:
	struct FLightProjectileSpawnData              data;                                              // 0x0000(0x01C8)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_InitChildData;

// Function GbxGame.LightProjectile.IsAuthority
// 0x0001 (0x0001 - 0x0000)
struct LightProjectile_IsAuthority final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_IsAuthority;

// Function GbxGame.LightProjectile.IsHoming
// 0x0001 (0x0001 - 0x0000)
struct LightProjectile_IsHoming final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_IsHoming;

// Function GbxGame.LightProjectile.K2_GetDamageType
// 0x0018 (0x0018 - 0x0000)
struct LightProjectile_K2_GetDamageType final
{
public:
	FGameDataHandleProperty_                      ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LightProjectile_K2_GetDamageType;

// Function GbxGame.GbxPlayerController.Client_ConsumePremiumCurrency
// 0x000C (0x000C - 0x0000)
struct GbxPlayerController_Client_ConsumePremiumCurrency final
{
public:
	struct FSToken                                type;                                              // 0x0000(0x000C)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPlayerController_Client_ConsumePremiumCurrency;

// Function GbxGame.GbxPlayerController.Client_PlayGbxFeedback
// 0x0050 (0x0050 - 0x0000)
struct GbxPlayerController_Client_PlayGbxFeedback final
{
public:
	FGameDataHandleProperty_                      data;                                              // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayFlags;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIs3D;                                             // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoop;                                             // 0x001D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         scale;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                SourceContext;                                     // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SourceLocation;                                    // 0x0030(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectFalloffMinDistance;                          // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EffectFalloffMaxDistance;                          // 0x004C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPlayerController_Client_PlayGbxFeedback;

// Function GbxGame.GbxPlayerController.Client_ResetGbxFeedbackPlayTime
// 0x0018 (0x0018 - 0x0000)
struct GbxPlayerController_Client_ResetGbxFeedbackPlayTime final
{
public:
	FGameDataHandleProperty_                      data;                                              // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPlayerController_Client_ResetGbxFeedbackPlayTime;

// Function GbxGame.GbxPlayerController.Client_StopGbxFeedback
// 0x0018 (0x0018 - 0x0000)
struct GbxPlayerController_Client_StopGbxFeedback final
{
public:
	FGameDataHandleProperty_                      data;                                              // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPlayerController_Client_StopGbxFeedback;

// Function GbxGame.GbxPlayerController.ClientPartyKick
// 0x0010 (0x0010 - 0x0000)
struct GbxPlayerController_ClientPartyKick final
{
public:
	class FString                                 KickReason;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPlayerController_ClientPartyKick;

// Function GbxGame.GbxPlayerController.ClientPlayRadialBlur
// 0x0040 (0x0040 - 0x0000)
struct GbxPlayerController_ClientPlayRadialBlur final
{
public:
	FGameDataHandleProperty_                      Blur;                                              // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideCenter;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WorldSpaceCenter;                                  // 0x0020(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistance;                                       // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxPlayerController_ClientPlayRadialBlur;

// Function GbxGame.GbxPlayerController.ClientReceiveTextChat
// 0x0018 (0x0018 - 0x0000)
struct GbxPlayerController_ClientReceiveTextChat final
{
public:
	class APlayerState*                           Sender;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
