#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxNexus

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GbxNexus_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GbxNexus.NexusBitTagsLibrary
// 0x0000 (0x0028 - 0x0028)
class UNexusBitTagsLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool HasAllTags(const struct FNexusBitSet& Set, const struct FNexusBitSet& OtherSet);
	static bool HasAnyTags(const struct FNexusBitSet& Set, const struct FNexusBitSet& OtherSet);
	static bool HasTag(const struct FNexusBitSet& Set, class FName Tag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusBitTagsLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusBitTagsLibrary")
	}
	static class UNexusBitTagsLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusBitTagsLibrary>();
	}
};
DUMPER7_ASSERTS_UNexusBitTagsLibrary;

// Class GbxNexus.NexusBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UNexusBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FNexusConfigDataBP ConfigFromYAML(const class FString& YAMLStr);
	static struct FNexusConfigDataBP GetSubByIndex(const struct FNexusConfigDataBP& NCD, int32 Index_0);
	static struct FNexusConfigDataBP GetSubByName(const struct FNexusConfigDataBP& NCD, const class FString& Key);
	static float GetValueAsFloat(const struct FNexusConfigDataBP& NCD, float Default);
	static int32 GetValueAsInt32(const struct FNexusConfigDataBP& NCD, int32 Default);
	static class FString GetValueAsString(const struct FNexusConfigDataBP& NCD, const class FString& Default);
	static bool IsMap(const struct FNexusConfigDataBP& NCD);
	static bool IsScalar(const struct FNexusConfigDataBP& NCD);
	static bool IsSequence(const struct FNexusConfigDataBP& NCD);
	static bool IsValid(const struct FNexusConfigDataBP& NCD);
	static class FString ToString(const struct FNexusConfigDataBP& NCD);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusBPLibrary")
	}
	static class UNexusBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusBPLibrary>();
	}
};
DUMPER7_ASSERTS_UNexusBPLibrary;

// Class GbxNexus.NexusConfigStore
// 0x01A0 (0x01C8 - 0x0028)
class UNexusConfigStore : public UObject
{
public:
	uint8                                         Pad_28[0x120];                                     // 0x0028(0x0120)(Fixing Size After Last Property [ Dumper-7 ])
	class UNexusContentLoader*                    OwningLoader;                                      // 0x0148(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0x68];                                     // 0x0150(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNexusScriptStruct*>             ElementScriptStructs;                              // 0x01B8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStore")
	}
	static class UNexusConfigStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStore>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStore;

// Class GbxNexus.NexusConfigStoreContentRef
// 0x0060 (0x0088 - 0x0028)
class UNexusConfigStoreContentRef final : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreContentRef")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreContentRef")
	}
	static class UNexusConfigStoreContentRef* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreContentRef>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreContentRef;

// Class GbxNexus.NexusConfigStoreDeep
// 0x0178 (0x0340 - 0x01C8)
class UNexusConfigStoreDeep : public UNexusConfigStore
{
public:
	uint8                                         Pad_1C8[0x10];                                     // 0x01C8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNexusConfigSubType*>            SubTypes;                                          // 0x01D8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E8[0x158];                                    // 0x01E8(0x0158)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreDeep")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreDeep")
	}
	static class UNexusConfigStoreDeep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreDeep>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreDeep;

// Class GbxNexus.NexusConfigStorePath
// 0x0000 (0x0340 - 0x0340)
class UNexusConfigStorePath : public UNexusConfigStoreDeep
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStorePath")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStorePath")
	}
	static class UNexusConfigStorePath* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStorePath>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStorePath;

// Class GbxNexus.NexusConfigStoreCredits
// 0x0000 (0x0340 - 0x0340)
class UNexusConfigStoreCredits final : public UNexusConfigStorePath
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreCredits")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreCredits")
	}
	static class UNexusConfigStoreCredits* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreCredits>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreCredits;

// Class GbxNexus.NexusConfigStoreMix
// 0x0000 (0x0340 - 0x0340)
class UNexusConfigStoreMix : public UNexusConfigStoreDeep
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreMix")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreMix")
	}
	static class UNexusConfigStoreMix* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreMix>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreMix;

// Class GbxNexus.NexusConfigStoreFlat
// 0x0108 (0x02D0 - 0x01C8)
class UNexusConfigStoreFlat : public UNexusConfigStore
{
public:
	uint8                                         Pad_1C8[0x108];                                    // 0x01C8(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreFlat")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreFlat")
	}
	static class UNexusConfigStoreFlat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreFlat>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreFlat;

// Class GbxNexus.NexusScriptStruct
// 0x0010 (0x00D0 - 0x00C0)
class UNexusScriptStruct final : public UScriptStruct
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusScriptStruct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusScriptStruct")
	}
	static class UNexusScriptStruct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusScriptStruct>();
	}
};
DUMPER7_ASSERTS_UNexusScriptStruct;

// Class GbxNexus.NexusConfigStoreGeneric
// 0x0000 (0x02D0 - 0x02D0)
class UNexusConfigStoreGeneric : public UNexusConfigStoreFlat
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreGeneric")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreGeneric")
	}
	static class UNexusConfigStoreGeneric* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreGeneric>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreGeneric;

// Class GbxNexus.NexusConfigStoreGlobals
// 0x0000 (0x02D0 - 0x02D0)
class UNexusConfigStoreGlobals final : public UNexusConfigStoreFlat
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreGlobals")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreGlobals")
	}
	static class UNexusConfigStoreGlobals* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreGlobals>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreGlobals;

// Class GbxNexus.NexusConfigStoreMetaData
// 0x0000 (0x02D0 - 0x02D0)
class UNexusConfigStoreMetaData final : public UNexusConfigStoreGeneric
{
public:
	static void GetStructPropertyNames(class UObject* Outer_0, TArray<class FName>* OutNames);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreMetaData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreMetaData")
	}
	static class UNexusConfigStoreMetaData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreMetaData>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreMetaData;

// Class GbxNexus.NexusConfigStoreTestFlat
// 0x0000 (0x02D0 - 0x02D0)
class UNexusConfigStoreTestFlat final : public UNexusConfigStoreFlat
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreTestFlat")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreTestFlat")
	}
	static class UNexusConfigStoreTestFlat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreTestFlat>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreTestFlat;

// Class GbxNexus.NexusConfigStoreTestMix
// 0x0000 (0x0340 - 0x0340)
class UNexusConfigStoreTestMix final : public UNexusConfigStoreMix
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreTestMix")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreTestMix")
	}
	static class UNexusConfigStoreTestMix* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreTestMix>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreTestMix;

// Class GbxNexus.NexusConfigStoreTestPath
// 0x0000 (0x0340 - 0x0340)
class UNexusConfigStoreTestPath final : public UNexusConfigStorePath
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreTestPath")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreTestPath")
	}
	static class UNexusConfigStoreTestPath* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreTestPath>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreTestPath;

// Class GbxNexus.NexusEditorObjectBase
// 0x0018 (0x0040 - 0x0028)
class UNexusEditorObjectBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                TemporaryArchetype;                                // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsArchetype;                                      // 0x0038(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsInPrototypeFolder;                              // 0x0039(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusEditorObjectBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusEditorObjectBase")
	}
	static class UNexusEditorObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusEditorObjectBase>();
	}
};
DUMPER7_ASSERTS_UNexusEditorObjectBase;

// Class GbxNexus.NexusEditorObject
// 0x0000 (0x0040 - 0x0040)
class UNexusEditorObject : public UNexusEditorObjectBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusEditorObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusEditorObject")
	}
	static class UNexusEditorObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusEditorObject>();
	}
};
DUMPER7_ASSERTS_UNexusEditorObject;

// Class GbxNexus.NexusConfigSubType
// 0x0018 (0x0040 - 0x0028)
class UNexusConfigSubType : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UNexusConfigStoreDeep*                  OwningStore;                                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigSubType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigSubType")
	}
	static class UNexusConfigSubType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigSubType>();
	}
};
DUMPER7_ASSERTS_UNexusConfigSubType;

// Class GbxNexus.NexusContentLoader
// 0x0668 (0x0690 - 0x0028)
class UNexusContentLoader final : public UObject
{
public:
	uint8                                         Pad_28[0xA0];                                      // 0x0028(0x00A0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNexusConfigStore*>              ConfigTypes;                                       // 0x00C8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0xB8];                                      // 0x00D8(0x00B8)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UScriptStruct*, class UNexusConfigStore*> InlineStructArchetypeStoreMap;              // 0x0190(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E0[0x60];                                     // 0x01E0(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNexusStoreBindingConfig>       StoreBindingsFromConfig;                           // 0x0240(0x0010)(Edit, ZeroConstructor, Config, NoClear, NativeAccessSpecifierPrivate)
	TArray<struct FNexusStoreRedirect>            StoreRedirects;                                    // 0x0250(0x0010)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)
	uint8                                         Pad_260[0x68];                                     // 0x0260(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNexusLayerInfo>                LayerInfos;                                        // 0x02C8(0x0010)(Edit, ZeroConstructor, Config, NoClear, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D8[0x3B8];                                    // 0x02D8(0x03B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusContentLoader")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusContentLoader")
	}
	static class UNexusContentLoader* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusContentLoader>();
	}
};
DUMPER7_ASSERTS_UNexusContentLoader;

// Class GbxNexus.NexusDataLayerSubsystem
// 0x0058 (0x0088 - 0x0030)
class UNexusDataLayerSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x58];                                      // 0x0030(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusDataLayerSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusDataLayerSubsystem")
	}
	static class UNexusDataLayerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusDataLayerSubsystem>();
	}
};
DUMPER7_ASSERTS_UNexusDataLayerSubsystem;

// Class GbxNexus.GenericNexusEditorObject
// 0x0018 (0x0058 - 0x0040)
class UGenericNexusEditorObject : public UNexusEditorObjectBase
{
public:
	struct FGbxInlineStruct                       EditableData;                                      // 0x0040(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GenericNexusEditorObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GenericNexusEditorObject")
	}
	static class UGenericNexusEditorObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGenericNexusEditorObject>();
	}
};
DUMPER7_ASSERTS_UGenericNexusEditorObject;

// Class GbxNexus.NexusLoadingContextSettings
// 0x0010 (0x0048 - 0x0038)
class UNexusLoadingContextSettings final : public UDeveloperSettings
{
public:
	TArray<struct FLoadingContextInfo>            LoadingContexts;                                   // 0x0038(0x0010)(Edit, EditFixedSize, ZeroConstructor, Config, TextExportTransient, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusLoadingContextSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusLoadingContextSettings")
	}
	static class UNexusLoadingContextSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusLoadingContextSettings>();
	}
};
DUMPER7_ASSERTS_UNexusLoadingContextSettings;

// Class GbxNexus.NexusSerializeTestSettings
// 0x0010 (0x0048 - 0x0038)
class UNexusSerializeTestSettings final : public UDeveloperSettings
{
public:
	TArray<struct FNexusSerializeTestContentRef>  ContentToTest;                                     // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static void GetAvailableLayers(TArray<class FName>* OutLayers);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusSerializeTestSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusSerializeTestSettings")
	}
	static class UNexusSerializeTestSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusSerializeTestSettings>();
	}
};
DUMPER7_ASSERTS_UNexusSerializeTestSettings;

// Class GbxNexus.NexusSerializeTest_BaseStore
// 0x00B0 (0x0380 - 0x02D0)
class UNexusSerializeTest_BaseStore : public UNexusConfigStoreFlat
{
public:
	uint8                                         Pad_2D0[0xB0];                                     // 0x02D0(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusSerializeTest_BaseStore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusSerializeTest_BaseStore")
	}
	static class UNexusSerializeTest_BaseStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusSerializeTest_BaseStore>();
	}
};
DUMPER7_ASSERTS_UNexusSerializeTest_BaseStore;

// Class GbxNexus.NexusSerializeTest_ArrayDefStore
// 0x0000 (0x0380 - 0x0380)
class UNexusSerializeTest_ArrayDefStore final : public UNexusSerializeTest_BaseStore
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusSerializeTest_ArrayDefStore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusSerializeTest_ArrayDefStore")
	}
	static class UNexusSerializeTest_ArrayDefStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusSerializeTest_ArrayDefStore>();
	}
};
DUMPER7_ASSERTS_UNexusSerializeTest_ArrayDefStore;

// Class GbxNexus.NexusSerializeTest_BasicDefStore
// 0x0000 (0x0380 - 0x0380)
class UNexusSerializeTest_BasicDefStore final : public UNexusSerializeTest_BaseStore
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusSerializeTest_BasicDefStore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusSerializeTest_BasicDefStore")
	}
	static class UNexusSerializeTest_BasicDefStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusSerializeTest_BasicDefStore>();
	}
};
DUMPER7_ASSERTS_UNexusSerializeTest_BasicDefStore;

// Class GbxNexus.NexusSerializeTest_GameplayTagDefStore
// 0x0000 (0x0380 - 0x0380)
class UNexusSerializeTest_GameplayTagDefStore final : public UNexusSerializeTest_BaseStore
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusSerializeTest_GameplayTagDefStore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusSerializeTest_GameplayTagDefStore")
	}
	static class UNexusSerializeTest_GameplayTagDefStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusSerializeTest_GameplayTagDefStore>();
	}
};
DUMPER7_ASSERTS_UNexusSerializeTest_GameplayTagDefStore;

// Class GbxNexus.NexusSerializeTest_MapDefStore
// 0x0000 (0x0380 - 0x0380)
class UNexusSerializeTest_MapDefStore final : public UNexusSerializeTest_BaseStore
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusSerializeTest_MapDefStore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusSerializeTest_MapDefStore")
	}
	static class UNexusSerializeTest_MapDefStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusSerializeTest_MapDefStore>();
	}
};
DUMPER7_ASSERTS_UNexusSerializeTest_MapDefStore;

// Class GbxNexus.NexusSerializeTest_SetDefStore
// 0x0000 (0x0380 - 0x0380)
class UNexusSerializeTest_SetDefStore final : public UNexusSerializeTest_BaseStore
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusSerializeTest_SetDefStore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusSerializeTest_SetDefStore")
	}
	static class UNexusSerializeTest_SetDefStore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusSerializeTest_SetDefStore>();
	}
};
DUMPER7_ASSERTS_UNexusSerializeTest_SetDefStore;

// Class GbxNexus.NexusStyleSettings
// 0x0010 (0x0048 - 0x0038)
class UNexusStyleSettings final : public UDeveloperSettings
{
public:
	TArray<struct FNexusStyleInfo>                StyleInfos;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusStyleSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusStyleSettings")
	}
	static class UNexusStyleSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusStyleSettings>();
	}
};
DUMPER7_ASSERTS_UNexusStyleSettings;

}

