#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxNiagaraExtensions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxNiagaraExtensions_structs.hpp"


namespace SDK::Params
{

// Function GbxNiagaraExtensions.GbxNiagaraDataInterfaceSampleDynamicMeshBase.OnSourceEndPlay
// 0x0010 (0x0010 - 0x0000)
struct GbxNiagaraDataInterfaceSampleDynamicMeshBase_OnSourceEndPlay final
{
public:
	class AActor*                                 InSource;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                reason;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxNiagaraDataInterfaceSampleDynamicMeshBase_OnSourceEndPlay;

// Function GbxNiagaraExtensions.GbxNiagaraPerfCollectorBPLibrary.CanStartNiagaraPerfTest
// 0x0001 (0x0001 - 0x0000)
struct GbxNiagaraPerfCollectorBPLibrary_CanStartNiagaraPerfTest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxNiagaraPerfCollectorBPLibrary_CanStartNiagaraPerfTest;

// Function GbxNiagaraExtensions.GbxNiagaraPerfCollectorBPLibrary.GetNiagaraPerfTestStatus
// 0x000C (0x000C - 0x0000)
struct GbxNiagaraPerfCollectorBPLibrary_GetNiagaraPerfTestStatus final
{
public:
	int32                                         TotalTests;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RemainingTests;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxNiagaraPerfCollectorState                 ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxNiagaraPerfCollectorBPLibrary_GetNiagaraPerfTestStatus;

// Function GbxNiagaraExtensions.GbxNiagaraPerfCollectorBPLibrary.SetNiagaraPerfTestSystemOffset
// 0x0004 (0x0004 - 0x0000)
struct GbxNiagaraPerfCollectorBPLibrary_SetNiagaraPerfTestSystemOffset final
{
public:
	float                                         NewOffset;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxNiagaraPerfCollectorBPLibrary_SetNiagaraPerfTestSystemOffset;

// Function GbxNiagaraExtensions.GbxNiagaraPerfCollectorBPLibrary.StartNiagaraPerfTest
// 0x0008 (0x0008 - 0x0000)
struct GbxNiagaraPerfCollectorBPLibrary_StartNiagaraPerfTest final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxNiagaraPerfCollectorBPLibrary_StartNiagaraPerfTest;

}

