#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxNiagaraExtensions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GbxAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Niagara_structs.hpp"
#include "Niagara_classes.hpp"
#include "GbxNiagaraExtensions_structs.hpp"


namespace SDK
{

// Class GbxNiagaraExtensions.GbxNiagaraDataInterfaceWwiseEvent
// 0x0040 (0x0078 - 0x0038)
class UGbxNiagaraDataInterfaceWwiseEvent : public UNiagaraDataInterface
{
public:
	struct FGbxAudioEvent                         Event;                                             // 0x0038(0x0030)(Edit, NativeAccessSpecifierPublic)
	float                                         Gain;                                              // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetPadding;                                       // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PaddingRadius;                                     // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraDataInterfaceWwiseEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraDataInterfaceWwiseEvent")
	}
	static class UGbxNiagaraDataInterfaceWwiseEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraDataInterfaceWwiseEvent>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraDataInterfaceWwiseEvent;

// Class GbxNiagaraExtensions.GbxNiagaraDataInterfaceDistributedWwiseEvent
// 0x0048 (0x00C0 - 0x0078)
class UGbxNiagaraDataInterfaceDistributedWwiseEvent final : public UGbxNiagaraDataInterfaceWwiseEvent
{
public:
	struct FGbxAudioEvent                         StopEvent;                                         // 0x0078(0x0030)(Edit, NativeAccessSpecifierPublic)
	TArray<FGbxDefPtrProperty_>                   GameParameters;                                    // 0x00A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         MaxActiveSources;                                  // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayUntilEmitterDies;                             // 0x00BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraDataInterfaceDistributedWwiseEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraDataInterfaceDistributedWwiseEvent")
	}
	static class UGbxNiagaraDataInterfaceDistributedWwiseEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraDataInterfaceDistributedWwiseEvent>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraDataInterfaceDistributedWwiseEvent;

// Class GbxNiagaraExtensions.GbxNiagaraDataInterfaceGbxAttribute
// 0x0068 (0x00A0 - 0x0038)
class UGbxNiagaraDataInterfaceGbxAttribute final : public UNiagaraDataInterface
{
public:
	ENDIGbxAttributeSourceMode                    SourceMode;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserParameterBinding           ObjectBinding;                                     // 0x0040(0x0020)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FNDIGbxAttributeData>           Attributes;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  SourceActor;                                       // 0x0070(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraDataInterfaceGbxAttribute")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraDataInterfaceGbxAttribute")
	}
	static class UGbxNiagaraDataInterfaceGbxAttribute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraDataInterfaceGbxAttribute>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraDataInterfaceGbxAttribute;

// Class GbxNiagaraExtensions.GbxNiagaraDataInterfaceOneShotWwiseEvent
// 0x0008 (0x0080 - 0x0078)
class UGbxNiagaraDataInterfaceOneShotWwiseEvent final : public UGbxNiagaraDataInterfaceWwiseEvent
{
public:
	int32                                         MaxPlaysPerTick;                                   // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraDataInterfaceOneShotWwiseEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraDataInterfaceOneShotWwiseEvent")
	}
	static class UGbxNiagaraDataInterfaceOneShotWwiseEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraDataInterfaceOneShotWwiseEvent>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraDataInterfaceOneShotWwiseEvent;

// Class GbxNiagaraExtensions.GbxNiagaraDataInterfacePersistentWwiseEvent
// 0x0018 (0x0090 - 0x0078)
class UGbxNiagaraDataInterfacePersistentWwiseEvent final : public UGbxNiagaraDataInterfaceWwiseEvent
{
public:
	TArray<FGbxDefPtrProperty_>                   GameParameters;                                    // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         MaxActiveSounds;                                   // 0x0088(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraDataInterfacePersistentWwiseEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraDataInterfacePersistentWwiseEvent")
	}
	static class UGbxNiagaraDataInterfacePersistentWwiseEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraDataInterfacePersistentWwiseEvent>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraDataInterfacePersistentWwiseEvent;

// Class GbxNiagaraExtensions.GbxNiagaraDataInterfaceSampleDynamicMeshBase
// 0x0050 (0x0088 - 0x0038)
class UGbxNiagaraDataInterfaceSampleDynamicMeshBase : public UNiagaraDataInterface
{
public:
	ENDISampleDynamicMesh_SourceMode              SourceMode;                                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PreviewExtent;                                     // 0x0040(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  SoftSourceActor;                                   // 0x0050(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshComponent*                         SourceComponent;                                   // 0x0078(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCaptureTransformsPerFrame;                        // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnSourceEndPlay(class AActor* InSource, EEndPlayReason reason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraDataInterfaceSampleDynamicMeshBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraDataInterfaceSampleDynamicMeshBase")
	}
	static class UGbxNiagaraDataInterfaceSampleDynamicMeshBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraDataInterfaceSampleDynamicMeshBase>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraDataInterfaceSampleDynamicMeshBase;

// Class GbxNiagaraExtensions.GbxNiagaraDataInterfaceSampleDynamicMesh
// 0x0000 (0x0088 - 0x0088)
class UGbxNiagaraDataInterfaceSampleDynamicMesh final : public UGbxNiagaraDataInterfaceSampleDynamicMeshBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraDataInterfaceSampleDynamicMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraDataInterfaceSampleDynamicMesh")
	}
	static class UGbxNiagaraDataInterfaceSampleDynamicMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraDataInterfaceSampleDynamicMesh>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraDataInterfaceSampleDynamicMesh;

// Class GbxNiagaraExtensions.GbxNiagaraDataInterfaceSampleProceduralMesh
// 0x0000 (0x0088 - 0x0088)
class UGbxNiagaraDataInterfaceSampleProceduralMesh final : public UGbxNiagaraDataInterfaceSampleDynamicMeshBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraDataInterfaceSampleProceduralMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraDataInterfaceSampleProceduralMesh")
	}
	static class UGbxNiagaraDataInterfaceSampleProceduralMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraDataInterfaceSampleProceduralMesh>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraDataInterfaceSampleProceduralMesh;

// Class GbxNiagaraExtensions.GbxNiagaraDataInterfaceViewportScale
// 0x0000 (0x0038 - 0x0038)
class UGbxNiagaraDataInterfaceViewportScale final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraDataInterfaceViewportScale")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraDataInterfaceViewportScale")
	}
	static class UGbxNiagaraDataInterfaceViewportScale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraDataInterfaceViewportScale>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraDataInterfaceViewportScale;

// Class GbxNiagaraExtensions.GbxNiagaraPerfCollectorActor
// 0x0010 (0x03A0 - 0x0390)
class AGbxNiagaraPerfCollectorActor final : public AActor
{
public:
	TArray<struct FGbxNiagaraPerfCollectorSystem> SpawnedSystems;                                    // 0x0390(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraPerfCollectorActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraPerfCollectorActor")
	}
	static class AGbxNiagaraPerfCollectorActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxNiagaraPerfCollectorActor>();
	}
};
DUMPER7_ASSERTS_AGbxNiagaraPerfCollectorActor;

// Class GbxNiagaraExtensions.GbxNiagaraPerfCollectorBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UGbxNiagaraPerfCollectorBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CanStartNiagaraPerfTest();
	static EGbxNiagaraPerfCollectorState GetNiagaraPerfTestStatus(int32* TotalTests, int32* RemainingTests);
	static void SetNiagaraPerfTestSystemOffset(float NewOffset);
	static void StartNiagaraPerfTest(class UObject* WorldContextObject);
	static void StopNiagaraPerfTest();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNiagaraPerfCollectorBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNiagaraPerfCollectorBPLibrary")
	}
	static class UGbxNiagaraPerfCollectorBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNiagaraPerfCollectorBPLibrary>();
	}
};
DUMPER7_ASSERTS_UGbxNiagaraPerfCollectorBPLibrary;

}

