#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxNetGame

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum GbxNetGame.EGbxBeaconStatusCode
// NumValues: 0x0009
enum class EGbxBeaconStatusCode : uint8
{
	None                                     = 0,
	Identify                                 = 1,
	Validating                               = 2,
	Active                                   = 3,
	Migrating                                = 4,
	Redirect                                 = 5,
	Closing                                  = 6,
	Close                                    = 7,
	EGbxBeaconStatusCode_MAX                 = 8,
};

// Enum GbxNetGame.EGbxBeaconPlayerStatus
// NumValues: 0x0003
enum class EGbxBeaconPlayerStatus : uint8
{
	Join                                     = 0,
	Quit                                     = 1,
	EGbxBeaconPlayerStatus_MAX               = 2,
};

// Enum GbxNetGame.EDedicatedServerAuthType
// NumValues: 0x0005
enum class EDedicatedServerAuthType : uint8
{
	None                                     = 0,
	DevServerShift                           = 1,
	CloudServerSpark                         = 2,
	LocalHonchoPIE                           = 3,
	EDedicatedServerAuthType_MAX             = 4,
};

// Enum GbxNetGame.EDedicatedServerAuthStatus
// NumValues: 0x0007
enum class EDedicatedServerAuthStatus : uint8
{
	Unknown                                  = 0,
	EnvProbe                                 = 1,
	Pending                                  = 2,
	Auth                                     = 3,
	Skipped                                  = 4,
	Failed                                   = 5,
	EDedicatedServerAuthStatus_MAX           = 6,
};

// Enum GbxNetGame.EDedicatedServerHostStatus
// NumValues: 0x0009
enum class EDedicatedServerHostStatus : uint8
{
	PreAuth                                  = 0,
	Sleeping                                 = 1,
	Travelling                               = 2,
	Onboarding                               = 3,
	Playing                                  = 4,
	Ending                                   = 5,
	Ended                                    = 6,
	Failed                                   = 7,
	EDedicatedServerHostStatus_MAX           = 8,
};

// ScriptStruct GbxNetGame.GbxBeaconStatus
// 0x0018 (0x0018 - 0x0000)
struct FGbxBeaconStatus final
{
public:
	EGbxBeaconStatusCode                          StatusCode;                                        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 payload;                                           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxBeaconStatus;

// ScriptStruct GbxNetGame.HonchoBeaconIdentPair
// 0x0010 (0x0010 - 0x0000)
struct FHonchoBeaconIdentPair final
{
public:
	uint64                                        GatewayId;                                         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        CloudId;                                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHonchoBeaconIdentPair;

// ScriptStruct GbxNetGame.HonchoBeaconMember
// 0x0068 (0x0068 - 0x0000)
struct FHonchoBeaconMember final
{
public:
	struct FHonchoBeaconIdentPair                 Idents;                                            // 0x0000(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       NetID;                                             // 0x0010(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerSessionId;                                   // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartyId;                                           // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHonchoBeaconMember;

// ScriptStruct GbxNetGame.HonchoBeaconPopulationSync
// 0x0010 (0x0010 - 0x0000)
struct FHonchoBeaconPopulationSync final
{
public:
	TArray<struct FHonchoBeaconMember>            Members;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHonchoBeaconPopulationSync;

// ScriptStruct GbxNetGame.HonchoBeaconPopulationResponse
// 0x0010 (0x0010 - 0x0000)
struct FHonchoBeaconPopulationResponse final
{
public:
	TArray<struct FHonchoBeaconIdentPair>         Members;                                           // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHonchoBeaconPopulationResponse;

// ScriptStruct GbxNetGame.HonchoBeaconPartyJoinParams
// 0x0040 (0x0040 - 0x0000)
struct FHonchoBeaconPartyJoinParams final
{
public:
	class FString                                 PartyName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUniqueNetIdRepl                       LeaderNetId;                                       // 0x0010(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHonchoBeaconPartyJoinParams;

// ScriptStruct GbxNetGame.HonchoBeaconPartyJoinResponse
// 0x0028 (0x0028 - 0x0000)
struct FHonchoBeaconPartyJoinResponse final
{
public:
	TArray<struct FUniqueNetIdRepl>               PartyMembersNetId;                                 // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 PartyName;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLeader;                                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHonchoBeaconPartyJoinResponse;

// ScriptStruct GbxNetGame.HonchoBeaconPartyLeaveParams
// 0x0010 (0x0010 - 0x0000)
struct FHonchoBeaconPartyLeaveParams final
{
public:
	class FString                                 PartyName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHonchoBeaconPartyLeaveParams;

// ScriptStruct GbxNetGame.HonchoBeaconPartyLeaveResponse
// 0x0010 (0x0010 - 0x0000)
struct FHonchoBeaconPartyLeaveResponse final
{
public:
	class FString                                 PartyName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHonchoBeaconPartyLeaveResponse;

// ScriptStruct GbxNetGame.HonchoBeaconPartyMemberJoinedParams
// 0x0040 (0x0040 - 0x0000)
struct FHonchoBeaconPartyMemberJoinedParams final
{
public:
	struct FUniqueNetIdRepl                       MemberJoiningNetId;                                // 0x0000(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartyName;                                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHonchoBeaconPartyMemberJoinedParams;

// ScriptStruct GbxNetGame.HonchoBeaconPartyMemberLeftParams
// 0x0048 (0x0048 - 0x0000)
struct FHonchoBeaconPartyMemberLeftParams final
{
public:
	struct FUniqueNetIdRepl                       MemberLeavingNetId;                                // 0x0000(0x0030)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartyName;                                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsNewLeader;                                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FHonchoBeaconPartyMemberLeftParams;

}

