#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxNetGame

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// Class GbxNetGame.GbxBeaconHost
// 0x0000 (0x04D0 - 0x04D0)
class AGbxBeaconHost final : public AOnlineBeaconHost
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxBeaconHost")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxBeaconHost")
	}
	static class AGbxBeaconHost* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxBeaconHost>();
	}
};
DUMPER7_ASSERTS_AGbxBeaconHost;

// Class GbxNetGame.GbxBeaconHostObject
// 0x0000 (0x03B8 - 0x03B8)
class AGbxBeaconHostObject final : public AOnlineBeaconHostObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxBeaconHostObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxBeaconHostObject")
	}
	static class AGbxBeaconHostObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxBeaconHostObject>();
	}
};
DUMPER7_ASSERTS_AGbxBeaconHostObject;

// Class GbxNetGame.GbxBeaconClient
// 0x0000 (0x0420 - 0x0420)
class AGbxBeaconClient final : public AOnlineBeaconClient
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxBeaconClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxBeaconClient")
	}
	static class AGbxBeaconClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxBeaconClient>();
	}
};
DUMPER7_ASSERTS_AGbxBeaconClient;

// Class GbxNetGame.GbxGameLiftServer
// 0x0010 (0x0038 - 0x0028)
class UGbxGameLiftServer : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameLiftServer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameLiftServer")
	}
	static class UGbxGameLiftServer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameLiftServer>();
	}
};
DUMPER7_ASSERTS_UGbxGameLiftServer;

// Class GbxNetGame.GbxNetGameInstance
// 0x0020 (0x0440 - 0x0420)
class UGbxNetGameInstance : public UGbxGameInstance
{
public:
	TArray<class UWorld*>                         TheWorldsBeforeTime;                               // 0x0420(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_430[0x8];                                      // 0x0430(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxNetSingletons*                      GbxNetSingletons;                                  // 0x0438(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNetGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNetGameInstance")
	}
	static class UGbxNetGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNetGameInstance>();
	}
};
DUMPER7_ASSERTS_UGbxNetGameInstance;

// Class GbxNetGame.GbxNetPartyManager
// 0x0000 (0x0028 - 0x0028)
class UGbxNetPartyManager final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNetPartyManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNetPartyManager")
	}
	static class UGbxNetPartyManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNetPartyManager>();
	}
};
DUMPER7_ASSERTS_UGbxNetPartyManager;

// Class GbxNetGame.GbxNetSingletons
// 0x0010 (0x0090 - 0x0080)
class UGbxNetSingletons : public UGbxGameSingletons
{
public:
	class UGbxGameLiftServer*                     GameLiftServer;                                    // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxSparkServer*                        SparkServer;                                       // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxNetSingletons")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxNetSingletons")
	}
	static class UGbxNetSingletons* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxNetSingletons>();
	}
};
DUMPER7_ASSERTS_UGbxNetSingletons;

// Class GbxNetGame.GbxSparkServer
// 0x0118 (0x0140 - 0x0028)
class UGbxSparkServer : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxGameLiftServer*                     GameLift;                                          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0xF8];                                      // 0x0048(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxSparkServer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxSparkServer")
	}
	static class UGbxSparkServer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxSparkServer>();
	}
};
DUMPER7_ASSERTS_UGbxSparkServer;

}

