#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxNexus

#include "Basic.hpp"

#include "GbxNexus_structs.hpp"


namespace SDK::Params
{

// Function GbxNexus.NexusBitTagsLibrary.HasAllTags
// 0x0048 (0x0048 - 0x0000)
struct NexusBitTagsLibrary_HasAllTags final
{
public:
	struct FNexusBitSet                           Set;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FNexusBitSet                           OtherSet;                                          // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NexusBitTagsLibrary_HasAllTags;

// Function GbxNexus.NexusBitTagsLibrary.HasAnyTags
// 0x0048 (0x0048 - 0x0000)
struct NexusBitTagsLibrary_HasAnyTags final
{
public:
	struct FNexusBitSet                           Set;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FNexusBitSet                           OtherSet;                                          // 0x0020(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NexusBitTagsLibrary_HasAnyTags;

// Function GbxNexus.NexusBitTagsLibrary.HasTag
// 0x0030 (0x0030 - 0x0000)
struct NexusBitTagsLibrary_HasTag final
{
public:
	struct FNexusBitSet                           Set;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NexusBitTagsLibrary_HasTag;

// Function GbxNexus.NexusBPLibrary.ConfigFromYAML
// 0x0020 (0x0020 - 0x0000)
struct NexusBPLibrary_ConfigFromYAML final
{
public:
	class FString                                 YAMLStr;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNexusConfigDataBP                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusBPLibrary_ConfigFromYAML;

// Function GbxNexus.NexusBPLibrary.GetSubByIndex
// 0x0028 (0x0028 - 0x0000)
struct NexusBPLibrary_GetSubByIndex final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNexusConfigDataBP                     ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusBPLibrary_GetSubByIndex;

// Function GbxNexus.NexusBPLibrary.GetSubByName
// 0x0030 (0x0030 - 0x0000)
struct NexusBPLibrary_GetSubByName final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNexusConfigDataBP                     ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusBPLibrary_GetSubByName;

// Function GbxNexus.NexusBPLibrary.GetValueAsFloat
// 0x0018 (0x0018 - 0x0000)
struct NexusBPLibrary_GetValueAsFloat final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Default;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusBPLibrary_GetValueAsFloat;

// Function GbxNexus.NexusBPLibrary.GetValueAsInt32
// 0x0018 (0x0018 - 0x0000)
struct NexusBPLibrary_GetValueAsInt32 final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Default;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusBPLibrary_GetValueAsInt32;

// Function GbxNexus.NexusBPLibrary.GetValueAsString
// 0x0030 (0x0030 - 0x0000)
struct NexusBPLibrary_GetValueAsString final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Default;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusBPLibrary_GetValueAsString;

// Function GbxNexus.NexusBPLibrary.IsMap
// 0x0018 (0x0018 - 0x0000)
struct NexusBPLibrary_IsMap final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NexusBPLibrary_IsMap;

// Function GbxNexus.NexusBPLibrary.IsScalar
// 0x0018 (0x0018 - 0x0000)
struct NexusBPLibrary_IsScalar final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NexusBPLibrary_IsScalar;

// Function GbxNexus.NexusBPLibrary.IsSequence
// 0x0018 (0x0018 - 0x0000)
struct NexusBPLibrary_IsSequence final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NexusBPLibrary_IsSequence;

// Function GbxNexus.NexusBPLibrary.IsValid
// 0x0018 (0x0018 - 0x0000)
struct NexusBPLibrary_IsValid final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_NexusBPLibrary_IsValid;

// Function GbxNexus.NexusBPLibrary.ToString
// 0x0020 (0x0020 - 0x0000)
struct NexusBPLibrary_ToString final
{
public:
	struct FNexusConfigDataBP                     NCD;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusBPLibrary_ToString;

// Function GbxNexus.NexusConfigStoreMetaData.GetStructPropertyNames
// 0x0018 (0x0018 - 0x0000)
struct NexusConfigStoreMetaData_GetStructPropertyNames final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           OutNames;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusConfigStoreMetaData_GetStructPropertyNames;

// Function GbxNexus.NexusSerializeTestSettings.GetAvailableLayers
// 0x0010 (0x0010 - 0x0000)
struct NexusSerializeTestSettings_GetAvailableLayers final
{
public:
	TArray<class FName>                           OutLayers;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusSerializeTestSettings_GetAvailableLayers;

}

