#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxNexus

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum GbxNexus.ENexusBitSetOperator
// NumValues: 0x0004
enum class ENexusBitSetOperator : uint8
{
	AnyMatch                                 = 0,
	OverlapMatch                             = 1,
	ExactMatch                               = 2,
	ENexusBitSetOperator_MAX                 = 3,
};

// ScriptStruct GbxNexus.GbxDef
// 0x0010 (0x0018 - 0x0008)
struct FGbxDef : public FGbxHasStructType
{
public:
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxDef;

// ScriptStruct GbxNexus.NexusBitSet
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FNexusBitSet
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNexusBitSet;

// ScriptStruct GbxNexus.NexusBitSingleTag
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FNexusBitSingleTag
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNexusBitSingleTag;

// ScriptStruct GbxNexus.GbxGlobalDef
// 0x0008 (0x0020 - 0x0018)
struct FGbxGlobalDef : public FGbxDef
{
public:
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxGlobalDef;

// ScriptStruct GbxNexus.GbxDefMetaflags
// 0x0001 (0x0001 - 0x0000)
struct FGbxDefMetaflags final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxDefMetaflags;

// ScriptStruct GbxNexus.GbxNexusMetaData
// 0x0050 (0x0050 - 0x0000)
struct FGbxNexusMetaData final
{
public:
	TMap<class FName, class FString>              MetaData;                                          // 0x0000(0x0050)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxNexusMetaData;

// ScriptStruct GbxNexus.GbxMetaDataRule
// 0x0000 (0x0008 - 0x0008)
struct FGbxMetaDataRule : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FGbxMetaDataRule;

// ScriptStruct GbxNexus.GbxMetaDataStructRule
// 0x0000 (0x0008 - 0x0008)
struct FGbxMetaDataStructRule : public FGbxMetaDataRule
{
};
DUMPER7_ASSERTS_FGbxMetaDataStructRule;

// ScriptStruct GbxNexus.GbxMetaDataPropertyRule
// 0x0000 (0x0008 - 0x0008)
struct FGbxMetaDataPropertyRule : public FGbxMetaDataRule
{
};
DUMPER7_ASSERTS_FGbxMetaDataPropertyRule;

// ScriptStruct GbxNexus.GbxMetaDataFilterData
// 0x0028 (0x0028 - 0x0000)
struct FGbxMetaDataFilterData final
{
public:
	bool                                          bExcluded;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxInlineStruct>               StructRules;                                       // 0x0008(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FGbxInlineStruct>               PropertyRules;                                     // 0x0018(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxMetaDataFilterData;

// ScriptStruct GbxNexus.GbxMetaDataDef
// 0x00A8 (0x00C0 - 0x0018)
struct FGbxMetaDataDef final : public FGbxDef
{
public:
	class FName                                   packagename;                                       // 0x0018(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FGbxNexusMetaData>   Properties;                                        // 0x0020(0x0050)(Edit, DisableEditOnInstance, EditConst, NativeAccessSpecifierPrivate)
	TMap<class FName, struct FGbxMetaDataFilterData> Filters;                                        // 0x0070(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxMetaDataDef;

// ScriptStruct GbxNexus.GbxMetaDataFilterStructRule
// 0x0020 (0x0028 - 0x0008)
struct FGbxMetaDataFilterStructRule final : public FGbxMetaDataStructRule
{
public:
	TArray<TSoftObjectPtr<class UScriptStruct>>   IncludedStructs;                                   // 0x0008(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UScriptStruct>>   ExcludedStructs;                                   // 0x0018(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxMetaDataFilterStructRule;

// ScriptStruct GbxNexus.GbxMetaDataFilterPropertyRule
// 0x0020 (0x0028 - 0x0008)
struct FGbxMetaDataFilterPropertyRule final : public FGbxMetaDataPropertyRule
{
public:
	TArray<class FName>                           IncludedProperties;                                // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ExcludedProperties;                                // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxMetaDataFilterPropertyRule;

// ScriptStruct GbxNexus.NexusWeightedBitsInstance
// 0x0050 (0x0070 - 0x0020)
struct FNexusWeightedBitsInstance final : public FNexusBitSet
{
public:
	uint8                                         Pad_20[0x50];                                      // 0x0020(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNexusWeightedBitsInstance;

// ScriptStruct GbxNexus.NexusConfigDataBP
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FNexusConfigDataBP final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNexusConfigDataBP;

// ScriptStruct GbxNexus.GbxUICreditsQuery
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FGbxUICreditsQuery final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUICreditsQuery;

// ScriptStruct GbxNexus.GbxUICreditsLine
// 0x0028 (0x0028 - 0x0000)
struct FGbxUICreditsLine final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Text;                                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x8];                                       // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUICreditsLine;

// ScriptStruct GbxNexus.NexusStoreRedirect
// 0x0060 (0x0060 - 0x0000)
struct FNexusStoreRedirect final
{
public:
	struct FSName                                 OldRootIdent;                                      // 0x0000(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        OldCategoryId;                                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSName                                 NewRootIdent;                                      // 0x0030(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        NewCategoryId;                                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNexusStoreRedirect;

// ScriptStruct GbxNexus.NexusSourceInfo
// 0x0068 (0x0068 - 0x0000)
struct FNexusSourceInfo final
{
public:
	class FString                                 BuildTags;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RemoveBuildTags;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ContentTags;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RemoveContentTags;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LoadContextTags;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PakChunkId;                                        // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PakChunkIdForced;                                  // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   layer;                                             // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         revision;                                          // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         priority;                                          // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSourceInfo;

// ScriptStruct GbxNexus.NexusLayerInfo
// 0x0060 (0x0060 - 0x0000)
struct FNexusLayerInfo final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         order;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanDisable;                                        // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReadOnly;                                          // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CreateDataLayers;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ControlDataLayers;                                 // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNexusLayerInfo;

// ScriptStruct GbxNexus.NexusStoreBindingConfig
// 0x0030 (0x0030 - 0x0000)
struct FNexusStoreBindingConfig final
{
public:
	struct FSoftClassPath                         ClassPath;                                         // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnOrder;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasConfigs;                                        // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0xB];                                       // 0x0025(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNexusStoreBindingConfig;

// ScriptStruct GbxNexus.LoadingContextInfo
// 0x000C (0x000C - 0x0000)
struct FLoadingContextInfo final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLoadingContextInfo;

// ScriptStruct GbxNexus.NexusSerializeTestContentRef
// 0x0050 (0x0050 - 0x0000)
struct FNexusSerializeTestContentRef final
{
public:
	class FString                                 Description;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   layer;                                             // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FGbxDefPtrProperty_                           Content;                                           // 0x0018(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                        ContentStruct;                                     // 0x0030(0x0020)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FNexusSerializeTestContentRef;

// ScriptStruct GbxNexus.NexusSerializeTest_ArrayData
// 0x0010 (0x0010 - 0x0000)
struct FNexusSerializeTest_ArrayData final
{
public:
	TArray<class FString>                         StringArray;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_ArrayData;

// ScriptStruct GbxNexus.NexusSerializeTest_ArrayDef
// 0x0020 (0x0038 - 0x0018)
struct FNexusSerializeTest_ArrayDef final : public FGbxDef
{
public:
	struct FNexusSerializeTest_ArrayData          data;                                              // 0x0018(0x0010)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNexusSerializeTest_ArrayData>  ArrayData;                                         // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_ArrayDef;

// ScriptStruct GbxNexus.NexusSerializeTest_BasicTypes
// 0x01D0 (0x01D8 - 0x0008)
struct FNexusSerializeTest_BasicTypes final : public FGbxHasStructType
{
public:
	uint8                                         uint8_0;                                           // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x1];                                        // 0x0009(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        uint16_0;                                          // 0x000A(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        uint32_0;                                          // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        uint64_0;                                          // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8                                          int8_0;                                            // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x1];                                       // 0x0019(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int16                                         int16_0;                                           // 0x001A(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         int32_0;                                           // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         int64_0;                                           // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         float_0;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Double;                                            // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Bool;                                              // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x003C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         StringArray;                                       // 0x0058(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            StringMap;                                         // 0x0068(0x0050)(Edit, NativeAccessSpecifierPublic)
	TSet<class FString>                           StringSet;                                         // 0x00B8(0x0050)(Edit, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SoftObjectPath;                                    // 0x0108(0x0020)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 SoftObjectPtr;                                     // 0x0128(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   SoftClassPtr;                                      // 0x0150(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      GameDataHandleF;                                   // 0x0178(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      GameDataHandleT;                                   // 0x0190(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           GbxDefPtrF;                                        // 0x01A8(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           GbxDefPtrT;                                        // 0x01C0(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_BasicTypes;

// ScriptStruct GbxNexus.NexusSerializeTest_BasicDef
// 0x02A0 (0x02B8 - 0x0018)
struct FNexusSerializeTest_BasicDef final : public FGbxDef
{
public:
	struct FNexusSerializeTest_BasicTypes         BasicTypes;                                        // 0x0018(0x01D8)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxInlineStruct                       InlineBasicTypes;                                  // 0x01F0(0x0018)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FNexusSerializeTest_BasicTypes> BasicTypesArray;                                   // 0x0208(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FString, struct FNexusSerializeTest_BasicTypes> BasicTypesMap;                        // 0x0218(0x0050)(Edit, NativeAccessSpecifierPublic)
	TSet<struct FNexusSerializeTest_BasicTypes>   BasicTypesSet;                                     // 0x0268(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_BasicDef;

// ScriptStruct GbxNexus.NexusSerializeTest_GameplayTagData
// 0x0028 (0x0028 - 0x0000)
struct FNexusSerializeTest_GameplayTagData final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  TagContainer;                                      // 0x0008(0x0020)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_GameplayTagData;

// ScriptStruct GbxNexus.NexusSerializeTest_GameplayTagDef
// 0x0038 (0x0050 - 0x0018)
struct FNexusSerializeTest_GameplayTagDef final : public FGbxDef
{
public:
	struct FNexusSerializeTest_GameplayTagData    data;                                              // 0x0018(0x0028)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNexusSerializeTest_GameplayTagData> ArrayData;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_GameplayTagDef;

// ScriptStruct GbxNexus.NexusSerializeTest_MapData
// 0x0050 (0x0050 - 0x0000)
struct FNexusSerializeTest_MapData final
{
public:
	TMap<class FString, class FString>            StringMap;                                         // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_MapData;

// ScriptStruct GbxNexus.NexusSerializeTest_MapDef
// 0x00A0 (0x00B8 - 0x0018)
struct FNexusSerializeTest_MapDef final : public FGbxDef
{
public:
	struct FNexusSerializeTest_MapData            data;                                              // 0x0018(0x0050)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FNexusSerializeTest_MapData> MapData;                                 // 0x0068(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_MapDef;

// ScriptStruct GbxNexus.NexusTest_CallbackStruct
// 0x000C (0x000C - 0x0000)
struct FNexusTest_CallbackStruct final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusTest_CallbackStruct;

// ScriptStruct GbxNexus.NexusTest_OuterCallbackStruct
// 0x000C (0x000C - 0x0000)
struct FNexusTest_OuterCallbackStruct final
{
public:
	struct FNexusTest_CallbackStruct              Member;                                            // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusTest_OuterCallbackStruct;

// ScriptStruct GbxNexus.NexusTest_OuterOuterCallbackStruct
// 0x00F0 (0x00F0 - 0x0000)
struct FNexusTest_OuterOuterCallbackStruct final
{
public:
	struct FNexusTest_CallbackStruct              Member;                                            // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNexusTest_CallbackStruct              StaticArray[0x2];                                  // 0x000C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FNexusTest_CallbackStruct>      DynamicArray;                                      // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FNexusTest_CallbackStruct> Map;                                         // 0x0038(0x0050)(Edit, NativeAccessSpecifierPublic)
	TSet<struct FNexusTest_CallbackStruct>        Set;                                               // 0x0088(0x0050)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FNexusTest_OuterCallbackStruct> OuterDynamicArray;                                 // 0x00D8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNexusTest_OuterOuterCallbackStruct;

// ScriptStruct GbxNexus.NexusSerializeTest_SetData
// 0x0050 (0x0050 - 0x0000)
struct FNexusSerializeTest_SetData final
{
public:
	TSet<class FString>                           StringSet;                                         // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_SetData;

// ScriptStruct GbxNexus.NexusSerializeTest_SetDef
// 0x00A0 (0x00B8 - 0x0018)
struct FNexusSerializeTest_SetDef final : public FGbxDef
{
public:
	struct FNexusSerializeTest_SetData            data;                                              // 0x0018(0x0050)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<struct FNexusSerializeTest_SetData>      SetData;                                           // 0x0068(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusSerializeTest_SetDef;

// ScriptStruct GbxNexus.NexusStyleInfo
// 0x0020 (0x0020 - 0x0000)
struct FNexusStyleInfo final
{
public:
	class FName                                   DefStruct;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ThumbnailBrush;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Color;                                             // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNexusStyleInfo;

}

