#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxOnline

#include "Basic.hpp"

#include "GbxOnline_structs.hpp"
#include "Engine_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GbxOnline.GbxAchievementsSubsystem
// 0x0010 (0x0040 - 0x0030)
class UGbxAchievementsSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxAchievementsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxAchievementsSubsystem")
	}
	static class UGbxAchievementsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxAchievementsSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxAchievementsSubsystem;

// Class GbxOnline.GbxCommunicationsSubsystem
// 0x0010 (0x0040 - 0x0030)
class UGbxCommunicationsSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxCommunicationsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxCommunicationsSubsystem")
	}
	static class UGbxCommunicationsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxCommunicationsSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxCommunicationsSubsystem;

// Class GbxOnline.GbxCrossplayConfig
// 0x0008 (0x0030 - 0x0028)
class UGbxCrossplayConfig final : public UObject
{
public:
	bool                                          bRestrictCrossPlatformInvitesWhenCrossplayIsToggledOff; // 0x0028(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRestrictCrossPlatformJoinsWhenCrossplayIsToggledOff; // 0x0029(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlatformOnlyModeIsRequired;                       // 0x002A(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxCrossplayConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxCrossplayConfig")
	}
	static class UGbxCrossplayConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxCrossplayConfig>();
	}
};
DUMPER7_ASSERTS_UGbxCrossplayConfig;

// Class GbxOnline.GbxExternalUISubsystem
// 0x0010 (0x0040 - 0x0030)
class UGbxExternalUISubsystem final : public UGameInstanceSubsystem
{
public:
	bool                                          bExternalUIShouldPause;                            // 0x0030(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0xF];                                       // 0x0031(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxExternalUISubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxExternalUISubsystem")
	}
	static class UGbxExternalUISubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxExternalUISubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxExternalUISubsystem;

// Class GbxOnline.GbxFriendsSubsystem
// 0x0000 (0x0030 - 0x0030)
class UGbxFriendsSubsystem : public UGameInstanceSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxFriendsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxFriendsSubsystem")
	}
	static class UGbxFriendsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxFriendsSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxFriendsSubsystem;

// Class GbxOnline.GbxGameLicenseManagerSubsystem
// 0x0010 (0x0040 - 0x0030)
class UGbxGameLicenseManagerSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameLicenseManagerSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameLicenseManagerSubsystem")
	}
	static class UGbxGameLicenseManagerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameLicenseManagerSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxGameLicenseManagerSubsystem;

// Class GbxOnline.GbxMatchmakingSubsystem
// 0x0000 (0x0030 - 0x0030)
class UGbxMatchmakingSubsystem : public UGameInstanceSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxMatchmakingSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxMatchmakingSubsystem")
	}
	static class UGbxMatchmakingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxMatchmakingSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxMatchmakingSubsystem;

// Class GbxOnline.GbxOnlineLoginManager
// 0x01D8 (0x0208 - 0x0030)
class UGbxOnlineLoginManager : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x1D8];                                     // 0x0030(0x01D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxOnlineLoginManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxOnlineLoginManager")
	}
	static class UGbxOnlineLoginManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxOnlineLoginManager>();
	}
};
DUMPER7_ASSERTS_UGbxOnlineLoginManager;

// Class GbxOnline.GbxOnlineSessionClient
// 0x02D8 (0x04B8 - 0x01E0)
class UGbxOnlineSessionClient : public UOnlineSessionClient
{
public:
	uint8                                         Pad_1E0[0x2D8];                                    // 0x01E0(0x02D8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxOnlineSessionClient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxOnlineSessionClient")
	}
	static class UGbxOnlineSessionClient* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxOnlineSessionClient>();
	}
};
DUMPER7_ASSERTS_UGbxOnlineSessionClient;

// Class GbxOnline.GbxPresenceSubsystem
// 0x0000 (0x0030 - 0x0030)
class UGbxPresenceSubsystem : public UGameInstanceSubsystem
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxPresenceSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxPresenceSubsystem")
	}
	static class UGbxPresenceSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxPresenceSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxPresenceSubsystem;

// Class GbxOnline.GbxRecentFriendsSubsystem
// 0x0010 (0x0040 - 0x0030)
class UGbxRecentFriendsSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxRecentFriendsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxRecentFriendsSubsystem")
	}
	static class UGbxRecentFriendsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxRecentFriendsSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxRecentFriendsSubsystem;

// Class GbxOnline.GbxSocialSubsystem
// 0x0008 (0x0038 - 0x0030)
class UGbxSocialSubsystem : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxSocialSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxSocialSubsystem")
	}
	static class UGbxSocialSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxSocialSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxSocialSubsystem;

// Class GbxOnline.GbxTextChatSubsystem
// 0x0010 (0x0040 - 0x0030)
class UGbxTextChatSubsystem : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxTextChatSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxTextChatSubsystem")
	}
	static class UGbxTextChatSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxTextChatSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxTextChatSubsystem;

// Class GbxOnline.GbxVoice
// 0x01F0 (0x0220 - 0x0030)
class UGbxVoice : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EVoiceServiceName                             VoiceService;                                      // 0x0040(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bPlatformSupportsPushToTalk;                       // 0x0044(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_45[0x1DB];                                     // 0x0045(0x01DB)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxVoice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxVoice")
	}
	static class UGbxVoice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxVoice>();
	}
};
DUMPER7_ASSERTS_UGbxVoice;

}

