#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxOnline

#include "Basic.hpp"

#include "GbxNexus_structs.hpp"


namespace SDK
{

// Enum GbxOnline.EGbxMatchmakingState
// NumValues: 0x0007
enum class EGbxMatchmakingState : uint8
{
	None                                     = 0,
	Starting                                 = 1,
	InProgress                               = 2,
	ConfirmingPlayers                        = 3,
	ProcessingResult                         = 4,
	Stopping                                 = 5,
	EGbxMatchmakingState_MAX                 = 6,
};

// Enum GbxOnline.EGbxNetworkDestroyReason
// NumValues: 0x0007
enum class EGbxNetworkDestroyReason : uint8
{
	UnknownReason                            = 0,
	UnintentionalQuitGameplay                = 1,
	UnintentionalNetworkModeChange           = 2,
	IntentionalNetworkModeChange             = 3,
	IntentionalJoinNewParty                  = 4,
	IntentionalQuitGameplay                  = 5,
	EGbxNetworkDestroyReason_MAX             = 6,
};

// Enum GbxOnline.EVoiceServiceName
// NumValues: 0x0004
enum class EVoiceServiceName : uint32
{
	Discord                                  = 0,
	Vivox                                    = 1,
	Invalid                                  = 2,
	EVoiceServiceName_MAX                    = 3,
};

// ScriptStruct GbxOnline.RegionSettings
// 0x000C (0x000C - 0x0000)
struct FRegionSettings final
{
public:
	int32                                         PingStart;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpansionDelta;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxPing;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRegionSettings;

// ScriptStruct GbxOnline.GbxMatchmakingGlobals
// 0x0010 (0x0030 - 0x0020)
struct FGbxMatchmakingGlobals final : public FGbxGlobalDef
{
public:
	struct FRegionSettings                        RegionSettings;                                    // 0x0020(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxMatchmakingGlobals;

}

