#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxPrefab

#include "Basic.hpp"

#include "GbxEngine_structs.hpp"
#include "GbxGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GbxPrefab.EPrefabLayerShuffleType
// NumValues: 0x0004
enum class EPrefabLayerShuffleType : uint8
{
	AlwaysPresent                            = 0,
	Shuffled                                 = 1,
	None                                     = 2,
	EPrefabLayerShuffleType_MAX              = 3,
};

// Enum GbxPrefab.EPrefabLayerCollisionMode
// NumValues: 0x0004
enum class EPrefabLayerCollisionMode : uint8
{
	Default                                  = 0,
	DisableCollision                         = 1,
	Custom                                   = 2,
	EPrefabLayerCollisionMode_MAX            = 3,
};

// Enum GbxPrefab.EPrefabDecalMode
// NumValues: 0x0003
enum class EPrefabDecalMode : uint8
{
	Default                                  = 0,
	DisableReceivesDecals                    = 1,
	EPrefabDecalMode_MAX                     = 2,
};

// ScriptStruct GbxPrefab.GbxPrefabGbxBlockingVolumeParams
// 0x0020 (0x0020 - 0x0000)
struct FGbxPrefabGbxBlockingVolumeParams final
{
public:
	bool                                          bRender;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockGrenades;                                    // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockWeaponFire;                                  // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockUsingThings;                                 // 0x0003(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockBoosterPickups;                              // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockVehicles;                                    // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBlockPawns;                                       // 0x0006(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<FGbxDefPtrProperty_>                   TeamsToBlock;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bWalkable;                                         // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxPrefabGbxBlockingVolumeParams;

// ScriptStruct GbxPrefab.GbxPrefabHazardVolumeParams
// 0x00D0 (0x00D0 - 0x0000)
struct FGbxPrefabHazardVolumeParams final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      Interaction;                                       // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(FGameDataHandleProperty_ State, bool bIsInitialState)> OnInteractionStarted; // 0x0020(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bDamageOverride;                                   // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      damage;                                            // 0x0038(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EHazardPrimitiveCollectionType                DamagePrimitiveType;                               // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DamagePrimitiveNames;                              // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EHazardPrimitiveCollectionType                InteractionPrimitiveType;                          // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           InteractionPrimitiveNames;                         // 0x00A8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           EffectPrimitiveNames;                              // 0x00B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EHazardEffectSizeSourceType                   EffectSizeSource;                                  // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EffectSizeOverride;                                // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxPrefabHazardVolumeParams;

// ScriptStruct GbxPrefab.GbxPrefabBrushParams
// 0x0038 (0x0038 - 0x0000)
struct FGbxPrefabBrushParams final
{
public:
	TArray<struct FVector3f>                      Vertices;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIntVector>                     Triangles;                                         // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                   CollisionProfileName;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           BrushComponentTags;                                // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxPrefabBrushParams;

// ScriptStruct GbxPrefab.DynamicMaterialInstanceParams
// 0x0001 (0x0001 - 0x0000)
struct FDynamicMaterialInstanceParams final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDynamicMaterialInstanceParams;

// ScriptStruct GbxPrefab.GbxPrefabOverridableParams
// 0x0003 (0x0003 - 0x0000)
struct FGbxPrefabOverridableParams final
{
public:
	uint8                                         bOverrideHLODSettings : 1;                         // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAutoLODGeneration : 1;                      // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EHLODBatchingPolicy                           HLODBatchingPolicy;                                // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPrefabLayerCollisionMode                     CollisionMode;                                     // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxPrefabOverridableParams;

// ScriptStruct GbxPrefab.GbxPrefabLayerInfo
// 0x0038 (0x0038 - 0x0000)
struct FGbxPrefabLayerInfo final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGuid                                  UniqueID;                                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 Name;                                              // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPrefabLayerShuffleType                       ShuffleType;                                       // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxPrefabOverridableParams            OverridableParams;                                 // 0x0031(0x0003)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bInstanceEditable;                                 // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxPrefabLayerInfo;

// ScriptStruct GbxPrefab.GbxPrefabSpawnedActor
// 0x0001 (0x0001 - 0x0000)
struct FGbxPrefabSpawnedActor final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxPrefabSpawnedActor;

// ScriptStruct GbxPrefab.GbxPrefabComponentDebugInfo
// 0x0028 (0x0028 - 0x0000)
struct FGbxPrefabComponentDebugInfo final
{
public:
	class FString                                 ComponentUniqueId;                                 // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceActor;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ShuffleId;                                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxPrefabComponentDebugInfo;

// ScriptStruct GbxPrefab.GbxPrefabLayerInfoNode
// 0x0001 (0x0001 - 0x0000)
struct FGbxPrefabLayerInfoNode final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxPrefabLayerInfoNode;

// ScriptStruct GbxPrefab.GbxPrefabInstanceShufflingParams
// 0x0001 (0x0001 - 0x0000)
struct FGbxPrefabInstanceShufflingParams final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxPrefabInstanceShufflingParams;

// ScriptStruct GbxPrefab.GbxPrefabPickedLayerInfo
// 0x0001 (0x0001 - 0x0000)
struct FGbxPrefabPickedLayerInfo final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxPrefabPickedLayerInfo;

// ScriptStruct GbxPrefab.GBxPrefabModifierData
// 0x0001 (0x0001 - 0x0000)
struct FGBxPrefabModifierData final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGBxPrefabModifierData;

// ScriptStruct GbxPrefab.GbxPrefabInstanceParams
// 0x0001 (0x0001 - 0x0000)
struct FGbxPrefabInstanceParams final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxPrefabInstanceParams;

}

