#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxPackedLevelStreamingCell

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GbxPackedLevelStreamingCell_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GbxPackedLevelStreamingCell.GbxPackedLevelStreamingCell
// 0x0058 (0x03E8 - 0x0390)
class AGbxPackedLevelStreamingCell final : public AActor
{
public:
	struct FGbxPackedLevelStreamingCellData       PackedData;                                        // 0x0390(0x0058)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxPackedLevelStreamingCell")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxPackedLevelStreamingCell")
	}
	static class AGbxPackedLevelStreamingCell* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxPackedLevelStreamingCell>();
	}
};
DUMPER7_ASSERTS_AGbxPackedLevelStreamingCell;

// Class GbxPackedLevelStreamingCell.WorldPartitionRuntimeCellTransformerGbxISM
// 0x0000 (0x0028 - 0x0028)
class UWorldPartitionRuntimeCellTransformerGbxISM final : public UWorldPartitionRuntimeCellTransformer
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WorldPartitionRuntimeCellTransformerGbxISM")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WorldPartitionRuntimeCellTransformerGbxISM")
	}
	static class UWorldPartitionRuntimeCellTransformerGbxISM* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldPartitionRuntimeCellTransformerGbxISM>();
	}
};
DUMPER7_ASSERTS_UWorldPartitionRuntimeCellTransformerGbxISM;

// Class GbxPackedLevelStreamingCell.GbxPackedLevelStreamingSettings
// 0x0068 (0x00A0 - 0x0038)
class UGbxPackedLevelStreamingSettings final : public UDeveloperSettings
{
public:
	EGbxPackedLevelStreamingMode                  Mode;                                              // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxPackedLevelStreamingBuilderCustomSettingsGroup Default;                               // 0x0040(0x0040)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<struct FGbxPackedLevelStreamingBuilderCustomSettingsGroup> Alternates;                    // 0x0080(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	uint32                                        MinNumInstances;                                   // 0x0090(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0xC];                                       // 0x0094(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxPackedLevelStreamingSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxPackedLevelStreamingSettings")
	}
	static class UGbxPackedLevelStreamingSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxPackedLevelStreamingSettings>();
	}
};
DUMPER7_ASSERTS_UGbxPackedLevelStreamingSettings;

}

