#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxPhysics

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GbxPhysics_structs.hpp"


namespace SDK::Params
{

// Function GbxPhysics.GbxPhysicsStatics.DebugResumeSimulation
// 0x0010 (0x0010 - 0x0000)
struct GbxPhysicsStatics_DebugResumeSimulation final
{
public:
	class USkeletalMeshComponent*                 SkelMesh;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPhysicsStatics_DebugResumeSimulation;

// Function GbxPhysics.GbxPhysicsStatics.DebugStepSimulation
// 0x0010 (0x0010 - 0x0000)
struct GbxPhysicsStatics_DebugStepSimulation final
{
public:
	class USkeletalMeshComponent*                 SkelMesh;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPhysicsStatics_DebugStepSimulation;

// Function GbxPhysics.GbxPhysicsStatics.GetSimulationEnabled
// 0x0020 (0x0020 - 0x0000)
struct GbxPhysicsStatics_GetSimulationEnabled final
{
public:
	TScriptInterface<class IForwardDynamicsInterface> DynamicsInterface;                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxPhysicsStatics_GetSimulationEnabled;

// Function GbxPhysics.GbxPhysicsStatics.ResetActorExtraCollisionFilter
// 0x0008 (0x0008 - 0x0000)
struct GbxPhysicsStatics_ResetActorExtraCollisionFilter final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPhysicsStatics_ResetActorExtraCollisionFilter;

// Function GbxPhysics.GbxPhysicsStatics.ResetExtraCollisionFilter
// 0x0010 (0x0010 - 0x0000)
struct GbxPhysicsStatics_ResetExtraCollisionFilter final
{
public:
	class USceneComponent*                        comp;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxPhysicsStatics_ResetExtraCollisionFilter;

// Function GbxPhysics.GbxPhysicsStatics.SetActorExtraCollisionFilter
// 0x0010 (0x0010 - 0x0000)
struct GbxPhysicsStatics_SetActorExtraCollisionFilter final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EExtraCollisionFilterChannel                  channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExtraCollisionFilter                  ExtraCollisionFilter;                              // 0x0009(0x0006)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxPhysicsStatics_SetActorExtraCollisionFilter;

// Function GbxPhysics.GbxPhysicsStatics.SetDynamicsBehavior
// 0x0020 (0x0020 - 0x0000)
struct GbxPhysicsStatics_SetDynamicsBehavior final
{
public:
	TScriptInterface<class IForwardDynamicsInterface> DynamicsInterface;                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BehaviorName;                                      // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0018(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPhysicsStatics_SetDynamicsBehavior;

// Function GbxPhysics.GbxPhysicsStatics.SetExtraCollisionFilter
// 0x0010 (0x0010 - 0x0000)
struct GbxPhysicsStatics_SetExtraCollisionFilter final
{
public:
	class USceneComponent*                        comp;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EExtraCollisionFilterChannel                  channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExtraCollisionFilter                  ExtraCollisionFilter;                              // 0x0009(0x0006)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x000F(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPhysicsStatics_SetExtraCollisionFilter;

// Function GbxPhysics.GbxPhysicsStatics.SetORDARSimulationEnabled
// 0x0018 (0x0018 - 0x0000)
struct GbxPhysicsStatics_SetORDARSimulationEnabled final
{
public:
	class USkeletalMeshComponent*                 SkelMesh;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Tag;                                               // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxPhysicsStatics_SetORDARSimulationEnabled;

// Function GbxPhysics.GbxPhysicsStatics.SetSimulationEnabled
// 0x0020 (0x0020 - 0x0000)
struct GbxPhysicsStatics_SetSimulationEnabled final
{
public:
	TScriptInterface<class IForwardDynamicsInterface> DynamicsInterface;                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Tag;                                               // 0x0014(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxPhysicsStatics_SetSimulationEnabled;

}

