#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxPrefab

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GbxPrefab.GbxPrefabComponentModifierInterface.CanModifyComponent
// 0x0010 (0x0010 - 0x0000)
struct GbxPrefabComponentModifierInterface_CanModifyComponent final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxPrefabComponentModifierInterface_CanModifyComponent;

// Function GbxPrefab.GbxPrefabComponentModifierInterface.GetInstanceParametersStruct
// 0x0008 (0x0008 - 0x0000)
struct GbxPrefabComponentModifierInterface_GetInstanceParametersStruct final
{
public:
	class UScriptStruct*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPrefabComponentModifierInterface_GetInstanceParametersStruct;

// Function GbxPrefab.GbxPrefabComponentModifierInterface.GetInstanceParamName
// 0x0010 (0x0010 - 0x0000)
struct GbxPrefabComponentModifierInterface_GetInstanceParamName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPrefabComponentModifierInterface_GetInstanceParamName;

// Function GbxPrefab.GbxPrefabComponentModifierInterface.GetModifierTag
// 0x0010 (0x0010 - 0x0000)
struct GbxPrefabComponentModifierInterface_GetModifierTag final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPrefabComponentModifierInterface_GetModifierTag;

// Function GbxPrefab.GbxPrefabComponentModifierInterface.IsInstanceEditable
// 0x0001 (0x0001 - 0x0000)
struct GbxPrefabComponentModifierInterface_IsInstanceEditable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPrefabComponentModifierInterface_IsInstanceEditable;

// Function GbxPrefab.GbxPrefabComponentModifierInterface.ModifyComponent
// 0x0010 (0x0010 - 0x0000)
struct GbxPrefabComponentModifierInterface_ModifyComponent final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRandomStream                          RandomStream;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPrefabComponentModifierInterface_ModifyComponent;

}

