#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxSpawn

#include "Basic.hpp"

#include "GbxEngine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GbxSpawn_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GbxSpawn.gbxactor.GetSpawnEncounter
// 0x0008 (0x0008 - 0x0000)
struct gbxactor_GetSpawnEncounter final
{
public:
	class ASpawnEncounter*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_gbxactor_GetSpawnEncounter;

// Function GbxSpawn.gbxactor.GetSpawner
// 0x0008 (0x0008 - 0x0000)
struct gbxactor_GetSpawner final
{
public:
	class ASpawner*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_gbxactor_GetSpawner;

// Function GbxSpawn.gbxactor.GetSpawnerComponent
// 0x0008 (0x0008 - 0x0000)
struct gbxactor_GetSpawnerComponent final
{
public:
	class USpawnerComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_gbxactor_GetSpawnerComponent;

// Function GbxSpawn.GbxActorDefBlueprintFunctionLibrary.GetBlackboardActorDef
// 0x0030 (0x0030 - 0x0000)
struct GbxActorDefBlueprintFunctionLibrary_GetBlackboardActorDef final
{
public:
	struct FGbxBlackboardEntryRef                 BlackboardKey;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                OwnerContext;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorDefBlueprintFunctionLibrary_GetBlackboardActorDef;

// Function GbxSpawn.GbxActorDefBlueprintFunctionLibrary.GetBlackboardActorDefHandle
// 0x0030 (0x0030 - 0x0000)
struct GbxActorDefBlueprintFunctionLibrary_GetBlackboardActorDefHandle final
{
public:
	struct FGbxBlackboardEntryRef                 BlackboardKey;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                OwnerContext;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorDefBlueprintFunctionLibrary_GetBlackboardActorDefHandle;

// Function GbxSpawn.GbxActorDefBlueprintFunctionLibrary.GetBlackboardActorDefHandlePure
// 0x0030 (0x0030 - 0x0000)
struct GbxActorDefBlueprintFunctionLibrary_GetBlackboardActorDefHandlePure final
{
public:
	struct FGbxBlackboardEntryRef                 BlackboardKey;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                OwnerContext;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorDefBlueprintFunctionLibrary_GetBlackboardActorDefHandlePure;

// Function GbxSpawn.GbxActorDefBlueprintFunctionLibrary.GetBlackboardActorDefPure
// 0x0030 (0x0030 - 0x0000)
struct GbxActorDefBlueprintFunctionLibrary_GetBlackboardActorDefPure final
{
public:
	struct FGbxBlackboardEntryRef                 BlackboardKey;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                OwnerContext;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorDefBlueprintFunctionLibrary_GetBlackboardActorDefPure;

// Function GbxSpawn.GbxActorDefBlueprintFunctionLibrary.GetEnemiesActorDefHandles
// 0x0010 (0x0010 - 0x0000)
struct GbxActorDefBlueprintFunctionLibrary_GetEnemiesActorDefHandles final
{
public:
	TArray<FGameDataHandleProperty_>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorDefBlueprintFunctionLibrary_GetEnemiesActorDefHandles;

// Function GbxSpawn.GbxActorDefBlueprintFunctionLibrary.GetEnemiesActorDefInfo
// 0x0038 (0x0038 - 0x0000)
struct GbxActorDefBlueprintFunctionLibrary_GetEnemiesActorDefInfo final
{
public:
	struct FGameplayTagContainer                  BossTags;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bRemovePossibleDuplicates;                         // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxEnemyActorDefInfo>          ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorDefBlueprintFunctionLibrary_GetEnemiesActorDefInfo;

// Function GbxSpawn.GbxActorDefBlueprintFunctionLibrary.GetEnemiesActorDefStrings
// 0x0010 (0x0010 - 0x0000)
struct GbxActorDefBlueprintFunctionLibrary_GetEnemiesActorDefStrings final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorDefBlueprintFunctionLibrary_GetEnemiesActorDefStrings;

// Function GbxSpawn.GbxActorDefBlueprintFunctionLibrary.SetBlackboardActorDef
// 0x0030 (0x0030 - 0x0000)
struct GbxActorDefBlueprintFunctionLibrary_SetBlackboardActorDef final
{
public:
	struct FGbxBlackboardEntryRef                 BlackboardKey;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           Value;                                             // 0x0010(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OwnerContext;                                      // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorDefBlueprintFunctionLibrary_SetBlackboardActorDef;

// Function GbxSpawn.GbxActorDefBlueprintFunctionLibrary.SetBlackboardActorDefHandle
// 0x0030 (0x0030 - 0x0000)
struct GbxActorDefBlueprintFunctionLibrary_SetBlackboardActorDefHandle final
{
public:
	struct FGbxBlackboardEntryRef                 BlackboardKey;                                     // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      Value;                                             // 0x0010(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OwnerContext;                                      // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxActorDefBlueprintFunctionLibrary_SetBlackboardActorDefHandle;

// Function GbxSpawn.GbxGameplayTagStatics.GbxActor_AddTag
// 0x0010 (0x0010 - 0x0000)
struct GbxGameplayTagStatics_GbxActor_AddTag final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxGameplayTagStatics_GbxActor_AddTag;

// Function GbxSpawn.GbxGameplayTagStatics.GbxActor_HasAllTags
// 0x0030 (0x0030 - 0x0000)
struct GbxGameplayTagStatics_GbxActor_HasAllTags final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  tags;                                              // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxGameplayTagStatics_GbxActor_HasAllTags;

// Function GbxSpawn.GbxGameplayTagStatics.GbxActor_HasAnyTags
// 0x0030 (0x0030 - 0x0000)
struct GbxGameplayTagStatics_GbxActor_HasAnyTags final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  tags;                                              // 0x0008(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxGameplayTagStatics_GbxActor_HasAnyTags;

// Function GbxSpawn.GbxGameplayTagStatics.GbxActor_HasTag
// 0x0018 (0x0018 - 0x0000)
struct GbxGameplayTagStatics_GbxActor_HasTag final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxGameplayTagStatics_GbxActor_HasTag;

// Function GbxSpawn.GbxGameplayTagStatics.GbxActor_RemoveTag
// 0x0018 (0x0018 - 0x0000)
struct GbxGameplayTagStatics_GbxActor_RemoveTag final
{
public:
	class UObject*                                Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           Tag;                                               // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxGameplayTagStatics_GbxActor_RemoveTag;

// Function GbxSpawn.GbxPreviewComponent.GetPreviewOptions
// 0x0010 (0x0010 - 0x0000)
struct GbxPreviewComponent_GetPreviewOptions final
{
public:
	TArray<class FName>                           OutOptions;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxPreviewComponent_GetPreviewOptions;

// Function GbxSpawn.SpawnBlueprintLibrary.EqualEqual_GbxActorDef
// 0x0038 (0x0038 - 0x0000)
struct SpawnBlueprintLibrary_EqualEqual_GbxActorDef final
{
public:
	FGameDataHandleProperty_                      A;                                                 // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      B;                                                 // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_EqualEqual_GbxActorDef;

// Function GbxSpawn.SpawnBlueprintLibrary.GbxSpawnActorAtSpawnPoint
// 0x0068 (0x0068 - 0x0000)
struct SpawnBlueprintLibrary_GbxSpawnActorAtSpawnPoint final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      GbxActorDef;                                       // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASpawnPoint*                            SpawnPoint;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 owner;                                             // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  instigator;                                        // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSpawnDetails                          SpawnDetails;                                      // 0x0038(0x000C)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bIsCritical;                                       // 0x0044(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Result;                                            // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0050(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GbxSpawnActorAtSpawnPoint;

// Function GbxSpawn.SpawnBlueprintLibrary.GbxSpawnActorAtSpawnPointComponent
// 0x0068 (0x0068 - 0x0000)
struct SpawnBlueprintLibrary_GbxSpawnActorAtSpawnPointComponent final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      GbxActorDef;                                       // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpawnPointComponent*                   SpawnPointComponent;                               // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 owner;                                             // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  instigator;                                        // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSpawnDetails                          SpawnDetails;                                      // 0x0038(0x000C)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bIsCritical;                                       // 0x0044(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Result;                                            // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0050(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GbxSpawnActorAtSpawnPointComponent;

// Function GbxSpawn.SpawnBlueprintLibrary.GbxSpawnActorAtTransform
// 0x00C0 (0x00C0 - 0x0000)
struct SpawnBlueprintLibrary_GbxSpawnActorAtTransform final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      GbxActorDef;                                       // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0020(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 owner;                                             // 0x0080(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                  instigator;                                        // 0x0088(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSpawnDetails                          SpawnDetails;                                      // 0x0090(0x000C)(Parm, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bIsCritical;                                       // 0x009C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Result;                                            // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x00A8(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GbxSpawnActorAtTransform;

// Function GbxSpawn.SpawnBlueprintLibrary.GbxSpawnSystemRestore
// 0x0008 (0x0008 - 0x0000)
struct SpawnBlueprintLibrary_GbxSpawnSystemRestore final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GbxSpawnSystemRestore;

// Function GbxSpawn.SpawnBlueprintLibrary.GbxSpawnSystemSaveAndReset
// 0x0008 (0x0008 - 0x0000)
struct SpawnBlueprintLibrary_GbxSpawnSystemSaveAndReset final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GbxSpawnSystemSaveAndReset;

// Function GbxSpawn.SpawnBlueprintLibrary.GetGbxActorDefinition
// 0x0020 (0x0020 - 0x0000)
struct SpawnBlueprintLibrary_GetGbxActorDefinition final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GetGbxActorDefinition;

// Function GbxSpawn.SpawnBlueprintLibrary.GetGbxActorDefPure
// 0x0020 (0x0020 - 0x0000)
struct SpawnBlueprintLibrary_GetGbxActorDefPure final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GetGbxActorDefPure;

// Function GbxSpawn.SpawnBlueprintLibrary.GetSpawnEncounter
// 0x0010 (0x0010 - 0x0000)
struct SpawnBlueprintLibrary_GetSpawnEncounter final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASpawnEncounter*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GetSpawnEncounter;

// Function GbxSpawn.SpawnBlueprintLibrary.GetSpawner
// 0x0010 (0x0010 - 0x0000)
struct SpawnBlueprintLibrary_GetSpawner final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASpawner*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GetSpawner;

// Function GbxSpawn.SpawnBlueprintLibrary.GetSpawnerComponent
// 0x0010 (0x0010 - 0x0000)
struct SpawnBlueprintLibrary_GetSpawnerComponent final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpawnerComponent*                      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_GetSpawnerComponent;

// Function GbxSpawn.SpawnBlueprintLibrary.HasGbxActorDef
// 0x0028 (0x0028 - 0x0000)
struct SpawnBlueprintLibrary_HasGbxActorDef final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      GbxActorDef;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_HasGbxActorDef;

// Function GbxSpawn.SpawnBlueprintLibrary.HasGbxActorDefBranch
// 0x0028 (0x0028 - 0x0000)
struct SpawnBlueprintLibrary_HasGbxActorDefBranch final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      GbxActorDef;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SpawnBlueprintLibrary_HasGbxActorDefBranch;

// Function GbxSpawn.SpawnEncounter.ResetEncounter
// 0x0001 (0x0001 - 0x0000)
struct SpawnEncounter_ResetEncounter final
{
public:
	bool                                          bDestroyActors;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnEncounter_ResetEncounter;

// Function GbxSpawn.SpawnEncounter.SetEncounterEnabled
// 0x0001 (0x0001 - 0x0000)
struct SpawnEncounter_SetEncounterEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnEncounter_SetEncounterEnabled;

// Function GbxSpawn.SpawnEncounter.GetCurrentWaveIndex
// 0x0004 (0x0004 - 0x0000)
struct SpawnEncounter_GetCurrentWaveIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnEncounter_GetCurrentWaveIndex;

// Function GbxSpawn.SpawnEncounter.IsEncounterComplete
// 0x0001 (0x0001 - 0x0000)
struct SpawnEncounter_IsEncounterComplete final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnEncounter_IsEncounterComplete;

// Function GbxSpawn.SpawnEncounter.IsEncounterEnabled
// 0x0001 (0x0001 - 0x0000)
struct SpawnEncounter_IsEncounterEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnEncounter_IsEncounterEnabled;

// Function GbxSpawn.SpawnPoint.IsSpawnPointEnabled
// 0x0001 (0x0001 - 0x0000)
struct SpawnPoint_IsSpawnPointEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnPoint_IsSpawnPointEnabled;

// Function GbxSpawn.SpawnPoint.SetSpawnPointEnabled
// 0x0001 (0x0001 - 0x0000)
struct SpawnPoint_SetSpawnPointEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnPoint_SetSpawnPointEnabled;

// Function GbxSpawn.SpawnPoint.GetSpawnPointComponent
// 0x0008 (0x0008 - 0x0000)
struct SpawnPoint_GetSpawnPointComponent final
{
public:
	class USpawnPointComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnPoint_GetSpawnPointComponent;

// Function GbxSpawn.Spawner.DestroyOnAllDied
// 0x0008 (0x0008 - 0x0000)
struct Spawner_DestroyOnAllDied final
{
public:
	class ASpawner*                               Spawner;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_DestroyOnAllDied;

// Function GbxSpawn.Spawner.IsSpawnerEnabled
// 0x0001 (0x0001 - 0x0000)
struct Spawner_IsSpawnerEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_IsSpawnerEnabled;

// Function GbxSpawn.Spawner.ResetSpawner
// 0x0001 (0x0001 - 0x0000)
struct Spawner_ResetSpawner final
{
public:
	bool                                          bDestroyActors;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_ResetSpawner;

// Function GbxSpawn.Spawner.SetGbxActorDef
// 0x0020 (0x0020 - 0x0000)
struct Spawner_SetGbxActorDef final
{
public:
	FGameDataHandleProperty_                      NewGbxActorDef;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyExistingActors;                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Spawner_SetGbxActorDef;

// Function GbxSpawn.Spawner.SetNextSpawnOverride
// 0x0038 (0x0038 - 0x0000)
struct Spawner_SetNextSpawnOverride final
{
public:
	FGameDataHandleProperty_                      NewNextSpawnOverrideHandle;                        // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESetNextSpawnOutputState                      Exec;                                              // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0020(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_SetNextSpawnOverride;

// Function GbxSpawn.Spawner.SetSpawnerEnabled
// 0x0001 (0x0001 - 0x0000)
struct Spawner_SetSpawnerEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_SetSpawnerEnabled;

// Function GbxSpawn.Spawner.GetAliveActors
// 0x0018 (0x0018 - 0x0000)
struct Spawner_GetAliveActors final
{
public:
	ESpawnedActorType                             ActorType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeLinkedSpawners;                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_GetAliveActors;

// Function GbxSpawn.Spawner.GetNumAliveActors
// 0x0008 (0x0008 - 0x0000)
struct Spawner_GetNumAliveActors final
{
public:
	ESpawnedActorType                             type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_GetNumAliveActors;

// Function GbxSpawn.Spawner.GetNumDeadActors
// 0x0008 (0x0008 - 0x0000)
struct Spawner_GetNumDeadActors final
{
public:
	ESpawnedActorType                             type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_GetNumDeadActors;

// Function GbxSpawn.Spawner.GetNumSpawnedActors
// 0x0008 (0x0008 - 0x0000)
struct Spawner_GetNumSpawnedActors final
{
public:
	ESpawnedActorType                             type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_GetNumSpawnedActors;

// Function GbxSpawn.Spawner.GetNumTotalActors
// 0x0004 (0x0004 - 0x0000)
struct Spawner_GetNumTotalActors final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_GetNumTotalActors;

// Function GbxSpawn.Spawner.GetSpawnerComponent
// 0x0008 (0x0008 - 0x0000)
struct Spawner_GetSpawnerComponent final
{
public:
	class USpawnerComponent*                      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_GetSpawnerComponent;

// Function GbxSpawn.Spawner.HaveAllDied
// 0x0002 (0x0002 - 0x0000)
struct Spawner_HaveAllDied final
{
public:
	ESpawnedActorType                             type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_HaveAllDied;

// Function GbxSpawn.Spawner.HaveAllSpawned
// 0x0001 (0x0001 - 0x0000)
struct Spawner_HaveAllSpawned final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Spawner_HaveAllSpawned;

// Function GbxSpawn.SpawnPointComponent.SetSpawnPointAnimTag
// 0x0008 (0x0008 - 0x0000)
struct SpawnPointComponent_SetSpawnPointAnimTag final
{
public:
	struct FGameplayTag                           AnimTag;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnPointComponent_SetSpawnPointAnimTag;

// Function GbxSpawn.SpawnPointComponent.SetSpawnPointEnabled
// 0x0001 (0x0001 - 0x0000)
struct SpawnPointComponent_SetSpawnPointEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnPointComponent_SetSpawnPointEnabled;

// Function GbxSpawn.SpawnPointComponent.IsSpawnPointEnabled
// 0x0001 (0x0001 - 0x0000)
struct SpawnPointComponent_IsSpawnPointEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnPointComponent_IsSpawnPointEnabled;

// Function GbxSpawn.SpawnPointComponent.ShouldHideStretchyPointEditWidget
// 0x0001 (0x0001 - 0x0000)
struct SpawnPointComponent_ShouldHideStretchyPointEditWidget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnPointComponent_ShouldHideStretchyPointEditWidget;

// Function GbxSpawn.SpawnerComponent.GetPlayerCountSpawnRowOptions
// 0x0010 (0x0010 - 0x0000)
struct SpawnerComponent_GetPlayerCountSpawnRowOptions final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_GetPlayerCountSpawnRowOptions;

// Function GbxSpawn.SpawnerComponent.IsSpawnerEnabled
// 0x0001 (0x0001 - 0x0000)
struct SpawnerComponent_IsSpawnerEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_IsSpawnerEnabled;

// Function GbxSpawn.SpawnerComponent.PopActorDef
// 0x000C (0x000C - 0x0000)
struct SpawnerComponent_PopActorDef final
{
public:
	class FName                                   reason;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyExistingActors;                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SpawnerComponent_PopActorDef;

// Function GbxSpawn.SpawnerComponent.PushActorDef
// 0x0028 (0x0028 - 0x0000)
struct SpawnerComponent_PushActorDef final
{
public:
	class FName                                   reason;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           NewGbxActorDef;                                    // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyExistingActors;                            // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SpawnerComponent_PushActorDef;

// Function GbxSpawn.SpawnerComponent.ResetSpawner
// 0x0001 (0x0001 - 0x0000)
struct SpawnerComponent_ResetSpawner final
{
public:
	bool                                          bDestroyActors;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_ResetSpawner;

// Function GbxSpawn.SpawnerComponent.SetGbxActorDef
// 0x0020 (0x0020 - 0x0000)
struct SpawnerComponent_SetGbxActorDef final
{
public:
	FGameDataHandleProperty_                      NewGbxActorDef;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDestroyExistingActors;                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SpawnerComponent_SetGbxActorDef;

// Function GbxSpawn.SpawnerComponent.SetSpawnerEnabled
// 0x0001 (0x0001 - 0x0000)
struct SpawnerComponent_SetSpawnerEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_SetSpawnerEnabled;

// Function GbxSpawn.SpawnerComponent.GetAliveActors
// 0x0018 (0x0018 - 0x0000)
struct SpawnerComponent_GetAliveActors final
{
public:
	ESpawnedActorType                             ActorType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeGroupedSpawners;                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_GetAliveActors;

// Function GbxSpawn.SpawnerComponent.GetNumAliveActors
// 0x0008 (0x0008 - 0x0000)
struct SpawnerComponent_GetNumAliveActors final
{
public:
	ESpawnedActorType                             type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_GetNumAliveActors;

// Function GbxSpawn.SpawnerComponent.GetNumDeadActors
// 0x0008 (0x0008 - 0x0000)
struct SpawnerComponent_GetNumDeadActors final
{
public:
	ESpawnedActorType                             type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_GetNumDeadActors;

// Function GbxSpawn.SpawnerComponent.GetNumSpawnedActors
// 0x0008 (0x0008 - 0x0000)
struct SpawnerComponent_GetNumSpawnedActors final
{
public:
	ESpawnedActorType                             type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_GetNumSpawnedActors;

// Function GbxSpawn.SpawnerComponent.GetNumTotalActors
// 0x0004 (0x0004 - 0x0000)
struct SpawnerComponent_GetNumTotalActors final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_GetNumTotalActors;

// Function GbxSpawn.SpawnerComponent.HaveAllDied
// 0x0002 (0x0002 - 0x0000)
struct SpawnerComponent_HaveAllDied final
{
public:
	ESpawnedActorType                             type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_HaveAllDied;

// Function GbxSpawn.SpawnerComponent.HaveAllSpawned
// 0x0001 (0x0001 - 0x0000)
struct SpawnerComponent_HaveAllSpawned final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerComponent_HaveAllSpawned;

}

