#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GbxSpline.EGbxSplineClutterType
// NumValues: 0x0003
enum class EGbxSplineClutterType : uint8
{
	StaticMesh                               = 0,
	Actor                                    = 1,
	EGbxSplineClutterType_MAX                = 2,
};

// Enum GbxSpline.EGbxSplineClutterAnchorPoint
// NumValues: 0x0006
enum class EGbxSplineClutterAnchorPoint : uint8
{
	Spline                                   = 0,
	LeftmostLane                             = 1,
	RightmostLane                            = 2,
	LeftShoulder                             = 3,
	RightShoulder                            = 4,
	EGbxSplineClutterAnchorPoint_MAX         = 5,
};

// Enum GbxSpline.EGbxSplineConfigSource
// NumValues: 0x0004
enum class EGbxSplineConfigSource : uint8
{
	SplinePreset                             = 0,
	FeaturePreset                            = 1,
	ManualEntry                              = 2,
	EGbxSplineConfigSource_MAX               = 3,
};

// ScriptStruct GbxSpline.GbxSplineClutterLayer
// 0x0001 (0x0001 - 0x0000)
struct FGbxSplineClutterLayer final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxSplineClutterLayer;

// ScriptStruct GbxSpline.GbxSplineClutterBasisPoints
// 0x0060 (0x0060 - 0x0000)
struct FGbxSplineClutterBasisPoints final
{
public:
	struct FVector                                SplineLocation;                                    // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SplineDirection;                                   // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SideVector;                                        // 0x0030(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                AnchorLocation;                                    // 0x0048(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxSplineClutterBasisPoints;

// ScriptStruct GbxSpline.GbxSplineClutterLandscapeInteractionParameters
// 0x0014 (0x0014 - 0x0000)
struct FGbxSplineClutterLandscapeInteractionParameters final
{
public:
	bool                                          bPlaceOnlyOnLandscape;                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdjustHeightByTerrain;                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxLoweringDistance;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRaisingDistance;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdjustOrientationByTerrain;                       // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxOrientationAdjustmentDegrees;                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxSplineClutterLandscapeInteractionParameters;

// ScriptStruct GbxSpline.GbxSplineClutterObjectExclusionParameters
// 0x0008 (0x0008 - 0x0000)
struct FGbxSplineClutterObjectExclusionParameters final
{
public:
	bool                                          bPreventOverlappingPlacement;                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSampleLandscapeExclusionLayer;                    // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LandscapeExclusionLayerWeightThreshold;            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxSplineClutterObjectExclusionParameters;

// ScriptStruct GbxSpline.GbxSplineClutterEntryCreationParams
// 0x00A0 (0x00A0 - 0x0000)
struct FGbxSplineClutterEntryCreationParams final
{
public:
	class UGbxSplineClutterRuleBase*              GeneratingRule;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class IGbxSplineSegment>     Segment;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxSplineClutterObject*                Object;                                            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxSplineClutterAnchorPoint                  AnchorPoint;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             VarianceTransform;                                 // 0x0040(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxSplineClutterEntryCreationParams;

// ScriptStruct GbxSpline.GbxLandscapeSplineEdgeMeshes
// 0x0010 (0x0010 - 0x0000)
struct FGbxLandscapeSplineEdgeMeshes final
{
public:
	class UStaticMesh*                            Shoulder;                                          // 0x0000(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            LaneAdapter;                                       // 0x0008(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxLandscapeSplineEdgeMeshes;

// ScriptStruct GbxSpline.GbxSplineClutterArray
// 0x0010 (0x0010 - 0x0000)
struct FGbxSplineClutterArray final
{
public:
	TArray<class UGbxSplineClutterEntry*>         Clutter;                                           // 0x0000(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxSplineClutterArray;

// ScriptStruct GbxSpline.GbxSplineLanesShoulderEntry
// 0x0001 (0x0001 - 0x0000)
struct FGbxSplineLanesShoulderEntry final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxSplineLanesShoulderEntry;

// ScriptStruct GbxSpline.GbxSplineMesh
// 0x0050 (0x0050 - 0x0000)
struct FGbxSplineMesh final
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             MaterialOverrides;                                 // 0x0008(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FVector                                scale;                                             // 0x0018(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              CenterAdjustment;                                  // 0x0030(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESplineMeshAxis                               ForwardAxis;                                       // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxNavGeometrySettings                NavSettings;                                       // 0x0044(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideNavSettings;                              // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxSplineMesh;

// ScriptStruct GbxSpline.GbxLandscapeSplineLanesSegmentConfigs
// 0x0060 (0x0060 - 0x0000)
struct FGbxLandscapeSplineLanesSegmentConfigs final
{
public:
	TArray<struct FGbxSplineLanesShoulderEntry>   Shoulders;                                         // 0x0000(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	TMap<int32, struct FGbxSplineMesh>            LaneAdapters;                                      // 0x0010(0x0050)(Deprecated, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxLandscapeSplineLanesSegmentConfigs;

// ScriptStruct GbxSpline.GbxSplineLanesState
// 0x0001 (0x0001 - 0x0000)
struct FGbxSplineLanesState final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxSplineLanesState;

}

