#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxSpawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxEngine_classes.hpp"
#include "GbxSpawn_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class GbxSpawn.gbxactor
// 0x0000 (0x0000 - 0x0000)
class Igbxactor final
{
public:
	class ASpawnEncounter* GetSpawnEncounter() const;
	class ASpawner* GetSpawner() const;
	class USpawnerComponent* GetSpawnerComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("gbxactor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"gbxactor")
	}
	static class Igbxactor* GetDefaultObj()
	{
		return GetDefaultObjImpl<Igbxactor>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_Igbxactor;

// Class GbxSpawn.GbxActorDefBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UGbxActorDefBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static FGbxDefPtrProperty_ GetBlackboardActorDef(const struct FGbxBlackboardEntryRef& BlackboardKey, class UObject* OwnerContext);
	static FGameDataHandleProperty_ GetBlackboardActorDefHandle(const struct FGbxBlackboardEntryRef& BlackboardKey, class UObject* OwnerContext);
	static FGameDataHandleProperty_ GetBlackboardActorDefHandlePure(const struct FGbxBlackboardEntryRef& BlackboardKey, class UObject* OwnerContext);
	static FGbxDefPtrProperty_ GetBlackboardActorDefPure(const struct FGbxBlackboardEntryRef& BlackboardKey, class UObject* OwnerContext);
	static TArray<FGameDataHandleProperty_> GetEnemiesActorDefHandles();
	static TArray<struct FGbxEnemyActorDefInfo> GetEnemiesActorDefInfo(const struct FGameplayTagContainer& BossTags, bool bRemovePossibleDuplicates);
	static TArray<class FString> GetEnemiesActorDefStrings();
	static void SetBlackboardActorDef(const struct FGbxBlackboardEntryRef& BlackboardKey, FGbxDefPtrProperty_ Value, class UObject* OwnerContext);
	static void SetBlackboardActorDefHandle(const struct FGbxBlackboardEntryRef& BlackboardKey, FGameDataHandleProperty_ Value, class UObject* OwnerContext);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxActorDefBlueprintFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxActorDefBlueprintFunctionLibrary")
	}
	static class UGbxActorDefBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxActorDefBlueprintFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UGbxActorDefBlueprintFunctionLibrary;

// Class GbxSpawn.GbxGameplayTagStatics
// 0x0000 (0x0028 - 0x0028)
class UGbxGameplayTagStatics final : public UBlueprintFunctionLibrary
{
public:
	static void GbxActor_AddTag(class UObject* Context, const struct FGameplayTag& Tag);
	static bool GbxActor_HasAllTags(class UObject* Context, const struct FGameplayTagContainer& tags);
	static bool GbxActor_HasAnyTags(class UObject* Context, const struct FGameplayTagContainer& tags);
	static bool GbxActor_HasTag(class UObject* Context, const struct FGameplayTag& Tag);
	static bool GbxActor_RemoveTag(class UObject* Context, const struct FGameplayTag& Tag);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameplayTagStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameplayTagStatics")
	}
	static class UGbxGameplayTagStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameplayTagStatics>();
	}
};
DUMPER7_ASSERTS_UGbxGameplayTagStatics;

// Class GbxSpawn.GbxPreviewComponent
// 0x0000 (0x02B0 - 0x02B0)
class UGbxPreviewComponent : public UChildActorBaseComponent
{
public:
	void GetPreviewOptions(TArray<class FName>* OutOptions);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxPreviewComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxPreviewComponent")
	}
	static class UGbxPreviewComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxPreviewComponent>();
	}
};
DUMPER7_ASSERTS_UGbxPreviewComponent;

// Class GbxSpawn.GbxPreviewable
// 0x0000 (0x0000 - 0x0000)
class IGbxPreviewable final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxPreviewable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxPreviewable")
	}
	static class IGbxPreviewable* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxPreviewable>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxPreviewable;

// Class GbxSpawn.GbxTaggedAnim
// 0x0000 (0x0028 - 0x0028)
class UGbxTaggedAnim : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxTaggedAnim")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxTaggedAnim")
	}
	static class UGbxTaggedAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxTaggedAnim>();
	}
};
DUMPER7_ASSERTS_UGbxTaggedAnim;

// Class GbxSpawn.GbxSpawnTaggedAnimData
// 0x0000 (0x0030 - 0x0030)
class UGbxSpawnTaggedAnimData : public UDataAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxSpawnTaggedAnimData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxSpawnTaggedAnimData")
	}
	static class UGbxSpawnTaggedAnimData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxSpawnTaggedAnimData>();
	}
};
DUMPER7_ASSERTS_UGbxSpawnTaggedAnimData;

// Class GbxSpawn.NexusConfigStore_GbxActor
// 0x0050 (0x03E0 - 0x0390)
class UNexusConfigStore_GbxActor final : public UNexusConfigStoreBasic
{
public:
	uint8                                         Pad_390[0x50];                                     // 0x0390(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStore_GbxActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStore_GbxActor")
	}
	static class UNexusConfigStore_GbxActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStore_GbxActor>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStore_GbxActor;

// Class GbxSpawn.SpawnBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class USpawnBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool EqualEqual_GbxActorDef(const FGameDataHandleProperty_& A, const FGameDataHandleProperty_& B);
	static void GbxSpawnActorAtSpawnPoint(class AActor* Context, FGameDataHandleProperty_ GbxActorDef, class ASpawnPoint* SpawnPoint, class AActor* owner, class APawn* instigator, const struct FSpawnDetails& SpawnDetails, bool bIsCritical, class AActor** Result, const struct FLatentActionInfo& LatentInfo);
	static void GbxSpawnActorAtSpawnPointComponent(class AActor* Context, FGameDataHandleProperty_ GbxActorDef, class USpawnPointComponent* SpawnPointComponent, class AActor* owner, class APawn* instigator, const struct FSpawnDetails& SpawnDetails, bool bIsCritical, class AActor** Result, const struct FLatentActionInfo& LatentInfo);
	static void GbxSpawnActorAtTransform(class AActor* Context, FGameDataHandleProperty_ GbxActorDef, const struct FTransform& Transform, class AActor* owner, class APawn* instigator, const struct FSpawnDetails& SpawnDetails, bool bIsCritical, class AActor** Result, const struct FLatentActionInfo& LatentInfo);
	static void GbxSpawnSystemRestore(class UObject* WorldContext);
	static void GbxSpawnSystemSaveAndReset(class UObject* WorldContext);
	static FGameDataHandleProperty_ GetGbxActorDefinition(class AActor* Actor);
	static FGameDataHandleProperty_ GetGbxActorDefPure(class AActor* Actor);
	static class ASpawnEncounter* GetSpawnEncounter(class AActor* Context);
	static class ASpawner* GetSpawner(class AActor* Context);
	static class USpawnerComponent* GetSpawnerComponent(class AActor* Context);
	static bool HasGbxActorDef(class AActor* Actor, const FGameDataHandleProperty_& GbxActorDef);
	static void HasGbxActorDefBranch(class AActor* Actor, const FGameDataHandleProperty_& GbxActorDef, bool* Result);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnBlueprintLibrary")
	}
	static class USpawnBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_USpawnBlueprintLibrary;

// Class GbxSpawn.SpawnEncounter
// 0x0110 (0x04A0 - 0x0390)
class ASpawnEncounter : public AActor
{
public:
	uint8                                         Pad_390[0x78];                                     // 0x0390(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bControlsSpawners;                                 // 0x0408(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEncounterEnabled;                                 // 0x0409(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnerActivation                     SpawnerActivation;                                 // 0x0410(0x0020)(Edit, NativeAccessSpecifierPrivate)
	ESpawnEncounterResetStyle                     ResetStyle;                                        // 0x0430(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisableOnReset;                                   // 0x0431(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_432[0x2];                                      // 0x0432(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ResetPeriodOverride;                               // 0x0434(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseResetPeriodOverride;                           // 0x0438(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSpawnEncounterWave>            EncounterWaves;                                    // 0x0440(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class USpawnerComponent*>              LoadingSpawners;                                   // 0x0450(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_460[0x1];                                      // 0x0460(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bManuallyCreated;                                  // 0x0461(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_462[0x2];                                      // 0x0462(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AutoIncludeRadius;                                 // 0x0464(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class ASpawner>>        SpawnersToInclude;                                 // 0x0468(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class ASpawner>>        SpawnersToExclude;                                 // 0x0478(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FColor                                 EncounterColor;                                    // 0x0488(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USpawnerComponent*>              SpawnerComponents;                                 // 0x0490(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	void KillEncounterActors();
	void ResetEncounter(bool bDestroyActors);
	void SetEncounterEnabled(bool bEnabled);

	int32 GetCurrentWaveIndex() const;
	bool IsEncounterComplete() const;
	bool IsEncounterEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounter")
	}
	static class ASpawnEncounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpawnEncounter>();
	}
};
DUMPER7_ASSERTS_ASpawnEncounter;

// Class GbxSpawn.SpawnEncounterCondition
// 0x0000 (0x0028 - 0x0028)
class USpawnEncounterCondition : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterCondition")
	}
	static class USpawnEncounterCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterCondition>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterCondition;

// Class GbxSpawn.SpawnEncounterCondition_Compound
// 0x0018 (0x0040 - 0x0028)
class USpawnEncounterCondition_Compound final : public USpawnEncounterCondition
{
public:
	ESpawnEncounterCompoundOperator               Operator;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USpawnEncounterCondition*>       Conditions;                                        // 0x0030(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterCondition_Compound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterCondition_Compound")
	}
	static class USpawnEncounterCondition_Compound* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterCondition_Compound>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterCondition_Compound;

// Class GbxSpawn.SpawnEncounterCondition_Spawner
// 0x0018 (0x0040 - 0x0028)
class USpawnEncounterCondition_Spawner final : public USpawnEncounterCondition
{
public:
	TArray<struct FSpawnEncounterSpawnerRef>      Spawners;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	float                                         Percent;                                           // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIgnoreDisabledSpawners;                           // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterCondition_Spawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterCondition_Spawner")
	}
	static class USpawnEncounterCondition_Spawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterCondition_Spawner>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterCondition_Spawner;

// Class GbxSpawn.SpawnEncounterCondition_AllSpawners
// 0x0008 (0x0030 - 0x0028)
class USpawnEncounterCondition_AllSpawners final : public USpawnEncounterCondition
{
public:
	float                                         Percent;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterCondition_AllSpawners")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterCondition_AllSpawners")
	}
	static class USpawnEncounterCondition_AllSpawners* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterCondition_AllSpawners>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterCondition_AllSpawners;

// Class GbxSpawn.SpawnEncounterCondition_Delay
// 0x0010 (0x0038 - 0x0028)
class USpawnEncounterCondition_Delay final : public USpawnEncounterCondition
{
public:
	uint8                                         Pad_28[0x4];                                       // 0x0028(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNumericRange                          delay;                                             // 0x002C(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterCondition_Delay")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterCondition_Delay")
	}
	static class USpawnEncounterCondition_Delay* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterCondition_Delay>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterCondition_Delay;

// Class GbxSpawn.SpawnEncounterEvent
// 0x0008 (0x0030 - 0x0028)
class USpawnEncounterEvent : public UObject
{
public:
	struct FNumericRange                          StartDelay;                                        // 0x0028(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterEvent")
	}
	static class USpawnEncounterEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterEvent>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterEvent;

// Class GbxSpawn.SpawnEncounterEvent_Debug
// 0x0018 (0x0048 - 0x0030)
class USpawnEncounterEvent_Debug final : public USpawnEncounterEvent
{
public:
	class FString                                 Message;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                 Color;                                             // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterEvent_Debug")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterEvent_Debug")
	}
	static class USpawnEncounterEvent_Debug* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterEvent_Debug>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterEvent_Debug;

// Class GbxSpawn.SpawnEncounterEvent_Spawner
// 0x0058 (0x0088 - 0x0030)
class USpawnEncounterEvent_Spawner final : public USpawnEncounterEvent
{
public:
	TArray<struct FSpawnEncounterSpawnerRef>      Spawners;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                          bEnable;                                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ESpawnEncounterEventEnableMode                EnableMode;                                        // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGbxParam                              EnableCount;                                       // 0x0048(0x0038)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bResetCompletedSpawners;                           // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterEvent_Spawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterEvent_Spawner")
	}
	static class USpawnEncounterEvent_Spawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterEvent_Spawner>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterEvent_Spawner;

// Class GbxSpawn.SpawnEncounterEvent_Encounter
// 0x0060 (0x0090 - 0x0030)
class USpawnEncounterEvent_Encounter final : public USpawnEncounterEvent
{
public:
	TArray<struct FSpawnEncounterEventEncounterRef> Encounters;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bEnable;                                           // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ESpawnEncounterEventEnableMode                EnableMode;                                        // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGbxParam                              EnableCount;                                       // 0x0048(0x0038)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bResetCompletedEncounters;                         // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpawnEncounter*                        Encounter;                                         // 0x0088(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterEvent_Encounter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterEvent_Encounter")
	}
	static class USpawnEncounterEvent_Encounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterEvent_Encounter>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterEvent_Encounter;

// Class GbxSpawn.SpawnEncounterEvent_Random
// 0x0050 (0x0080 - 0x0030)
class USpawnEncounterEvent_Random final : public USpawnEncounterEvent
{
public:
	TArray<struct FSpawnEncounterEventRandomEntry> events;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGbxParam                              RandomCount;                                       // 0x0040(0x0038)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bUseRandomCount;                                   // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterEvent_Random")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterEvent_Random")
	}
	static class USpawnEncounterEvent_Random* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterEvent_Random>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterEvent_Random;

// Class GbxSpawn.SpawnEncounterEvent_Condition
// 0x0010 (0x0040 - 0x0030)
class USpawnEncounterEvent_Condition final : public USpawnEncounterEvent
{
public:
	TArray<struct FSpawnEncounterEventConditionEntry> events;                                        // 0x0030(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnEncounterEvent_Condition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnEncounterEvent_Condition")
	}
	static class USpawnEncounterEvent_Condition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnEncounterEvent_Condition>();
	}
};
DUMPER7_ASSERTS_USpawnEncounterEvent_Condition;

// Class GbxSpawn.SpawnPoint
// 0x0030 (0x03C0 - 0x0390)
class ASpawnPoint : public AActor
{
public:
	uint8                                         Pad_390[0x10];                                     // 0x0390(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ASpawnPoint* SpawnPoint, class AActor* Actor)> OnSpawnPointSpawned; // 0x03A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USceneComponent*                        SpawnRootComponent;                                // 0x03B0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USpawnPointComponent*                   SpawnPointComponent;                               // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool IsSpawnPointEnabled();
	void ResetStretchyPoints();
	void SetSpawnPointEnabled(bool bEnabled);

	class USpawnPointComponent* GetSpawnPointComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnPoint")
	}
	static class ASpawnPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpawnPoint>();
	}
};
DUMPER7_ASSERTS_ASpawnPoint;

// Class GbxSpawn.Spawner
// 0x0058 (0x0418 - 0x03C0)
class ASpawner : public ASpawnPoint
{
public:
	TMulticastInlineDelegate<void(class ASpawner* Spawner, class AActor* Actor)> OnActorSpawned;     // 0x03C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ASpawner* Spawner, class AActor* Actor)> OnActorDied;        // 0x03D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ASpawner* Spawner)> OnAllSpawned;                            // 0x03E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ASpawner* Spawner)> OnAllDied;                               // 0x03F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ASpawner* Spawner)> OnReset;                                 // 0x0400(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class USpawnerComponent*                      SpawnerComponent;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void DestroyAllActors();
	void DestroyOnAllDied(class ASpawner* Spawner);
	void ForgetAllActors();
	bool IsSpawnerEnabled();
	void ResetSpawner(bool bDestroyActors);
	void SetGbxActorDef(const FGameDataHandleProperty_& NewGbxActorDef, bool bDestroyExistingActors);
	void SetNextSpawnOverride(FGameDataHandleProperty_ NewNextSpawnOverrideHandle, ESetNextSpawnOutputState* Exec, const struct FLatentActionInfo& LatentInfo);
	void SetSpawnerEnabled(bool bEnabled);

	TArray<class AActor*> GetAliveActors(ESpawnedActorType ActorType, bool bIncludeLinkedSpawners) const;
	int32 GetNumAliveActors(ESpawnedActorType type) const;
	int32 GetNumDeadActors(ESpawnedActorType type) const;
	int32 GetNumSpawnedActors(ESpawnedActorType type) const;
	int32 GetNumTotalActors() const;
	class USpawnerComponent* GetSpawnerComponent() const;
	bool HaveAllDied(ESpawnedActorType type) const;
	bool HaveAllSpawned() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("Spawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Spawner")
	}
	static class ASpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpawner>();
	}
};
DUMPER7_ASSERTS_ASpawner;

// Class GbxSpawn.SpawnPointComponent
// 0x01E0 (0x0800 - 0x0620)
class USpawnPointComponent : public UPrimitiveComponent
{
public:
	uint8                                         Pad_620[0x8];                                      // 0x0620(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class USpawnPointComponent* SpawnPoint, class AActor* Actor)> OnActorSpawnedEventBP; // 0x0628(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_638[0x30];                                     // 0x0638(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSpawnPointEnabled;                                // 0x0668(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASpawnPoint*>                    SpawnPoints;                                       // 0x0670(0x0010)(ZeroConstructor, Deprecated, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         SpawnPointProviders;                               // 0x0680(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	ESpawnPointSource                             SpawnPointSource;                                  // 0x0690(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAtomicSpawnPointGroup;                            // 0x0694(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRandomizeSpawnPoints;                             // 0x0695(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_696[0x2];                                      // 0x0696(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnFilter                           AllowedTags;                                       // 0x0698(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPrivate)
	struct FSpawnFilter                           LockedAllowedTags;                                 // 0x06C0(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPrivate)
	struct FColor                                 GroupColor;                                        // 0x06E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUseMinimumSpawnRadius;                            // 0x06EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6ED[0x3];                                      // 0x06ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumSpawnRadius;                                // 0x06F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           SpawnAnimTag;                                      // 0x06F4(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESpawnAnimStretch                             SpawnAnimStretchType;                              // 0x06FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ESpawnAutoStretchType                         AutoStretchType;                                   // 0x0700(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FNumericRange                          AutoStretchRange;                                  // 0x0704(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bAutoStretchComponent;                             // 0x070C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoStretchUpIsRelative;                          // 0x070D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70E[0x2];                                      // 0x070E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             StretchyPoint;                                     // 0x0710(0x0060)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_770[0x58];                                     // 0x0770(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USpawnPointComponent*>           ParentComponents;                                  // 0x07C8(0x0010)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7D8[0x28];                                     // 0x07D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RefreshStretchyPoints();
	void SetSpawnPointAnimTag(const struct FGameplayTag& AnimTag);
	void SetSpawnPointEnabled(bool bEnabled);

	bool IsSpawnPointEnabled() const;
	bool ShouldHideStretchyPointEditWidget() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnPointComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnPointComponent")
	}
	static class USpawnPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnPointComponent>();
	}
};
DUMPER7_ASSERTS_USpawnPointComponent;

// Class GbxSpawn.SpawnerComponent
// 0x03F0 (0x0BF0 - 0x0800)
class USpawnerComponent : public USpawnPointComponent
{
public:
	uint8                                         Pad_800[0x48];                                     // 0x0800(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSpawnerEnabled;                                   // 0x0848(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnerActivation                     Activation;                                        // 0x0850(0x0020)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_870[0xD0];                                     // 0x0870(0x00D0)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAllowEncounterToOverrideActivation;               // 0x0940(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_941[0x3];                                      // 0x0941(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnDetails                          SpawnDetails;                                      // 0x0944(0x000C)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	ESpawnerGroupingMode                          SpawnerGrouping;                                   // 0x0950(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_954[0x4];                                      // 0x0954(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpawnerActivation                     SpawnerGroupingArea;                               // 0x0958(0x0020)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bUseSpawnerGroupingArea;                           // 0x0978(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_979[0x7];                                      // 0x0979(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class ASpawner>>        GroupExclusions;                                   // 0x0980(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_990[0x48];                                     // 0x0990(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      GbxActorDef;                                       // 0x09D8(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_9F0[0x178];                                    // 0x09F0(0x0178)(Fixing Size After Last Property [ Dumper-7 ])
	class USpawnerStyle*                          SpawnerStyle;                                      // 0x0B68(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSpawnerStyleData                      SpawnerStyleData;                                  // 0x0B70(0x0038)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_BA8[0x10];                                     // 0x0BA8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNumericRange                          PresentationDelay;                                 // 0x0BB8(0x0008)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	class ASpawnEncounter*                        Group;                                             // 0x0BC0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASpawnEncounter*                        Encounter;                                         // 0x0BC8(0x0008)(Edit, ZeroConstructor, EditConst, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGbxBlackboardDefaults                 BlackboardOverrides;                               // 0x0BD0(0x0018)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_BE8[0x8];                                      // 0x0BE8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<class FName> GetPlayerCountSpawnRowOptions();

	void DestroyAllActors();
	bool IsSpawnerEnabled();
	void KillAliveActors();
	void PopActorDef(const class FName& reason, bool bDestroyExistingActors);
	void PushActorDef(const class FName& reason, const FGbxDefPtrProperty_& NewGbxActorDef, bool bDestroyExistingActors);
	void ResetSpawner(bool bDestroyActors);
	void SetGbxActorDef(const FGameDataHandleProperty_& NewGbxActorDef, bool bDestroyExistingActors);
	void SetSpawnerEnabled(bool bEnabled);

	TArray<class AActor*> GetAliveActors(ESpawnedActorType ActorType, bool bIncludeGroupedSpawners) const;
	int32 GetNumAliveActors(ESpawnedActorType type) const;
	int32 GetNumDeadActors(ESpawnedActorType type) const;
	int32 GetNumSpawnedActors(ESpawnedActorType type) const;
	int32 GetNumTotalActors() const;
	bool HaveAllDied(ESpawnedActorType type) const;
	bool HaveAllSpawned() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnerComponent")
	}
	static class USpawnerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnerComponent>();
	}
};
DUMPER7_ASSERTS_USpawnerComponent;

// Class GbxSpawn.SpawnerCondition
// 0x0000 (0x0028 - 0x0028)
class USpawnerCondition : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnerCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnerCondition")
	}
	static class USpawnerCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnerCondition>();
	}
};
DUMPER7_ASSERTS_USpawnerCondition;

// Class GbxSpawn.SpawnerCondition_Compound
// 0x0000 (0x0028 - 0x0028)
class USpawnerCondition_Compound final : public USpawnerCondition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnerCondition_Compound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnerCondition_Compound")
	}
	static class USpawnerCondition_Compound* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnerCondition_Compound>();
	}
};
DUMPER7_ASSERTS_USpawnerCondition_Compound;

// Class GbxSpawn.SpawnerCondition_Spawner
// 0x0000 (0x0028 - 0x0028)
class USpawnerCondition_Spawner final : public USpawnerCondition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnerCondition_Spawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnerCondition_Spawner")
	}
	static class USpawnerCondition_Spawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnerCondition_Spawner>();
	}
};
DUMPER7_ASSERTS_USpawnerCondition_Spawner;

// Class GbxSpawn.SpawnerStyle
// 0x0000 (0x0028 - 0x0028)
class USpawnerStyle : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnerStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnerStyle")
	}
	static class USpawnerStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnerStyle>();
	}
};
DUMPER7_ASSERTS_USpawnerStyle;

// Class GbxSpawn.NexusConfigStoreSpawnerStyle
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStoreSpawnerStyle final : public UNexusConfigStoreBasic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreSpawnerStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreSpawnerStyle")
	}
	static class UNexusConfigStoreSpawnerStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreSpawnerStyle>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreSpawnerStyle;

// Class GbxSpawn.SpawnerStyle_Bunch
// 0x00C0 (0x00E8 - 0x0028)
class USpawnerStyle_Bunch final : public USpawnerStyle
{
public:
	struct FGbxParam                              NumActors;                                         // 0x0028(0x0038)(NativeAccessSpecifierPublic)
	bool                                          bUseNumActorsPassive;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              NumActorsPassive;                                  // 0x0068(0x0038)(NativeAccessSpecifierPublic)
	struct FGbxParam                              SpawnDelay;                                        // 0x00A0(0x0038)(NativeAccessSpecifierPublic)
	bool                                          bUsePlayerCountModifier;                           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AdditionalCoopActors;                              // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnerStyle_Bunch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnerStyle_Bunch")
	}
	static class USpawnerStyle_Bunch* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnerStyle_Bunch>();
	}
};
DUMPER7_ASSERTS_USpawnerStyle_Bunch;

// Class GbxSpawn.SpawnerStyle_Single
// 0x0000 (0x0028 - 0x0028)
class USpawnerStyle_Single final : public USpawnerStyle
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnerStyle_Single")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnerStyle_Single")
	}
	static class USpawnerStyle_Single* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnerStyle_Single>();
	}
};
DUMPER7_ASSERTS_USpawnerStyle_Single;

// Class GbxSpawn.SpawnerStyle_Waves
// 0x0170 (0x0198 - 0x0028)
class USpawnerStyle_Waves final : public USpawnerStyle
{
public:
	bool                                          bInfinite;                                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              NumTotalActors;                                    // 0x0030(0x0038)(NativeAccessSpecifierPublic)
	struct FGbxParam                              NumWaveActors;                                     // 0x0068(0x0038)(NativeAccessSpecifierPublic)
	bool                                          bUseNumWaveActorsPassive;                          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              NumWaveActorsPassive;                              // 0x00A8(0x0038)(NativeAccessSpecifierPublic)
	struct FGbxParam                              SpawnDelay;                                        // 0x00E0(0x0038)(NativeAccessSpecifierPublic)
	struct FGbxParam                              WaveDelay;                                         // 0x0118(0x0038)(NativeAccessSpecifierPublic)
	struct FGbxParam                              WavePercent;                                       // 0x0150(0x0038)(NativeAccessSpecifierPublic)
	bool                                          bUsePlayerCountModifier;                           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AdditionalCoopActors;                              // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnerStyle_Waves")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnerStyle_Waves")
	}
	static class USpawnerStyle_Waves* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpawnerStyle_Waves>();
	}
};
DUMPER7_ASSERTS_USpawnerStyle_Waves;

// Class GbxSpawn.SpawnGroup
// 0x0000 (0x0390 - 0x0390)
class ASpawnGroup : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnGroup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnGroup")
	}
	static class ASpawnGroup* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpawnGroup>();
	}
};
DUMPER7_ASSERTS_ASpawnGroup;

// Class GbxSpawn.SpawnLocation
// 0x0000 (0x0000 - 0x0000)
class ISpawnLocation final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnLocation")
	}
	static const class FName& StaticName()
