#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxSpawn

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxNexus_structs.hpp"


namespace SDK
{

// Enum GbxSpawn.ESpawnedActorType
// NumValues: 0x0004
enum class ESpawnedActorType : uint8
{
	Internal                                 = 0,
	External                                 = 1,
	InternalAndExternal                      = 2,
	ESpawnedActorType_MAX                    = 3,
};

// Enum GbxSpawn.ESetNextSpawnOutputState
// NumValues: 0x0004
enum class ESetNextSpawnOutputState : uint8
{
	Start                                    = 0,
	Succeeded                                = 1,
	Failed                                   = 2,
	ESetNextSpawnOutputState_MAX             = 3,
};

// Enum GbxSpawn.ESpawnAutoStretchType
// NumValues: 0x0004
enum class ESpawnAutoStretchType : uint32
{
	None                                     = 0,
	Static                                   = 1,
	Dynamic                                  = 2,
	ESpawnAutoStretchType_MAX                = 3,
};

// Enum GbxSpawn.ESpawnAnimStretch
// NumValues: 0x0004
enum class ESpawnAnimStretch : uint32
{
	None                                     = 0,
	StartPoint                               = 1,
	EndPoint                                 = 2,
	ESpawnAnimStretch_MAX                    = 3,
};

// Enum GbxSpawn.ESpawnFilterType
// NumValues: 0x0006
enum class ESpawnFilterType : uint8
{
	NoFilter                                 = 0,
	Any                                      = 1,
	All                                      = 2,
	NotAny                                   = 3,
	NotAll                                   = 4,
	ESpawnFilterType_MAX                     = 5,
};

// Enum GbxSpawn.ESpawnPointSource
// NumValues: 0x0004
enum class ESpawnPointSource : uint32
{
	Self                                     = 0,
	List                                     = 1,
	Owner                                    = 2,
	ESpawnPointSource_MAX                    = 3,
};

// Enum GbxSpawn.ESetNextSpawnInternalState
// NumValues: 0x0005
enum class ESetNextSpawnInternalState : uint8
{
	Unitialized                              = 0,
	LoadingAsset                             = 1,
	Failed                                   = 2,
	Success                                  = 3,
	ESetNextSpawnInternalState_MAX           = 4,
};

// Enum GbxSpawn.ESpawnEncounterResetStyle
// NumValues: 0x0004
enum class ESpawnEncounterResetStyle : uint8
{
	Timed                                    = 0,
	Level                                    = 1,
	Never                                    = 2,
	ESpawnEncounterResetStyle_MAX            = 3,
};

// Enum GbxSpawn.ESpawnEncounterCompoundOperator
// NumValues: 0x0003
enum class ESpawnEncounterCompoundOperator : uint8
{
	And                                      = 0,
	Or                                       = 1,
	ESpawnEncounterCompoundOperator_MAX      = 2,
};

// Enum GbxSpawn.ESpawnEncounterEventEnableMode
// NumValues: 0x0004
enum class ESpawnEncounterEventEnableMode : uint32
{
	All                                      = 0,
	RandomChance                             = 1,
	RandomCount                              = 2,
	MAX                                      = 3,
};

// Enum GbxSpawn.ESpawnerGroupingMode
// NumValues: 0x0004
enum class ESpawnerGroupingMode : uint32
{
	On                                       = 0,
	Off                                      = 1,
	Custom                                   = 2,
	ESpawnerGroupingMode_MAX                 = 3,
};

// Enum GbxSpawn.EGbxSpawnerStyleType
// NumValues: 0x0004
enum class EGbxSpawnerStyleType : uint8
{
	Inline                                   = 0,
	GbxDef                                   = 1,
	Preset                                   = 2,
	EGbxSpawnerStyleType_MAX                 = 3,
};

// Enum GbxSpawn.ERespawnStyle
// NumValues: 0x0004
enum class ERespawnStyle : uint8
{
	Timed                                    = 0,
	Level                                    = 1,
	Never                                    = 2,
	ERespawnStyle_MAX                        = 3,
};

// Enum GbxSpawn.ESpawnerActivationType
// NumValues: 0x0005
enum class ESpawnerActivationType : uint8
{
	Radius                                   = 0,
	Volumes                                  = 1,
	Always                                   = 2,
	RadiusAndVolumes                         = 3,
	ESpawnerActivationType_MAX               = 4,
};

// ScriptStruct GbxSpawn.GbxEnemyActorDefInfo
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FGbxEnemyActorDefInfo final
{
public:
	float                                         SpawnCost;                                         // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCritical;                                         // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBoss;                                           // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      ActorDef;                                          // 0x0008(0x0018)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Body;                                              // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   brain;                                             // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Team;                                              // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxEnemyActorDefInfo;

// ScriptStruct GbxSpawn.SpawnFilter
// 0x0028 (0x0028 - 0x0000)
struct FSpawnFilter final
{
public:
	ESpawnFilterType                              type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  tags;                                              // 0x0008(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FSpawnFilter;

// ScriptStruct GbxSpawn.SpawnItem
// 0x00F8 (0x00F8 - 0x0000)
struct FSpawnItem final
{
public:
	FGameDataHandleProperty_                      GbxActorDef;                                       // 0x0000(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeInit                      Weight;                                            // 0x0018(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxAttributeInit                      limit;                                             // 0x0068(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxParam                              Condition;                                         // 0x00B8(0x0038)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x5];                                       // 0x00F0(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseStrictSpawnPointTagging;                       // 0x00F5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnItem;

// ScriptStruct GbxSpawn.SpawnDetails
// 0x000C (0x000C - 0x0000)
struct FSpawnDetails final
{
public:
	bool                                          bCritical;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideCritical;                                 // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERespawnStyle                                 RespawnStyle;                                      // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideRespawnStyle;                             // 0x0003(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RespawnPeriodOverride;                             // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRespawnPeriodOverride;                         // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnDetails;

// ScriptStruct GbxSpawn.GbxActorDef
// 0x0078 (0x0090 - 0x0018)
struct FGbxActorDef : public FGbxDef
{
public:
	struct FSpawnDetails                          SpawnDetails;                                      // 0x0018(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bSpawnAtHalfHeightOffset;                          // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpawnActorCollisionHandlingMethod            SpawnCollisionHandlingMethod;                      // 0x0025(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIgnoreSpawnScale;                                 // 0x0026(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxInlineStruct                       actorstateschema;                                  // 0x0028(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         bAlwaysNetRelevant : 1;                            // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bOverrideNetRelevancyDistance : 1;                 // 0x0040(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NetRelavancyDistance;                              // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpawnCostMs;                                       // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bHasCustomSpawnCostMs;                             // 0x004C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bSkipActorDefApplicationDuringCook;                // 0x004D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4E[0x22];                                      // 0x004E(0x0022)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  tags;                                              // 0x0070(0x0020)(Edit, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxActorDef;

// ScriptStruct GbxSpawn.SpawnGroupDef
// 0x0010 (0x00A0 - 0x0090)
struct FSpawnGroupDef final : public FGbxActorDef
{
public:
	TArray<struct FSpawnItem>                     items;                                             // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FSpawnGroupDef;

// ScriptStruct GbxSpawn.GbxActorData
// 0x0108 (0x0108 - 0x0000)
struct FGbxActorData final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AActor* instigator, class AActor* Child)> SpawnedChildActorEventBP; // 0x0018(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, RepSkip, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           GbxActorDef;                                       // 0x0058(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_70[0x93];                                      // 0x0070(0x0093)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSkipActorDefApplicationDuringCook;                // 0x0103(0x0001)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxActorData;

// ScriptStruct GbxSpawn.TaggedAnimDef
// 0x0008 (0x0020 - 0x0018)
struct FTaggedAnimDef : public FGbxDef
{
public:
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTaggedAnimDef;

// ScriptStruct GbxSpawn.GbxActorInstanceData
// 0x0010 (0x0018 - 0x0008)
struct FGbxActorInstanceData : public FGbxHasStructType
{
public:
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxActorInstanceData;

// ScriptStruct GbxSpawn.SpawnEncounterWave
// 0x0028 (0x0028 - 0x0000)
struct FSpawnEncounterWave final
{
public:
	TArray<class USpawnEncounterEvent*>           events;                                            // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class USpawnEncounterCondition*               Condition;                                         // 0x0010(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitForAllEvents;                                 // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 ColorOverride;                                     // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideColor;                                    // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnEncounterWave;

// ScriptStruct GbxSpawn.SpawnEncounterEventEncounterRef
// 0x0010 (0x0010 - 0x0000)
struct FSpawnEncounterEventEncounterRef final
{
public:
	class ASpawnEncounter*                        Encounter;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Chance;                                            // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnEncounterEventEncounterRef;

// ScriptStruct GbxSpawn.SpawnEncounterEventRandomEntry
// 0x0010 (0x0010 - 0x0000)
struct FSpawnEncounterEventRandomEntry final
{
public:
	float                                         Chance;                                            // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpawnEncounterEvent*                   Event;                                             // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSpawnEncounterEventRandomEntry;

// ScriptStruct GbxSpawn.SpawnEncounterEventConditionEntry
// 0x0040 (0x0040 - 0x0000)
struct FSpawnEncounterEventConditionEntry final
{
public:
	struct FGbxParam                              Condition;                                         // 0x0000(0x0038)(Edit, NativeAccessSpecifierPublic)
	class USpawnEncounterEvent*                   Event;                                             // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSpawnEncounterEventConditionEntry;

// ScriptStruct GbxSpawn.SpawnEncounterSpawnerRef
// 0x0038 (0x0038 - 0x0000)
struct FSpawnEncounterSpawnerRef final
{
public:
	bool                                          bIsValid;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpawnerComponent*                      Spawner;                                           // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Chance;                                            // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           ActorDef;                                          // 0x0018(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bOverrideActorDef;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnEncounterSpawnerRef;

// ScriptStruct GbxSpawn.SpawnerStyleData
// 0x0038 (0x0038 - 0x0000)
struct FSpawnerStyleData final
{
public:
	EGbxSpawnerStyleType                          type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxInlineStruct                       InlineDef;                                         // 0x0008(0x0018)(Edit, NoClear, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           GbxDef;                                            // 0x0020(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSpawnerStyleData;

// ScriptStruct GbxSpawn.SpawnerStyleDef
// 0x0000 (0x0018 - 0x0018)
struct FSpawnerStyleDef : public FGbxDef
{
};
DUMPER7_ASSERTS_FSpawnerStyleDef;

// ScriptStruct GbxSpawn.SpawnerStyleDef_Bunch
// 0x0148 (0x0160 - 0x0018)
struct FSpawnerStyleDef_Bunch final : public FSpawnerStyleDef
{
public:
	struct FGbxParam                              NumActors;                                         // 0x0018(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              NumActorsPassive;                                  // 0x0050(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseNumActorsPassive;                              // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              NumActorsDistant;                                  // 0x0090(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseNumActorsDistant;                              // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              NumActorsDistantRadius;                            // 0x00D0(0x0038)(Edit, NativeAccessSpecifierPublic)
	TArray<class AVolume*>                        NumActorsDistantVolumes;                           // 0x0108(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGbxParam                              SpawnDelay;                                        // 0x0118(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUsePlayerCountModifier;                           // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AdditionalCoopActors;                              // 0x0154(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnerStyleDef_Bunch;

// ScriptStruct GbxSpawn.SpawnerStyleDef_Single
// 0x0000 (0x0018 - 0x0018)
struct FSpawnerStyleDef_Single final : public FSpawnerStyleDef
{
};
DUMPER7_ASSERTS_FSpawnerStyleDef_Single;

// ScriptStruct GbxSpawn.SpawnerStyleDef_Waves
// 0x01F8 (0x0210 - 0x0018)
struct FSpawnerStyleDef_Waves final : public FSpawnerStyleDef
{
public:
	bool                                          bInfinite;                                         // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              NumTotalActors;                                    // 0x0020(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              NumWaveActors;                                     // 0x0058(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              NumWaveActorsPassive;                              // 0x0090(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseNumWaveActorsPassive;                          // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              NumWaveActorsDistant;                              // 0x00D0(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseNumWaveActorsDistant;                          // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              NumWaveActorsDistantRadius;                        // 0x0110(0x0038)(Edit, NativeAccessSpecifierPublic)
	TArray<class AVolume*>                        NumWaveActorsDistantVolumes;                       // 0x0148(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGbxParam                              SpawnDelay;                                        // 0x0158(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              WaveDelay;                                         // 0x0190(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              WavePercent;                                       // 0x01C8(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUsePlayerCountModifier;                           // 0x0200(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AdditionalCoopActors;                              // 0x0204(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnerStyleDef_Waves;

// ScriptStruct GbxSpawn.SpawnGlobals
// 0x0098 (0x00B8 - 0x0020)
struct FSpawnGlobals : public FGbxGlobalDef
{
public:
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnBudgetMs;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DespawnSpawnerDistanceToPlayerThreshold;           // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DespawnActorDistanceToPlayerThreshold;             // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdatePeriod;                                      // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IrrelevantPeriod;                                  // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SuspendTestPeriod;                                 // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnerResetPeriod;                                // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxActorsSpawnedPerFrame;                          // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AlwaysRelevantDistance;                            // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AlwaysIrrelevantDistance;                          // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   DynamicSpawnerClass;                               // 0x0058(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowCriticalOptionInSpawners;                     // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxActorDefApplicationTimeMs;                      // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGbxInlineStruct>               SpawnModifiers;                                    // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      PlayerCountSpawnModifiers;                         // 0x0098(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseNearbyPlayerCountForSpawnModifiers;            // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnGlobals;

// ScriptStruct GbxSpawn.SpawnModifier
// 0x0000 (0x0008 - 0x0008)
struct FSpawnModifier : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FSpawnModifier;

// ScriptStruct GbxSpawn.SpawnLimits
// 0x0480 (0x0480 - 0x0000)
struct alignas(0x08) FSpawnLimits final
{
public:
	uint8                                         Pad_0[0x480];                                      // 0x0000(0x0480)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnLimits;

// ScriptStruct GbxSpawn.SpawnPointComponentInstanceData
// 0x0090 (0x0260 - 0x01D0)
struct FSpawnPointComponentInstanceData final : public FPrimitiveComponentInstanceData
{
public:
	bool                                          bIsStretchy;                                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D1[0xF];                                      // 0x01D1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             StretchyPoint;                                     // 0x01E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                RelativeLocation;                                  // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSpawnPointComponentInstanceData;

// ScriptStruct GbxSpawn.SpawnerReclaimedActorInfo
// 0x0040 (0x0048 - 0x0008)
struct FSpawnerReclaimedActorInfo : public FGbxHasStructType
{
public:
	FGbxDefPtrProperty_                           ActorDefPtr;                                       // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class USpawnPointComponent>    SpawnPointPtr;                                     // 0x0020(0x0028)(ExportObject, InstancedReference, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FSpawnerReclaimedActorInfo;

// ScriptStruct GbxSpawn.SpawnerActivation
// 0x0020 (0x0020 - 0x0000)
struct FSpawnerActivation final
{
public:
	ESpawnerActivationType                        type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Radius;                                            // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHalfHeight;                                    // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HalfHeight;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AVolume*>                        Volumes;                                           // 0x0010(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSpawnerActivation;

// ScriptStruct GbxSpawn.TaggedAnimDef_GbxSpawn
// 0x0000 (0x0020 - 0x0020)
struct FTaggedAnimDef_GbxSpawn : public FTaggedAnimDef
{
};
DUMPER7_ASSERTS_FTaggedAnimDef_GbxSpawn;

}

