#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxTelemetry

#include "Basic.hpp"


namespace SDK::Params
{

// Function GbxTelemetry.GbxTelemetryBlueprintLibrary.CSVExporter_EnableExportedStats
// 0x0008 (0x0008 - 0x0000)
struct GbxTelemetryBlueprintLibrary_CSVExporter_EnableExportedStats final
{
public:
	class FName                                   ExportedStatsGroup;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTelemetryBlueprintLibrary_CSVExporter_EnableExportedStats;

// Function GbxTelemetry.GbxTelemetryBlueprintLibrary.GetIsCSVProfilerFinished
// 0x0001 (0x0001 - 0x0000)
struct GbxTelemetryBlueprintLibrary_GetIsCSVProfilerFinished final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTelemetryBlueprintLibrary_GetIsCSVProfilerFinished;

// Function GbxTelemetry.GbxTelemetryBlueprintLibrary.SetCSVEvent
// 0x0010 (0x0010 - 0x0000)
struct GbxTelemetryBlueprintLibrary_SetCSVEvent final
{
public:
	class FString                                 EventString;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTelemetryBlueprintLibrary_SetCSVEvent;

// Function GbxTelemetry.GbxTelemetryBlueprintLibrary.SetCSVMetadata
// 0x0020 (0x0020 - 0x0000)
struct GbxTelemetryBlueprintLibrary_SetCSVMetadata final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 data;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxTelemetryBlueprintLibrary_SetCSVMetadata;

}

