#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxTimeOfDay

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxNexus_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum GbxTimeOfDay.ETimeOfDayState
// NumValues: 0x0006
enum class ETimeOfDayState : uint8
{
	None                                     = 0,
	Morning                                  = 1,
	Day                                      = 2,
	Evening                                  = 3,
	Night                                    = 4,
	ETimeOfDayState_MAX                      = 5,
};

// ScriptStruct GbxTimeOfDay.TimeOfDayControlledLightStateSettings
// 0x001C (0x001C - 0x0000)
struct FTimeOfDayControlledLightStateSettings final
{
public:
	ETimeOfDayState                               State;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideIntensity;                                // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Intensity;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideLightColor;                               // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LightColor;                                        // 0x000C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayControlledLightStateSettings;

// ScriptStruct GbxTimeOfDay.TimeOfDayControlledLightSettings
// 0x0010 (0x0010 - 0x0000)
struct FTimeOfDayControlledLightSettings final
{
public:
	TArray<struct FTimeOfDayControlledLightStateSettings> StateLightSettings;                        // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayControlledLightSettings;

// ScriptStruct GbxTimeOfDay.TimeOfDayAllowedMaterialParameter
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FTimeOfDayAllowedMaterialParameter final
{
public:
	class FName                                   ParameterName;                                     // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0008(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdatesWwiseParameter;                            // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           WwiseParameter;                                    // 0x0020(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayAllowedMaterialParameter;

// ScriptStruct GbxTimeOfDay.TimeOfDayWeatherState
// 0x0018 (0x0018 - 0x0000)
struct FTimeOfDayWeatherState final
{
public:
	class FName                                   StateName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  StateId;                                           // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayWeatherState;

// ScriptStruct GbxTimeOfDay.TimeOfDayLayer
// 0x0080 (0x0080 - 0x0000)
struct FTimeOfDayLayer final
{
public:
	class FString                                 LayerName;                                         // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultWeatherLayer;                               // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCollectionScalarParameter>     OverrideScalarParameters;                          // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCollectionVectorParameter>     OverrideVectorParameters;                          // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxInlineStruct>               keys;                                              // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FTimeOfDayWeatherState                 WeatherState;                                      // 0x0060(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsWeatherLayer;                                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayLayer;

// ScriptStruct GbxTimeOfDay.TimeOfDayCycleDef
// 0x0088 (0x00A0 - 0x0018)
struct FTimeOfDayCycleDef final : public FGbxDef
{
public:
	TSoftObjectPtr<class UMaterialParameterCollection> ParameterCollection;                          // 0x0018(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTimeOfDayAllowedMaterialParameter> AllowedScalarParameters;                       // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTimeOfDayAllowedMaterialParameter> AllowedVectorParameters;                       // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         CycleLength;                                       // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   DefaultLayer;                                      // 0x0064(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTimeOfDayLayer>                layers;                                            // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTimeOfDayLayer>                BaseLayers;                                        // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTimeOfDayLayer>                WeatherLayers;                                     // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayCycleDef;

// ScriptStruct GbxTimeOfDay.TimeOfDayKey
// 0x0008 (0x0010 - 0x0008)
struct FTimeOfDayKey : public FGbxHasStructType
{
public:
	float                                         KeyTime;                                           // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayKey;

// ScriptStruct GbxTimeOfDay.TimeOfDayParameterKey
// 0x0030 (0x0040 - 0x0010)
struct FTimeOfDayParameterKey final : public FTimeOfDayKey
{
public:
	TArray<struct FCollectionScalarParameter>     OverrideScalarParameters;                          // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FCollectionVectorParameter>     OverrideVectorParameters;                          // 0x0020(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayParameterKey;

// ScriptStruct GbxTimeOfDay.TimeOfDayEventKey
// 0x0008 (0x0018 - 0x0010)
struct FTimeOfDayEventKey final : public FTimeOfDayKey
{
public:
	class FName                                   EventName;                                         // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayEventKey;

// ScriptStruct GbxTimeOfDay.TimeOfDayStateKey
// 0x0008 (0x0018 - 0x0010)
struct FTimeOfDayStateKey final : public FTimeOfDayKey
{
public:
	ETimeOfDayState                               State;                                             // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayStateKey;

// ScriptStruct GbxTimeOfDay.TimeOfDayWeatherForecast
// 0x0024 (0x0024 - 0x0000)
struct FTimeOfDayWeatherForecast final
{
public:
	class FName                                   layer;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Chance;                                            // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumDuration;                                   // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionTime;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLimitDuration;                                    // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxDuration;                                       // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionOutTime;                                 // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x4];                                       // 0x0020(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayWeatherForecast;

// ScriptStruct GbxTimeOfDay.TimeOfDayForecastKey
// 0x0010 (0x0020 - 0x0010)
struct FTimeOfDayForecastKey final : public FTimeOfDayKey
{
public:
	TArray<struct FTimeOfDayWeatherForecast>      Forecasts;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayForecastKey;

// ScriptStruct GbxTimeOfDay.TimeOfDayCloudscapeKey
// 0x0030 (0x0040 - 0x0010)
struct FTimeOfDayCloudscapeKey final : public FTimeOfDayKey
{
public:
	TSoftObjectPtr<class UGbxCloudscapeData>      CloudscapeData;                                    // 0x0010(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionTime;                                    // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayCloudscapeKey;

// ScriptStruct GbxTimeOfDay.TimeOfDayPropertyParameter
// 0x0008 (0x0010 - 0x0008)
struct FTimeOfDayPropertyParameter : public FGbxHasStructType
{
public:
	class FName                                   ID;                                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayPropertyParameter;

// ScriptStruct GbxTimeOfDay.TimeOfDayPropertyParameterFloat
// 0x0008 (0x0018 - 0x0010)
struct FTimeOfDayPropertyParameterFloat final : public FTimeOfDayPropertyParameter
{
public:
	float                                         data;                                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayPropertyParameterFloat;

// ScriptStruct GbxTimeOfDay.TimeOfDayPropertyParameterInteger
// 0x0008 (0x0018 - 0x0010)
struct FTimeOfDayPropertyParameterInteger final : public FTimeOfDayPropertyParameter
{
public:
	int32                                         data;                                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayPropertyParameterInteger;

// ScriptStruct GbxTimeOfDay.TimeOfDayPropertyParameterColor
// 0x0008 (0x0018 - 0x0010)
struct FTimeOfDayPropertyParameterColor final : public FTimeOfDayPropertyParameter
{
public:
	struct FColor                                 data;                                              // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayPropertyParameterColor;

// ScriptStruct GbxTimeOfDay.TimeOfDayPropertyParameterLinearColor
// 0x0010 (0x0020 - 0x0010)
struct FTimeOfDayPropertyParameterLinearColor final : public FTimeOfDayPropertyParameter
{
public:
	struct FLinearColor                           data;                                              // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayPropertyParameterLinearColor;

// ScriptStruct GbxTimeOfDay.TimeOfDayPropertyParameterBoolean
// 0x0008 (0x0018 - 0x0010)
struct FTimeOfDayPropertyParameterBoolean final : public FTimeOfDayPropertyParameter
{
public:
	bool                                          data;                                              // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTimeOfDayPropertyParameterBoolean;

// ScriptStruct GbxTimeOfDay.TimeOfDayPropertyParameterVector4
// 0x0020 (0x0030 - 0x0010)
struct FTimeOfDayPropertyParameterVector4 final : public FTimeOfDayPropertyParameter
{
public:
	struct FVector4                               data;                                              // 0x0010(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayPropertyParameterVector4;

// ScriptStruct GbxTimeOfDay.TimeOfDayPropertyParameterObject
// 0x0028 (0x0038 - 0x0010)
struct FTimeOfDayPropertyParameterObject final : public FTimeOfDayPropertyParameter
{
public:
	TSoftObjectPtr<class UObject>                 data;                                              // 0x0010(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayPropertyParameterObject;

// ScriptStruct GbxTimeOfDay.WorldTimeOfDayWeatherData
// 0x0014 (0x0014 - 0x0000)
struct FWorldTimeOfDayWeatherData final
{
public:
	class FName                                   ForecastCurveId;                                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CurrentWeather;                                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionTime;                                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWorldTimeOfDayWeatherData;

// ScriptStruct GbxTimeOfDay.WorldTimeOfDayBaseLayerOverride
// 0x0014 (0x0014 - 0x0000)
struct FWorldTimeOfDayBaseLayerOverride final
{
public:
	class FName                                   ZoneId;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BaseLayerOverride;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionTime;                                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWorldTimeOfDayBaseLayerOverride;

// ScriptStruct GbxTimeOfDay.TimeOfDayStateSettings
// 0x0008 (0x0008 - 0x0000)
struct FTimeOfDayStateSettings final
{
public:
	ETimeOfDayState                               State;                                             // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTime;                                         // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTimeOfDayStateSettings;

}

