#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxTimeOfDay

#include "Basic.hpp"

#include "GbxTimeOfDay_structs.hpp"


namespace SDK::Params
{

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.AddTimeOfDayEventListener
// 0x0010 (0x0010 - 0x0000)
struct TimeOfDayBlueprintLibrary_AddTimeOfDayEventListener final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InListener;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_AddTimeOfDayEventListener;

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.GetTimeOfDay
// 0x0010 (0x0010 - 0x0000)
struct TimeOfDayBlueprintLibrary_GetTimeOfDay final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_GetTimeOfDay;

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.GetTimeOfDayState
// 0x0010 (0x0010 - 0x0000)
struct TimeOfDayBlueprintLibrary_GetTimeOfDayState final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETimeOfDayState                               ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_GetTimeOfDayState;

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.PauseTimeOfDay
// 0x0008 (0x0008 - 0x0000)
struct TimeOfDayBlueprintLibrary_PauseTimeOfDay final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_PauseTimeOfDay;

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.RemoveTimeOfDayEventListener
// 0x0010 (0x0010 - 0x0000)
struct TimeOfDayBlueprintLibrary_RemoveTimeOfDayEventListener final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InListener;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_RemoveTimeOfDayEventListener;

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.SetTimeOfDay
// 0x0010 (0x0010 - 0x0000)
struct TimeOfDayBlueprintLibrary_SetTimeOfDay final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewTimeOfDay;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_SetTimeOfDay;

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.StartTimeOfDay
// 0x0008 (0x0008 - 0x0000)
struct TimeOfDayBlueprintLibrary_StartTimeOfDay final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_StartTimeOfDay;

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.TransitionDownOneLayer
// 0x0010 (0x0010 - 0x0000)
struct TimeOfDayBlueprintLibrary_TransitionDownOneLayer final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionDuration;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_TransitionDownOneLayer;

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.TransitionToLayer
// 0x0020 (0x0020 - 0x0000)
struct TimeOfDayBlueprintLibrary_TransitionToLayer final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ToLayer;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionDuration;                                // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceLayerChange;                                 // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_TransitionToLayer;

// Function GbxTimeOfDay.TimeOfDayBlueprintLibrary.TransitionUpOneLayer
// 0x0010 (0x0010 - 0x0000)
struct TimeOfDayBlueprintLibrary_TransitionUpOneLayer final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransitionDuration;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TimeOfDayBlueprintLibrary_TransitionUpOneLayer;

// Function GbxTimeOfDay.TimeOfDayVolume.TransitionBaseLayer
// 0x000C (0x000C - 0x0000)
struct TimeOfDayVolume_TransitionBaseLayer final
{
public:
	class FName                                   BaseLayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LayerTransitionTime;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeOfDayVolume_TransitionBaseLayer;

// Function GbxTimeOfDay.TimeOfDayVolume.TransitionWeatherLayer
// 0x0024 (0x0024 - 0x0000)
struct TimeOfDayVolume_TransitionWeatherLayer final
{
public:
	struct FTimeOfDayWeatherForecast              ForecastData;                                      // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeOfDayVolume_TransitionWeatherLayer;

// Function GbxTimeOfDay.TimeOfDayVolume.EnumerateBaseLayerNames
// 0x0010 (0x0010 - 0x0000)
struct TimeOfDayVolume_EnumerateBaseLayerNames final
{
public:
	TArray<class FName>                           OutLayerNames;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeOfDayVolume_EnumerateBaseLayerNames;

// Function GbxTimeOfDay.WorldTimeOfDayActor.OnRep_CycleCount
// 0x0004 (0x0004 - 0x0000)
struct WorldTimeOfDayActor_OnRep_CycleCount final
{
public:
	int32                                         PreviousCycleCount;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_OnRep_CycleCount;

// Function GbxTimeOfDay.WorldTimeOfDayActor.SetCinematicTimeOfDay
// 0x0004 (0x0004 - 0x0000)
struct WorldTimeOfDayActor_SetCinematicTimeOfDay final
{
public:
	float                                         InCinematicTimeOfDay;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_SetCinematicTimeOfDay;

// Function GbxTimeOfDay.WorldTimeOfDayActor.SetCinematicTimeOfDayBaseLayer
// 0x0010 (0x0010 - 0x0000)
struct WorldTimeOfDayActor_SetCinematicTimeOfDayBaseLayer final
{
public:
	class FString                                 InCinematicTimeOfDayBaseLayer;                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_SetCinematicTimeOfDayBaseLayer;

// Function GbxTimeOfDay.WorldTimeOfDayActor.SetCinematicTimeOfDayWeatherLayer
// 0x0010 (0x0010 - 0x0000)
struct WorldTimeOfDayActor_SetCinematicTimeOfDayWeatherLayer final
{
public:
	class FString                                 InCinematicTimeOfDayWeatherLayer;                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_SetCinematicTimeOfDayWeatherLayer;

// Function GbxTimeOfDay.WorldTimeOfDayActor.SetUseCinematicTimeOfDay
// 0x0001 (0x0001 - 0x0000)
struct WorldTimeOfDayActor_SetUseCinematicTimeOfDay final
{
public:
	bool                                          InUseCinematicTimeOfDay;                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_SetUseCinematicTimeOfDay;

// Function GbxTimeOfDay.WorldTimeOfDayActor.SetUseCinematicTimeOfDayBaseLayer
// 0x0001 (0x0001 - 0x0000)
struct WorldTimeOfDayActor_SetUseCinematicTimeOfDayBaseLayer final
{
public:
	bool                                          InUseCinematicTimeOfDayBaseLayer;                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_SetUseCinematicTimeOfDayBaseLayer;

// Function GbxTimeOfDay.WorldTimeOfDayActor.SetUseCinematicTimeOfDayWeatherLayer
// 0x0001 (0x0001 - 0x0000)
struct WorldTimeOfDayActor_SetUseCinematicTimeOfDayWeatherLayer final
{
public:
	bool                                          InUseCinematicTimeOfDayWeatherLayer;               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_SetUseCinematicTimeOfDayWeatherLayer;

// Function GbxTimeOfDay.WorldTimeOfDayActor.TransitionBaseLayer
// 0x000C (0x000C - 0x0000)
struct WorldTimeOfDayActor_TransitionBaseLayer final
{
public:
	class FName                                   BaseLayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LayerTransitionTime;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_TransitionBaseLayer;

// Function GbxTimeOfDay.WorldTimeOfDayActor.TransitionWeatherLayer
// 0x0024 (0x0024 - 0x0000)
struct WorldTimeOfDayActor_TransitionWeatherLayer final
{
public:
	struct FTimeOfDayWeatherForecast              ForecastData;                                      // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_TransitionWeatherLayer;

// Function GbxTimeOfDay.WorldTimeOfDayActor.EnumerateBaseLayerNames
// 0x0010 (0x0010 - 0x0000)
struct WorldTimeOfDayActor_EnumerateBaseLayerNames final
{
public:
	TArray<class FName>                           OutLayerNames;                                     // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WorldTimeOfDayActor_EnumerateBaseLayerNames;

}

