#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxTelemetry

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GbxTelemetry_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class GbxTelemetry.GbxTelemetryBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UGbxTelemetryBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void CSVExporter_EnableExportedStats(class FName ExportedStatsGroup);
	static void CSVExporter_IgnoreStats();
	static void CSVExporter_ProcessStats();
	static bool GetIsCSVProfilerFinished();
	static void SetCSVEvent(const class FString& EventString);
	static void SetCSVMetadata(const class FString& Key, const class FString& data);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxTelemetryBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxTelemetryBlueprintLibrary")
	}
	static class UGbxTelemetryBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxTelemetryBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UGbxTelemetryBlueprintLibrary;

// Class GbxTelemetry.GbxTelemetrySettings
// 0x0078 (0x00B0 - 0x0038)
class UGbxTelemetrySettings final : public UDeveloperSettings
{
public:
	class FString                                 EngineTelemetryElasticIndex;                       // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StatUnitTelemetryElasticIndex;                     // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LoadTimesElasticIndex;                             // 0x0058(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LogTelemetryElasticIndex;                          // 0x0068(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        FlushCSVBufferTime;                                // 0x0078(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CSVBufferSizeBytes;                                // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x8];                                       // 0x0084(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         CSVExportMinFrame;                                 // 0x008C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ExportedCSVStats;                                  // 0x0090(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FExportedCSVStatGroup>          ExportedCSVStatGroups;                             // 0x00A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxTelemetrySettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxTelemetrySettings")
	}
	static class UGbxTelemetrySettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxTelemetrySettings>();
	}
};
DUMPER7_ASSERTS_UGbxTelemetrySettings;

}

