#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxUIUMG

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxUIUMG_structs.hpp"


namespace SDK::Params
{

// Function GbxUIUMG.AsyncAction_CreateWidgetAsync.CreateWidgetAsync
// 0x0048 (0x0048 - 0x0000)
struct AsyncAction_CreateWidgetAsync_CreateWidgetAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   UserWidgetSoftClass;                               // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                      OwningPlayer;                                      // 0x0030(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuspendInputUntilComplete;                        // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_CreateWidgetAsync*         ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncAction_CreateWidgetAsync_CreateWidgetAsync;

// Function GbxUIUMG.AsyncAction_PushContentToLayerForPlayer.PushContentToLayerForPlayer
// 0x0048 (0x0048 - 0x0000)
struct AsyncAction_PushContentToLayerForPlayer_PushContentToLayerForPlayer final
{
public:
	class APlayerController*                      OwningPlayer;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           LayerName;                                         // 0x0030(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSuspendInputUntilComplete;                        // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_PushContentToLayerForPlayer* ReturnValue;                                     // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncAction_PushContentToLayerForPlayer_PushContentToLayerForPlayer;

// Function GbxUIUMG.CommonUIExtensions.GetLocalPlayerFromController
// 0x0010 (0x0010 - 0x0000)
struct CommonUIExtensions_GetLocalPlayerFromController final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULocalPlayer*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonUIExtensions_GetLocalPlayerFromController;

// Function GbxUIUMG.CommonUIExtensions.GetOwningPlayerInputType
// 0x0010 (0x0010 - 0x0000)
struct CommonUIExtensions_GetOwningPlayerInputType final
{
public:
	const class UUserWidget*                      WidgetContextObject;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECommonInputType                              ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonUIExtensions_GetOwningPlayerInputType;

// Function GbxUIUMG.CommonUIExtensions.IsOwningPlayerUsingGamepad
// 0x0010 (0x0010 - 0x0000)
struct CommonUIExtensions_IsOwningPlayerUsingGamepad final
{
public:
	const class UUserWidget*                      WidgetContextObject;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonUIExtensions_IsOwningPlayerUsingGamepad;

// Function GbxUIUMG.CommonUIExtensions.IsOwningPlayerUsingTouch
// 0x0010 (0x0010 - 0x0000)
struct CommonUIExtensions_IsOwningPlayerUsingTouch final
{
public:
	const class UUserWidget*                      WidgetContextObject;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CommonUIExtensions_IsOwningPlayerUsingTouch;

// Function GbxUIUMG.CommonUIExtensions.PopContentFromLayer
// 0x0008 (0x0008 - 0x0000)
struct CommonUIExtensions_PopContentFromLayer final
{
public:
	class UCommonActivatableWidget*               ActivatableWidget;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonUIExtensions_PopContentFromLayer;

// Function GbxUIUMG.CommonUIExtensions.PushContentToLayer_ForPlayer
// 0x0020 (0x0020 - 0x0000)
struct CommonUIExtensions_PushContentToLayer_ForPlayer final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           LayerName;                                         // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCommonActivatableWidget>   WidgetClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonActivatableWidget*               ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonUIExtensions_PushContentToLayer_ForPlayer;

// Function GbxUIUMG.CommonUIExtensions.PushStreamedContentToLayer_ForPlayer
// 0x0038 (0x0038 - 0x0000)
struct CommonUIExtensions_PushStreamedContentToLayer_ForPlayer final
{
public:
	const class ULocalPlayer*                     LocalPlayer;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           LayerName;                                         // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0010(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonUIExtensions_PushStreamedContentToLayer_ForPlayer;

// Function GbxUIUMG.CommonUIExtensions.ResumeInputForPlayer
// 0x0010 (0x0010 - 0x0000)
struct CommonUIExtensions_ResumeInputForPlayer final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SuspendToken;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonUIExtensions_ResumeInputForPlayer;

// Function GbxUIUMG.CommonUIExtensions.SuspendInputForPlayer
// 0x0018 (0x0018 - 0x0000)
struct CommonUIExtensions_SuspendInputForPlayer final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SuspendReason;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CommonUIExtensions_SuspendInputForPlayer;

// Function GbxUIUMG.GbxUIUMGButtonBase.SetButtonText
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGButtonBase_SetButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGButtonBase_SetButtonText;

// Function GbxUIUMG.GbxUIUMGButtonBase.UpdateButtonText
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGButtonBase_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGButtonBase_UpdateButtonText;

// Function GbxUIUMG.GbxUIUMGButtonRemapping.SetButtonKey
// 0x0018 (0x0018 - 0x0000)
struct GbxUIUMGButtonRemapping_SetButtonKey final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGButtonRemapping_SetButtonKey;

// Function GbxUIUMG.GbxUIUMGButtonRemapping.UpdateButtonKeyBrush
// 0x00C0 (0x00C0 - 0x0000)
struct GbxUIUMGButtonRemapping_UpdateButtonKeyBrush final
{
public:
	struct FSlateBrush                            InKeyBrush;                                        // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bEmptyBrush;                                       // 0x00B0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0xF];                                       // 0x00B1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxUIUMGButtonRemapping_UpdateButtonKeyBrush;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget.SetForceShowHoldFeedback
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGEnhancedInput_ActionWidget_SetForceShowHoldFeedback final
{
public:
	bool                                          bCanShow;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_ActionWidget_SetForceShowHoldFeedback;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget.SetIconRimBrush
// 0x00B0 (0x00B0 - 0x0000)
struct GbxUIUMGEnhancedInput_ActionWidget_SetIconRimBrush final
{
public:
	struct FSlateBrush                            InIconRimBrush;                                    // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_ActionWidget_SetIconRimBrush;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget.SetIconSize
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGEnhancedInput_ActionWidget_SetIconSize final
{
public:
	struct FVector2D                              InIconSize;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_ActionWidget_SetIconSize;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget.SetInputAction
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGEnhancedInput_ActionWidget_SetInputAction final
{
public:
	struct FDataTableRowHandle                    NewInputAction;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_ActionWidget_SetInputAction;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget.SetInputActions
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGEnhancedInput_ActionWidget_SetInputActions final
{
public:
	TArray<struct FDataTableRowHandle>            NewInputActions;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_ActionWidget_SetInputActions;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget.SetProgressMaterial
// 0x00C0 (0x00C0 - 0x0000)
struct GbxUIUMGEnhancedInput_ActionWidget_SetProgressMaterial final
{
public:
	struct FSlateBrush                            InProgressMaterialBrush;                           // 0x0000(0x00B0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   InProgressMaterialParam;                           // 0x00B0(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_ActionWidget_SetProgressMaterial;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget.SetProgressValue
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGEnhancedInput_ActionWidget_SetProgressValue final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_ActionWidget_SetProgressValue;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget.GetDisplayText
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGEnhancedInput_ActionWidget_GetDisplayText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_ActionWidget_GetDisplayText;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget.GetIcon
// 0x00B0 (0x00B0 - 0x0000)
struct GbxUIUMGEnhancedInput_ActionWidget_GetIcon final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_ActionWidget_GetIcon;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_BoundActionButton.BP_OnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGEnhancedInput_BoundActionButton_BP_OnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_BoundActionButton_BP_OnActionProgress;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_BoundActionButton.NativeOnActionProgress
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGEnhancedInput_BoundActionButton_NativeOnActionProgress final
{
public:
	float                                         HeldPercent;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_BoundActionButton_NativeOnActionProgress;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_BoundActionButton.SetInputAction
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGEnhancedInput_BoundActionButton_SetInputAction final
{
public:
	struct FDataTableRowHandle                    NewInputAction;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_BoundActionButton_SetInputAction;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_BoundActionButton.SetInputActions
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGEnhancedInput_BoundActionButton_SetInputActions final
{
public:
	TArray<struct FDataTableRowHandle>            NewInputActions;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_BoundActionButton_SetInputActions;

// Function GbxUIUMG.GbxUIUMGEnhancedInput_BoundActionButton.ShowHoldFeedback
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGEnhancedInput_BoundActionButton_ShowHoldFeedback final
{
public:
	bool                                          bShowFeedback;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGEnhancedInput_BoundActionButton_ShowHoldFeedback;

// Function GbxUIUMG.GbxUIUMGExtensionPointWidget.OnWidgetDeactivated
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGExtensionPointWidget_OnWidgetDeactivated final
{
public:
	class UGbxUIUMGActivatableWidget*             Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGExtensionPointWidget_OnWidgetDeactivated;

// Function GbxUIUMG.GbxUIUMGIndicatorManager.AddIndicator
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGIndicatorManager_AddIndicator final
{
public:
	class UGbxUIUMGIndicatorDescriptor*           IndicatorDescriptor;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorManager_AddIndicator;

// Function GbxUIUMG.GbxUIUMGIndicatorManager.RemoveIndicator
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGIndicatorManager_RemoveIndicator final
{
public:
	class UGbxUIUMGIndicatorDescriptor*           IndicatorDescriptor;                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorManager_RemoveIndicator;

// Function GbxUIUMG.GbxUIUMGIndicatorWidget.BP_BindIndicator
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGIndicatorWidget_BP_BindIndicator final
{
public:
	const class UGbxUIUMGIndicatorDescriptor*     Indicator;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorWidget_BP_BindIndicator;

// Function GbxUIUMG.GbxUIUMGIndicatorWidget.BP_UnbindIndicator
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGIndicatorWidget_BP_UnbindIndicator final
{
public:
	const class UGbxUIUMGIndicatorDescriptor*     Indicator;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorWidget_BP_UnbindIndicator;

// Function GbxUIUMG.GbxUIUMGPlayerSubsystem.AddUIPrototypeWidgetToPlayer
// 0x0018 (0x0018 - 0x0000)
struct GbxUIUMGPlayerSubsystem_AddUIPrototypeWidgetToPlayer final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULocalPlayer*                     LocalPlayerIn;                                     // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGPlayerSubsystem_AddUIPrototypeWidgetToPlayer;

// Function GbxUIUMG.GbxUIUMGPlayerSubsystem.AddUIStateToPlayer
// 0x0018 (0x0018 - 0x0000)
struct GbxUIUMGPlayerSubsystem_AddUIStateToPlayer final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InState;                                           // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULocalPlayer*                     LocalPlayerIn;                                     // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGPlayerSubsystem_AddUIStateToPlayer;

// Function GbxUIUMG.GbxUIUMGPlayerSubsystem.RemoveUIPrototypeWidgetToPlayer
// 0x0018 (0x0018 - 0x0000)
struct GbxUIUMGPlayerSubsystem_RemoveUIPrototypeWidgetToPlayer final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULocalPlayer*                     LocalPlayerIn;                                     // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGPlayerSubsystem_RemoveUIPrototypeWidgetToPlayer;

// Function GbxUIUMG.GbxUIUMGPlayerSubsystem.RemoveUIStateToPlayer
// 0x0018 (0x0018 - 0x0000)
struct GbxUIUMGPlayerSubsystem_RemoveUIStateToPlayer final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           InState;                                           // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class ULocalPlayer*                     LocalPlayerIn;                                     // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGPlayerSubsystem_RemoveUIStateToPlayer;

// Function GbxUIUMG.GbxUIUMGPlayerSubsystem.GetUIPrototypeContainerWidget
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGPlayerSubsystem_GetUIPrototypeContainerWidget final
{
public:
	class UGbxUIUMGPrototypeContainerWidget*      ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGPlayerSubsystem_GetUIPrototypeContainerWidget;

// Function GbxUIUMG.GbxUIUMGPlayerSubsystem.HasUIState
// 0x000C (0x000C - 0x0000)
struct GbxUIUMGPlayerSubsystem_HasUIState final
{
public:
	struct FGameplayTag                           InState;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxUIUMGPlayerSubsystem_HasUIState;

// Function GbxUIUMG.GbxUIUMGPlayerSubsystem.RequestStateAdd
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGPlayerSubsystem_RequestStateAdd final
{
public:
	struct FGameplayTag                           InState;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGPlayerSubsystem_RequestStateAdd;

// Function GbxUIUMG.GbxUIUMGPlayerSubsystem.RequestStateRemove
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGPlayerSubsystem_RequestStateRemove final
{
public:
	struct FGameplayTag                           InState;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGPlayerSubsystem_RequestStateRemove;

// Function GbxUIUMG.GbxUIUMGPlayerSubsystem.RequestStateToggle
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGPlayerSubsystem_RequestStateToggle final
{
public:
	struct FGameplayTag                           InState;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGPlayerSubsystem_RequestStateToggle;

// Function GbxUIUMG.GbxUIUMGRichTextInlineWidget_Base.BP_OnWidgetSetSize
// 0x000C (0x000C - 0x0000)
struct GbxUIUMGRichTextInlineWidget_Base_BP_OnWidgetSetSize final
{
public:
	float                                         WantedSize;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WidthOverride;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightOverride;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGRichTextInlineWidget_Base_BP_OnWidgetSetSize;

// Function GbxUIUMG.GbxUIUMGRotator.BP_OnDefaultOptionSpecified
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGRotator_BP_OnDefaultOptionSpecified final
{
public:
	int32                                         DefaultOptionIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGRotator_BP_OnDefaultOptionSpecified;

// Function GbxUIUMG.GbxUIUMGTabButtonBase.SetTabLabelInfo_Implementation
// 0x00F0 (0x00F0 - 0x0000)
struct GbxUIUMGTabButtonBase_SetTabLabelInfo_Implementation final
{
public:
	struct FGbxUIUMGTabDescriptor                 TabLabelInfo;                                      // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGTabButtonBase_SetTabLabelInfo_Implementation;

// Function GbxUIUMG.GbxUIUMGTabButtonInterface.SetTabLabelInfo
// 0x00F0 (0x00F0 - 0x0000)
struct GbxUIUMGTabButtonInterface_SetTabLabelInfo final
{
public:
	struct FGbxUIUMGTabDescriptor                 TabDescriptor;                                     // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGTabButtonInterface_SetTabLabelInfo;

// Function GbxUIUMG.GbxUIUMGTabListWidgetBase.GetVisibleTabCount
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGTabListWidgetBase_GetVisibleTabCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGTabListWidgetBase_GetVisibleTabCount;

// Function GbxUIUMG.GbxUIUMGTabListWidgetBase.IsTabVisible
// 0x000C (0x000C - 0x0000)
struct GbxUIUMGTabListWidgetBase_IsTabVisible final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxUIUMGTabListWidgetBase_IsTabVisible;

// Function GbxUIUMG.GbxUIUMGTabListWidgetBase.RegisterDynamicTab
// 0x0100 (0x0100 - 0x0000)
struct GbxUIUMGTabListWidgetBase_RegisterDynamicTab final
{
public:
	struct FGbxUIUMGTabDescriptor                 TabDescriptor;                                     // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0xF];                                       // 0x00F1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxUIUMGTabListWidgetBase_RegisterDynamicTab;

// Function GbxUIUMG.GbxUIUMGTabListWidgetBase.SetTabHiddenState
// 0x000C (0x000C - 0x0000)
struct GbxUIUMGTabListWidgetBase_SetTabHiddenState final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHidden;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxUIUMGTabListWidgetBase_SetTabHiddenState;

// Function GbxUIUMG.GbxUIUMGTabListWidgetBase.GetPreregisteredTabInfo
// 0x0110 (0x0110 - 0x0000)
struct GbxUIUMGTabListWidgetBase_GetPreregisteredTabInfo final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxUIUMGTabDescriptor                 OutTabInfo;                                        // 0x0010(0x00F0)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0100(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_101[0xF];                                      // 0x0101(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxUIUMGTabListWidgetBase_GetPreregisteredTabInfo;

// Function GbxUIUMG.GbxUIUMGTabListWidgetBase.IsFirstTabActive
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGTabListWidgetBase_IsFirstTabActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGTabListWidgetBase_IsFirstTabActive;

// Function GbxUIUMG.GbxUIUMGTabListWidgetBase.IsLastTabActive
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGTabListWidgetBase_IsLastTabActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGTabListWidgetBase_IsLastTabActive;

// Function GbxUIUMG.GbxUIUMGTickWidget.BP_TickWidget
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGTickWidget_BP_TickWidget final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGTickWidget_BP_TickWidget;

// Function GbxUIUMG.GbxUIUMGViewModelWidget.CreateAndRegisterViewModel
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGViewModelWidget_CreateAndRegisterViewModel final
{
public:
	TSubclassOf<class UGbxUIUMGViewModel>         ViewModelClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxUIUMGViewModel*                     ViewModel;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGViewModelWidget_CreateAndRegisterViewModel;

// Function GbxUIUMG.GbxUIUMGViewModelWidget.RegisterViewModel
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGViewModelWidget_RegisterViewModel final
{
public:
	class UGbxUIUMGViewModel*                     ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGViewModelWidget_RegisterViewModel;

// Function GbxUIUMG.GbxUIUMGWidgetFactory.FindWidgetClassForData
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGWidgetFactory_FindWidgetClassForData final
{
public:
	const class UObject*                          data;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGWidgetFactory_FindWidgetClassForData;

// Function GbxUIUMG.GbxUIUMGWidget_Settings.AttemptToPopNavigation
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGWidget_Settings_AttemptToPopNavigation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGWidget_Settings_AttemptToPopNavigation;

// Function GbxUIUMG.GbxUIUMGWidget_Settings.GetSettingCollection
// 0x0018 (0x0018 - 0x0000)
struct GbxUIUMGWidget_Settings_GetSettingCollection final
{
public:
	class FName                                   SettingDevName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasAnySettings;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingCollection*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGWidget_Settings_GetSettingCollection;

// Function GbxUIUMG.GbxUIUMGWidget_Settings.NavigateToSetting
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGWidget_Settings_NavigateToSetting final
{
public:
	class FName                                   SettingDevName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGWidget_Settings_NavigateToSetting;

// Function GbxUIUMG.GbxUIUMGWidget_Settings.NavigateToSettings
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGWidget_Settings_NavigateToSettings final
{
public:
	TArray<class FName>                           SettingDevNames;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGWidget_Settings_NavigateToSettings;

// Function GbxUIUMG.GbxUIUMGWidget_Settings.OnSettingsDirtyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGWidget_Settings_OnSettingsDirtyStateChanged final
{
public:
	bool                                          bSettingsDirty;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGWidget_Settings_OnSettingsDirtyStateChanged;

// Function GbxUIUMG.GbxUIUMGWidget_Settings.HaveSettingsBeenChanged
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGWidget_Settings_HaveSettingsBeenChanged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGWidget_Settings_HaveSettingsBeenChanged;

// Function GbxUIUMG.PrimaryGameLayout.RegisterLayer
// 0x0010 (0x0010 - 0x0000)
struct PrimaryGameLayout_RegisterLayer final
{
public:
	struct FGameplayTag                           LayerTag;                                          // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCommonActivatableWidgetContainerBase*  LayerWidget;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrimaryGameLayout_RegisterLayer;

// Function GbxUIUMG.UIExtensionSubsystem.K2_RegisterExtensionAsData
// 0x0030 (0x0030 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionAsData final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                data;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         priority;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIExtensionHandle                     ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIExtensionSubsystem_K2_RegisterExtensionAsData;

// Function GbxUIUMG.UIExtensionSubsystem.K2_RegisterExtensionAsDataForContext
// 0x0038 (0x0038 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionAsDataForContext final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextObject;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                data;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         priority;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIExtensionHandle                     ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIExtensionSubsystem_K2_RegisterExtensionAsDataForContext;

// Function GbxUIUMG.UIExtensionSubsystem.K2_RegisterExtensionAsWidget
// 0x0030 (0x0030 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionAsWidget final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         priority;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIExtensionHandle                     ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIExtensionSubsystem_K2_RegisterExtensionAsWidget;

// Function GbxUIUMG.UIExtensionSubsystem.K2_RegisterExtensionAsWidgetForContext
// 0x0038 (0x0038 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionAsWidgetForContext final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextObject;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         priority;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIExtensionHandle                     ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIExtensionSubsystem_K2_RegisterExtensionAsWidgetForContext;

// Function GbxUIUMG.UIExtensionSubsystem.K2_RegisterExtensionPoint
// 0x0048 (0x0048 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionPoint final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIExtensionPointMatch                        ExtensionPointTagMatchType;                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         AllowedDataClasses;                                // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(EUIExtensionAction Action, const struct FUIExtensionRequest& ExtensionRequest)> ExtensionCallback; // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUIExtensionPointHandle                ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIExtensionSubsystem_K2_RegisterExtensionPoint;

// Function GbxUIUMG.UIExtensionSubsystem.UnregisterExtension
// 0x0018 (0x0018 - 0x0000)
struct UIExtensionSubsystem_UnregisterExtension final
{
public:
	struct FUIExtensionHandle                     ExtensionHandle;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIExtensionSubsystem_UnregisterExtension;

// Function GbxUIUMG.UIExtensionSubsystem.UnregisterExtensionPoint
// 0x0018 (0x0018 - 0x0000)
struct UIExtensionSubsystem_UnregisterExtensionPoint final
{
public:
	struct FUIExtensionPointHandle                ExtensionPointHandle;                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIExtensionSubsystem_UnregisterExtensionPoint;

// Function GbxUIUMG.UIExtensionHandleFunctions.IsValid
// 0x0020 (0x0020 - 0x0000)
struct UIExtensionHandleFunctions_IsValid final
{
public:
	struct FUIExtensionHandle                     Handle;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIExtensionHandleFunctions_IsValid;

// Function GbxUIUMG.UIExtensionHandleFunctions.Unregister
// 0x0018 (0x0018 - 0x0000)
struct UIExtensionHandleFunctions_Unregister final
{
public:
	struct FUIExtensionHandle                     Handle;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIExtensionHandleFunctions_Unregister;

// Function GbxUIUMG.UIExtensionPointHandleFunctions.IsValid
// 0x0020 (0x0020 - 0x0000)
struct UIExtensionPointHandleFunctions_IsValid final
{
public:
	struct FUIExtensionPointHandle                Handle;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIExtensionPointHandleFunctions_IsValid;

// Function GbxUIUMG.UIExtensionPointHandleFunctions.Unregister
// 0x0018 (0x0018 - 0x0000)
struct UIExtensionPointHandleFunctions_Unregister final
{
public:
	struct FUIExtensionPointHandle                Handle;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIExtensionPointHandleFunctions_Unregister;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetAutoRemoveWhenIndicatorComponentIsNull
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetAutoRemoveWhenIndicatorComponentIsNull final
{
public:
	bool                                          CanAutomaticallyRemove;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetAutoRemoveWhenIndicatorComponentIsNull;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetBoundingBoxAnchor
// 0x0018 (0x0018 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetBoundingBoxAnchor final
{
public:
	struct FVector                                InBoundingBoxAnchor;                               // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetBoundingBoxAnchor;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetClampToScreen
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetClampToScreen final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetClampToScreen;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetComponentSocketName
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetComponentSocketName final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetComponentSocketName;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetDataObject
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetDataObject final
{
public:
	class UObject*                                InDataObject;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetDataObject;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetDesiredVisibility
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetDesiredVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetDesiredVisibility;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetDistanceFromOwningPlayer
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetDistanceFromOwningPlayer final
{
public:
	float                                         InDistanceFromOwningPlayer;                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetDistanceFromOwningPlayer;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetDistanceRatio
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetDistanceRatio final
{
public:
	float                                         InDistanceRatio;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetDistanceRatio;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetHAlign
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetHAlign final
{
public:
	EHorizontalAlignment                          InHAlignment;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetHAlign;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetIndicatorClass
// 0x0028 (0x0028 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetIndicatorClass final
{
public:
	TSoftClassPtr<class UClass>                   InIndicatorWidgetClass;                            // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetIndicatorClass;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetIsInRangeVisible
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetIsInRangeVisible final
{
public:
	bool                                          bInRangeVisible;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetIsInRangeVisible;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetLocalPlayer final
{
public:
	class ULocalPlayer*                           InLocalPlayer;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetLocalPlayer;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetMaxVisibilityRange
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetMaxVisibilityRange final
{
public:
	float                                         InMaxVisibilityRange;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetMaxVisibilityRange;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetMinVisibilityRange
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetMinVisibilityRange final
{
public:
	float                                         InMinVisibilityRange;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetMinVisibilityRange;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetPosition
// 0x0018 (0x0018 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetPosition final
{
public:
	struct FVector                                InPosition;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetPosition;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetPriority
// 0x0004 (0x0004 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetPriority final
{
public:
	int32                                         InPriority;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetPriority;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetProjectionMode
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetProjectionMode final
{
public:
	EIndicatorCanvasProjectionMode                InProjectionMode;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetProjectionMode;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetSceneComponent
// 0x0008 (0x0008 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetSceneComponent final
{
public:
	class USceneComponent*                        InComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetSceneComponent;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetScreenSpaceOffset
// 0x0010 (0x0010 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetScreenSpaceOffset final
{
public:
	struct FVector2D                              Offset;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIUMGIndicatorDescriptor_SetScreenSpaceOffset;

// Function GbxUIUMG.GbxUIUMGIndicatorDescriptor.SetShowClampToScreenArrow
// 0x0001 (0x0001 - 0x0000)
struct GbxUIUMGIndicatorDescriptor_SetShowClampToScreenArrow final
{
public:
