#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxUICoherent

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GbxEnhancedInput_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GbxUICoherent_structs.hpp"
#include "GbxEngine_classes.hpp"


namespace SDK
{

// Class GbxUICoherent.GbxUIBlueprintHelperLibrary
// 0x0000 (0x0028 - 0x0028)
class UGbxUIBlueprintHelperLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void PlayUIGbxFeedback2D(class UObject* WorldContext, const FGameDataHandleProperty_ FeedbackData, TScriptInterface<class IGbxFeedbackObserver> Observer, bool bIgnoreObserver, int32 PlayFlags, bool bLoop, float scale, class UObject* SourceContext);
	static struct FGbxAudioPlaybackInstance PostUIEvent(class UObject* WorldContextObject, const struct FGameplayTag& EventTag, FGbxDefPtrProperty_ OwningWidgetDef, const struct FVector2D& position, const class FString& DebugName);
	static void StopGbxFeedback(class UObject* WorldContext, const FGameDataHandleProperty_ FeedbackData, TScriptInterface<class IGbxFeedbackObserver> Observer, bool bIgnoreObserver);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIBlueprintHelperLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIBlueprintHelperLibrary")
	}
	static class UGbxUIBlueprintHelperLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIBlueprintHelperLibrary>();
	}
};
DUMPER7_ASSERTS_UGbxUIBlueprintHelperLibrary;

// Class GbxUICoherent.GbxUICoherentSettings
// 0x0030 (0x0068 - 0x0038)
class UGbxUICoherentSettings final : public UDeveloperSettings
{
public:
	TArray<struct FSoftObjectPath>                AlwaysLoadedUIAssets;                              // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UInputMappingContext>> DefaultUIMappingContexts;                     // 0x0048(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UInputMappingContext>> DebugUIMappingContexts;                       // 0x0058(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUICoherentSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUICoherentSettings")
	}
	static class UGbxUICoherentSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUICoherentSettings>();
	}
};
DUMPER7_ASSERTS_UGbxUICoherentSettings;

// Class GbxUICoherent.GbxUICoherentSubsystem
// 0x0008 (0x0038 - 0x0030)
class UGbxUICoherentSubsystem : public UGameInstanceSubsystem
{
public:
	class UGbxUISystem*                           UISystemInstance;                                  // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUICoherentSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUICoherentSubsystem")
	}
	static class UGbxUICoherentSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUICoherentSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxUICoherentSubsystem;

// Class GbxUICoherent.GbxUIEnhancedInputComponent
// 0x0000 (0x01E0 - 0x01E0)
class UGbxUIEnhancedInputComponent : public UGbxEnhancedInputComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIEnhancedInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIEnhancedInputComponent")
	}
	static class UGbxUIEnhancedInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIEnhancedInputComponent>();
	}
};
DUMPER7_ASSERTS_UGbxUIEnhancedInputComponent;

// Class GbxUICoherent.GbxUIScript
// 0x0000 (0x0028 - 0x0028)
class UGbxUIScript : public UObject
{
public:
	void Activate(class UObject* WorldContextObject, FGbxDefPtrProperty_ OwningWidgetDef) const;
	void deactivate(class UObject* WorldContextObject, FGbxDefPtrProperty_ OwningWidgetDef) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIScript")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIScript")
	}
	static class UGbxUIScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIScript>();
	}
};
DUMPER7_ASSERTS_UGbxUIScript;

// Class GbxUICoherent.GbxUISkillWidgetBehaviors
// 0x0000 (0x0028 - 0x0028)
class UGbxUISkillWidgetBehaviors final : public UObject
{
public:
	static TArray<class FName> GetAvailableDataBehaviors();
	static TArray<class FName> GetAvailableStateBehaviors();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUISkillWidgetBehaviors")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUISkillWidgetBehaviors")
	}
	static class UGbxUISkillWidgetBehaviors* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUISkillWidgetBehaviors>();
	}
};
DUMPER7_ASSERTS_UGbxUISkillWidgetBehaviors;

// Class GbxUICoherent.GbxUISystem
// 0x00F0 (0x0118 - 0x0028)
class UGbxUISystem : public UObject
{
public:
	class UGameInstance*                          GameInst;                                          // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGbxUIViewManager*>              ViewMgrs;                                          // 0x0038(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         UISystemClassPath;                                 // 0x0068(0x0020)(ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         UIViewManagerClassName;                            // 0x0088(0x0020)(ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         UIInputManagerClassName;                           // 0x00A8(0x0020)(ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x50];                                      // 0x00C8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUISystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUISystem")
	}
	static class UGbxUISystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUISystem>();
	}
};
DUMPER7_ASSERTS_UGbxUISystem;

// Class GbxUICoherent.GbxUIView
// 0x05A8 (0x05D0 - 0x0028)
class alignas(0x10) UGbxUIView : public UObject
{
public:
	uint8                                         Pad_28[0x398];                                     // 0x0028(0x0398)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxUIViewHandle                       Handle;                                            // 0x03C0(0x0010)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D0[0x200];                                    // 0x03D0(0x0200)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnhancedInputControlMappingsRebuilt();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIView")
	}
	static class UGbxUIView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIView>();
	}
};
DUMPER7_ASSERTS_UGbxUIView;

// Class GbxUICoherent.GbxUIViewManager
// 0x0160 (0x0188 - 0x0028)
class UGbxUIViewManager : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGbxUIView*>                     Views;                                             // 0x0040(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         UIStateManagerClassName;                           // 0x0060(0x0020)(ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         UIViewClassName;                                   // 0x0090(0x0020)(ZeroConstructor, Config, GlobalConfig, NoClear, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxUIViewHandle                       Handle;                                            // 0x00B0(0x0010)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                Context;                                           // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0xC0];                                      // 0x00C8(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIViewManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIViewManager")
	}
	static class UGbxUIViewManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIViewManager>();
	}
};
DUMPER7_ASSERTS_UGbxUIViewManager;

// Class GbxUICoherent.NexusConfigStoreUIComponents
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStoreUIComponents final : public UNexusConfigStoreBasic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreUIComponents")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreUIComponents")
	}
	static class UNexusConfigStoreUIComponents* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreUIComponents>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreUIComponents;

// Class GbxUICoherent.NexusConfigStoreUIPages
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStoreUIPages final : public UNexusConfigStoreBasic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreUIPages")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreUIPages")
	}
	static class UNexusConfigStoreUIPages* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreUIPages>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreUIPages;

// Class GbxUICoherent.NexusConfigStoreUIToolTipDataDefs
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStoreUIToolTipDataDefs final : public UNexusConfigStoreBasic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreUIToolTipDataDefs")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreUIToolTipDataDefs")
	}
	static class UNexusConfigStoreUIToolTipDataDefs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreUIToolTipDataDefs>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreUIToolTipDataDefs;

// Class GbxUICoherent.NexusConfigStoreUIViewDefs
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStoreUIViewDefs final : public UNexusConfigStoreBasic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreUIViewDefs")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreUIViewDefs")
	}
	static class UNexusConfigStoreUIViewDefs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreUIViewDefs>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreUIViewDefs;

// Class GbxUICoherent.NexusConfigStoreUIWidgetClasses
// 0x0050 (0x03E0 - 0x0390)
class UNexusConfigStoreUIWidgetClasses final : public UNexusConfigStoreBasic
{
public:
	uint8                                         Pad_390[0x50];                                     // 0x0390(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreUIWidgetClasses")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreUIWidgetClasses")
	}
	static class UNexusConfigStoreUIWidgetClasses* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreUIWidgetClasses>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreUIWidgetClasses;

// Class GbxUICoherent.NexusConfigStoreUIWidgetDefs
// 0x0050 (0x03E0 - 0x0390)
class UNexusConfigStoreUIWidgetDefs final : public UNexusConfigStoreBasic
{
public:
	uint8                                         Pad_390[0x50];                                     // 0x0390(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void GetActionNames(class UObject* EditObject, TArray<class FName>* OutNames);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreUIWidgetDefs")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreUIWidgetDefs")
	}
	static class UNexusConfigStoreUIWidgetDefs* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreUIWidgetDefs>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreUIWidgetDefs;

}

