#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxUIUMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "AdvancedWidgets_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUI_classes.hpp"
#include "GbxUIUMG_structs.hpp"
#include "UMG_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GbxGame_structs.hpp"
#include "ModelViewViewModel_classes.hpp"


namespace SDK
{

// Class GbxUIUMG.AsyncAction_CreateWidgetAsync
// 0x0070 (0x00A0 - 0x0030)
class UAsyncAction_CreateWidgetAsync final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(class UUserWidget* UserWidget)> OnComplete;                        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x60];                                      // 0x0040(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_CreateWidgetAsync* CreateWidgetAsync(class UObject* WorldContextObject, TSoftClassPtr<class UClass> UserWidgetSoftClass, class APlayerController* OwningPlayer, bool bSuspendInputUntilComplete);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAction_CreateWidgetAsync")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAction_CreateWidgetAsync")
	}
	static class UAsyncAction_CreateWidgetAsync* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_CreateWidgetAsync>();
	}
};
DUMPER7_ASSERTS_UAsyncAction_CreateWidgetAsync;

// Class GbxUIUMG.AsyncAction_PushContentToLayerForPlayer
// 0x0070 (0x00A0 - 0x0030)
class UAsyncAction_PushContentToLayerForPlayer final : public UCancellableAsyncAction
{
public:
	TMulticastInlineDelegate<void(class UCommonActivatableWidget* UserWidget)> BeforePush;           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UCommonActivatableWidget* UserWidget)> AfterPush;            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x50];                                      // 0x0050(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_PushContentToLayerForPlayer* PushContentToLayerForPlayer(class APlayerController* OwningPlayer, TSoftClassPtr<class UClass> WidgetClass, const struct FGameplayTag& LayerName, bool bSuspendInputUntilComplete);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAction_PushContentToLayerForPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAction_PushContentToLayerForPlayer")
	}
	static class UAsyncAction_PushContentToLayerForPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_PushContentToLayerForPlayer>();
	}
};
DUMPER7_ASSERTS_UAsyncAction_PushContentToLayerForPlayer;

// Class GbxUIUMG.CommonLocalPlayer
// 0x0000 (0x0000 - 0x0000)
class ICommonLocalPlayer final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonLocalPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonLocalPlayer")
	}
	static class ICommonLocalPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICommonLocalPlayer>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICommonLocalPlayer;

// Class GbxUIUMG.CommonUIExtensions
// 0x0000 (0x0028 - 0x0028)
class UCommonUIExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class ULocalPlayer* GetLocalPlayerFromController(class APlayerController* PlayerController);
	static ECommonInputType GetOwningPlayerInputType(const class UUserWidget* WidgetContextObject);
	static bool IsOwningPlayerUsingGamepad(const class UUserWidget* WidgetContextObject);
	static bool IsOwningPlayerUsingTouch(const class UUserWidget* WidgetContextObject);
	static void PopContentFromLayer(class UCommonActivatableWidget* ActivatableWidget);
	static class UCommonActivatableWidget* PushContentToLayer_ForPlayer(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName, TSubclassOf<class UCommonActivatableWidget> WidgetClass);
	static void PushStreamedContentToLayer_ForPlayer(const class ULocalPlayer* LocalPlayer, const struct FGameplayTag& LayerName, TSoftClassPtr<class UClass> WidgetClass);
	static void ResumeInputForPlayer(class APlayerController* PlayerController, class FName SuspendToken);
	static class FName SuspendInputForPlayer(class APlayerController* PlayerController, class FName SuspendReason);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommonUIExtensions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommonUIExtensions")
	}
	static class UCommonUIExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommonUIExtensions>();
	}
};
DUMPER7_ASSERTS_UCommonUIExtensions;

// Class GbxUIUMG.GbxUIUMGActionRouterBase
// 0x0000 (0x0178 - 0x0178)
class UGbxUIUMGActionRouterBase final : public UCommonUIActionRouterBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGActionRouterBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGActionRouterBase")
	}
	static class UGbxUIUMGActionRouterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGActionRouterBase>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGActionRouterBase;

// Class GbxUIUMG.GbxUIUMGActionWidget
// 0x0000 (0x0430 - 0x0430)
class UGbxUIUMGActionWidget final : public UCommonActionWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGActionWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGActionWidget")
	}
	static class UGbxUIUMGActionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGActionWidget>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGActionWidget;

// Class GbxUIUMG.GbxUIUMGActivatableWidget
// 0x0108 (0x0538 - 0x0430)
class UGbxUIUMGActivatableWidget : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_430[0x50];                                     // 0x0430(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UGbxUIUMGActivatableWidget* Widget)> OnInAnimDone;           // 0x0480(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGbxUIUMGActivatableWidget* Widget)> OnOutAnimDone;          // 0x0490(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGbxUIUMGActivatableWidget* Widget)> OnInAnimCanceled;       // 0x04A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UGbxUIUMGActivatableWidget* Widget)> OnOutAnimCanceled;      // 0x04B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGbxUIUMGTickWidgetSettings            TickSettings;                                      // 0x04C0(0x0003)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bUpdateDataOnActivated;                            // 0x04C3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdateDataOnlyWhenActivated;                      // 0x04C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStopAllAnimWhenDeactivated;                       // 0x04C5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRegisterWidgetToActionRouter;                     // 0x04C6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C7[0x1];                                      // 0x04C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxUIUMGAnimPlaybackSettings          InAnimPlaybackSettings;                            // 0x04C8(0x0014)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGbxUIUMGIdleAnimPlaybackSettings      IdleAnimPlaybackSettings;                          // 0x04DC(0x0014)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGbxUIUMGAnimPlaybackSettings          OutAnimPlaybackSettings;                           // 0x04F0(0x0014)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EUMGWidgetInputMode                           InputConfig;                                       // 0x0504(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMouseCaptureMode                             GameMouseCaptureMode;                              // 0x0505(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_506[0x2];                                      // 0x0506(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Animation_In;                                      // 0x0508(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       Animation_Idle;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       Animation_Out;                                     // 0x0518(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_520[0x10];                                     // 0x0520(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxUIUMGBoundActionBar*                BoundActionBar;                                    // 0x0530(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnBoundActionButtonExecuted();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGActivatableWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGActivatableWidget")
	}
	static class UGbxUIUMGActivatableWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGActivatableWidget>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGActivatableWidget;

// Class GbxUIUMG.GbxUIUMGActivatableWidgetQueue
// 0x0000 (0x0290 - 0x0290)
class UGbxUIUMGActivatableWidgetQueue final : public UCommonActivatableWidgetQueue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGActivatableWidgetQueue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGActivatableWidgetQueue")
	}
	static class UGbxUIUMGActivatableWidgetQueue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGActivatableWidgetQueue>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGActivatableWidgetQueue;

// Class GbxUIUMG.GbxUIUMGActivatableWidgetStack
// 0x0000 (0x02A0 - 0x02A0)
class UGbxUIUMGActivatableWidgetStack final : public UCommonActivatableWidgetStack
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGActivatableWidgetStack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGActivatableWidgetStack")
	}
	static class UGbxUIUMGActivatableWidgetStack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGActivatableWidgetStack>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGActivatableWidgetStack;

// Class GbxUIUMG.GbxUIUMGActivatableWidgetSwitcher
// 0x0000 (0x0230 - 0x0230)
class UGbxUIUMGActivatableWidgetSwitcher final : public UCommonActivatableWidgetSwitcher
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGActivatableWidgetSwitcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGActivatableWidgetSwitcher")
	}
	static class UGbxUIUMGActivatableWidgetSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGActivatableWidgetSwitcher>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGActivatableWidgetSwitcher;

// Class GbxUIUMG.GbxUIUMGAnalogSlider
// 0x0000 (0x0680 - 0x0680)
class UGbxUIUMGAnalogSlider final : public UAnalogSlider
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGAnalogSlider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGAnalogSlider")
	}
	static class UGbxUIUMGAnalogSlider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGAnalogSlider>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGAnalogSlider;

// Class GbxUIUMG.GbxUIUMGAnimatedSwitcher
// 0x0000 (0x0220 - 0x0220)
class UGbxUIUMGAnimatedSwitcher final : public UCommonAnimatedSwitcher
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGAnimatedSwitcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGAnimatedSwitcher")
	}
	static class UGbxUIUMGAnimatedSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGAnimatedSwitcher>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGAnimatedSwitcher;

// Class GbxUIUMG.GbxUIUMGBackgroundBlur
// 0x0000 (0x0280 - 0x0280)
class UGbxUIUMGBackgroundBlur final : public UBackgroundBlur
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGBackgroundBlur")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGBackgroundBlur")
	}
	static class UGbxUIUMGBackgroundBlur* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGBackgroundBlur>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGBackgroundBlur;

// Class GbxUIUMG.GbxUIUMGBorder
// 0x0000 (0x0330 - 0x0330)
class UGbxUIUMGBorder final : public UCommonBorder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGBorder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGBorder")
	}
	static class UGbxUIUMGBorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGBorder>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGBorder;

// Class GbxUIUMG.GbxUIUMGBoundActionBar
// 0x0018 (0x0290 - 0x0278)
class UGbxUIUMGBoundActionBar final : public UCommonBoundActionBar
{
public:
	uint8                                         Pad_278[0x10];                                     // 0x0278(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCanTick;                                          // 0x0288(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvertButtons;                                    // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGBoundActionBar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGBoundActionBar")
	}
	static class UGbxUIUMGBoundActionBar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGBoundActionBar>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGBoundActionBar;

// Class GbxUIUMG.GbxUIUMGBoundActionButton
// 0x0000 (0x13D0 - 0x13D0)
class UGbxUIUMGBoundActionButton final : public UCommonBoundActionButton
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGBoundActionButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGBoundActionButton")
	}
	static class UGbxUIUMGBoundActionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGBoundActionButton>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGBoundActionButton;

// Class GbxUIUMG.GbxUIUMGButtonBase
// 0x0020 (0x13D0 - 0x13B0)
#pragma pack(push, 0x1)
class alignas(0x10) UGbxUIUMGButtonBase : public UCommonButtonBase
{
public:
	uint8                                         bOverride_ButtonText : 1;                          // 0x13B0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_13B1[0x7];                                     // 0x13B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ButtonText;                                        // 0x13B8(0x0010)(Edit, NativeAccessSpecifierPrivate)

public:
	void SetButtonText(const class FText& InText);
	void UpdateButtonStyle();
	void UpdateButtonText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGButtonBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGButtonBase")
	}
	static class UGbxUIUMGButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGButtonBase>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UGbxUIUMGButtonBase;

// Class GbxUIUMG.GbxUIUMGRemappingIcon
// 0x0000 (0x13D0 - 0x13D0)
class UGbxUIUMGRemappingIcon final : public UGbxUIUMGButtonBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGRemappingIcon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGRemappingIcon")
	}
	static class UGbxUIUMGRemappingIcon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGRemappingIcon>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGRemappingIcon;

// Class GbxUIUMG.GbxUIUMGButtonRemapping
// 0x0020 (0x13F0 - 0x13D0)
class UGbxUIUMGButtonRemapping final : public UGbxUIUMGButtonBase
{
public:
	struct FKey                                   ButtonKey;                                         // 0x13C8(0x0018)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECommonInputType                              MappingInputType;                                  // 0x13E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_13E1[0xF];                                     // 0x13E1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetButtonKey(const struct FKey& InKey);
	void UpdateButtonKeyBrush(const struct FSlateBrush& InKeyBrush, bool bEmptyBrush);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGButtonRemapping")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGButtonRemapping")
	}
	static class UGbxUIUMGButtonRemapping* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGButtonRemapping>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGButtonRemapping;

// Class GbxUIUMG.GbxUIUMGCanvasPanel
// 0x0000 (0x0190 - 0x0190)
class UGbxUIUMGCanvasPanel final : public UCanvasPanel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGCanvasPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGCanvasPanel")
	}
	static class UGbxUIUMGCanvasPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGCanvasPanel>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGCanvasPanel;

// Class GbxUIUMG.GbxUIUMGCheckBox
// 0x0000 (0x0B20 - 0x0B20)
class UGbxUIUMGCheckBox final : public Ucheckbox
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGCheckBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGCheckBox")
	}
	static class UGbxUIUMGCheckBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGCheckBox>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGCheckBox;

// Class GbxUIUMG.GbxUIUMGCircularThrobber
// 0x0000 (0x0250 - 0x0250)
class UGbxUIUMGCircularThrobber final : public UCircularThrobber
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGCircularThrobber")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGCircularThrobber")
	}
	static class UGbxUIUMGCircularThrobber* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGCircularThrobber>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGCircularThrobber;

// Class GbxUIUMG.GbxUIUMGComboBoxKey
// 0x0000 (0x1950 - 0x1950)
class UGbxUIUMGComboBoxKey final : public UComboBoxKey
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGComboBoxKey")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGComboBoxKey")
	}
	static class UGbxUIUMGComboBoxKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGComboBoxKey>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGComboBoxKey;

// Class GbxUIUMG.GbxUIUMGComboBoxString
// 0x0000 (0x19E0 - 0x19E0)
class UGbxUIUMGComboBoxString final : public UComboBoxString
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGComboBoxString")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGComboBoxString")
	}
	static class UGbxUIUMGComboBoxString* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGComboBoxString>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGComboBoxString;

// Class GbxUIUMG.GbxUIUMGCommonWidget
// 0x0058 (0x0350 - 0x02F8)
class UGbxUIUMGCommonWidget : public UCommonUserWidget
{
public:
	uint8                                         Pad_2F8[0x50];                                     // 0x02F8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxUIUMGTickWidgetSettings            TickSettings;                                      // 0x0348(0x0003)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_34B[0x5];                                      // 0x034B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGCommonWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGCommonWidget")
	}
	static class UGbxUIUMGCommonWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGCommonWidget>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGCommonWidget;

// Class GbxUIUMG.GbxUIUMGConfig
// 0x01C0 (0x01F8 - 0x0038)
class UGbxUIUMGConfig final : public UDeveloperSettings
{
public:
	bool                                          bCreateActionRouterBase;                           // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, TSoftClassPtr<class UClass>> RichTextInlineWidgetsById;                        // 0x0040(0x0050)(Edit, Config, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<TSoftObjectPtr<class UObject>, struct FGbxUIUMG_ActionWidgetDefaultFontValues> ActionWidgetDefaultValuesPerFont; // 0x0090(0x0050)(Edit, Config, NativeAccessSpecifierPrivate)
	TMap<TSubclassOf<class UDataAsset>, struct FGbxUIUMGDataAsset> UIDataAssets;                     // 0x00E0(0x0050)(Edit, Config, NativeAccessSpecifierPrivate)
	TArray<TSoftClassPtr<class UClass>>           WidgetsToLoadAtStartup;                            // 0x0130(0x0010)(Edit, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DefaultUIStates;                                   // 0x0140(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DefaultUITagStates;                                // 0x0168(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UClass>                   DefaultMenuManagerSettings;                        // 0x0190(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMenuManagerListenToPhaseChanged;                  // 0x01B8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   DefaultUIPolicyClass;                              // 0x01C0(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGbxUIUMGCheatsAndDebugPlatformTrait> CheatsAndDebugPlatformTraits;                // 0x01E8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGConfig")
	}
	static class UGbxUIUMGConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGConfig>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGConfig;

// Class GbxUIUMG.GbxUIUMGCustomNavigation
// 0x0000 (0x0320 - 0x0320)
class UGbxUIUMGCustomNavigation final : public UCommonCustomNavigation
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGCustomNavigation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGCustomNavigation")
	}
	static class UGbxUIUMGCustomNavigation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGCustomNavigation>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGCustomNavigation;

// Class GbxUIUMG.GbxUIUMGDataAssetRepo
// 0x0068 (0x0090 - 0x0028)
class UGbxUIUMGDataAssetRepo final : public UObject
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGDataAssetRepo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGDataAssetRepo")
	}
	static class UGbxUIUMGDataAssetRepo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGDataAssetRepo>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGDataAssetRepo;

// Class GbxUIUMG.GbxUIUMGDateTimeTextBlock
// 0x0000 (0x03C0 - 0x03C0)
class UGbxUIUMGDateTimeTextBlock final : public UCommonDateTimeTextBlock
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGDateTimeTextBlock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGDateTimeTextBlock")
	}
	static class UGbxUIUMGDateTimeTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGDateTimeTextBlock>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGDateTimeTextBlock;

// Class GbxUIUMG.GbxUIUMGDynamicEntryBox
// 0x0000 (0x0250 - 0x0250)
class UGbxUIUMGDynamicEntryBox final : public UDynamicEntryBox
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGDynamicEntryBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGDynamicEntryBox")
	}
	static class UGbxUIUMGDynamicEntryBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGDynamicEntryBox>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGDynamicEntryBox;

// Class GbxUIUMG.GbxUIUMGEditableText
// 0x0000 (0x0490 - 0x0490)
class UGbxUIUMGEditableText final : public UEditableText
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGEditableText")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGEditableText")
	}
	static class UGbxUIUMGEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGEditableText>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGEditableText;

// Class GbxUIUMG.GbxUIUMGEditableTextBox
// 0x0000 (0x0E80 - 0x0E80)
class UGbxUIUMGEditableTextBox final : public UEditableTextBox
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGEditableTextBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGEditableTextBox")
	}
	static class UGbxUIUMGEditableTextBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGEditableTextBox>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGEditableTextBox;

// Class GbxUIUMG.GbxUIUMGEnhancedInput_ActionWidget
// 0x02B8 (0x0420 - 0x0168)
class UGbxUIUMGEnhancedInput_ActionWidget final : public UWidget
{
public:
	TMulticastInlineDelegate<void(bool bUsingGamepad)> OnInputMethodChanged;                         // 0x0168(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ProgressMaterialBrush;                             // 0x0180(0x00B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   ProgressMaterialParam;                             // 0x0230(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               ProgressDynamicMaterial;                           // 0x0238(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_240[0xF8];                                     // 0x0240(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            InputActions;                                      // 0x0338(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            IconRimBrush;                                      // 0x0350(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_400[0x20];                                     // 0x0400(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleControlMappingsRebuilt();
	void SetForceShowHoldFeedback(bool bCanShow);
	void SetIconRimBrush(const struct FSlateBrush& InIconRimBrush);
	void SetIconSize(const struct FVector2D& InIconSize);
	void SetInputAction(const struct FDataTableRowHandle& NewInputAction);
	void SetInputActions(const TArray<struct FDataTableRowHandle>& NewInputActions);
	void SetProgressMaterial(const struct FSlateBrush& InProgressMaterialBrush, const class FName& InProgressMaterialParam);
	void SetProgressValue(float InValue);

	const class FText GetDisplayText() const;
	struct FSlateBrush GetIcon() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGEnhancedInput_ActionWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGEnhancedInput_ActionWidget")
	}
	static class UGbxUIUMGEnhancedInput_ActionWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGEnhancedInput_ActionWidget>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGEnhancedInput_ActionWidget;

// Class GbxUIUMG.GbxUIUMG_EnhanceInputActionRowStatics
// 0x0000 (0x0028 - 0x0028)
class UGbxUIUMG_EnhanceInputActionRowStatics final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMG_EnhanceInputActionRowStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMG_EnhanceInputActionRowStatics")
	}
	static class UGbxUIUMG_EnhanceInputActionRowStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMG_EnhanceInputActionRowStatics>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMG_EnhanceInputActionRowStatics;

// Class GbxUIUMG.GbxUIUMGEnhancedInput_BoundActionButton
// 0x0040 (0x0310 - 0x02D0)
class UGbxUIUMGEnhancedInput_BoundActionButton final : public UUserWidget
{
public:
	class UGbxUIUMGEnhancedInput_ActionWidget*    InputActionWidget;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       Text_ActionName;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ProgressMinValue;                                  // 0x02E0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ProgressMaxValue;                                  // 0x02E4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ProgressDisplayStartValue;                         // 0x02E8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetProgressOnComplete;                          // 0x02EC(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDataTableRowHandle>            InputActions;                                      // 0x02F0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_300[0x10];                                     // 0x0300(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnActionCancelled();
	void BP_OnActionComplete();
	void BP_OnActionProgress(float HeldPercent);
	void BP_OnUpdateInputAction();
	void HandleControlMappingsRebuilt();
	void NativeOnActionCancelled();
	void NativeOnActionComplete();
	void NativeOnActionProgress(float HeldPercent);
	void ResetProgressValue();
	void SetInputAction(const struct FDataTableRowHandle& NewInputAction);
	void SetInputActions(const TArray<struct FDataTableRowHandle>& NewInputActions);
	void ShowHoldFeedback(bool bShowFeedback);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGEnhancedInput_BoundActionButton")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGEnhancedInput_BoundActionButton")
	}
	static class UGbxUIUMGEnhancedInput_BoundActionButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGEnhancedInput_BoundActionButton>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGEnhancedInput_BoundActionButton;

// Class GbxUIUMG.GbxUIUMGExpandableArea
// 0x0000 (0x0410 - 0x0410)
class UGbxUIUMGExpandableArea final : public UExpandableArea
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGExpandableArea")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGExpandableArea")
	}
	static class UGbxUIUMGExpandableArea* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGExpandableArea>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGExpandableArea;

// Class GbxUIUMG.GbxUIUMGExtensionPointWidget
// 0x00F0 (0x0338 - 0x0248)
class UGbxUIUMGExtensionPointWidget final : public UDynamicEntryBoxBase
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0248(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EUIExtensionPointMatch                        ExtensionPointTagMatch;                            // 0x0250(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UObject>>            DataClasses;                                       // 0x0258(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TDelegate<void(class UObject* DataItem)>      GetWidgetClassForData;                             // 0x0268(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TDelegate<void(class UUserWidget* Widget, class UObject* DataItem)> ConfigureWidgetForData;      // 0x0278(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_288[0x10];                                     // 0x0288(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FUIExtensionHandle, class UUserWidget*> ExtensionMapping;                            // 0x0298(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UObject>, class UUserWidget*> WidgetMapping;                              // 0x02E8(0x0050)(ExportObject, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void OnWidgetDeactivated(class UGbxUIUMGActivatableWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGExtensionPointWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGExtensionPointWidget")
	}
	static class UGbxUIUMGExtensionPointWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGExtensionPointWidget>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGExtensionPointWidget;

// Class GbxUIUMG.GbxUIUMGSubsystem
// 0x0070 (0x00A0 - 0x0030)
class UGbxUIUMGSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxUIUMGDataAssetRepo*                 DataAssetRepo;                                     // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x40];                                      // 0x0048(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxUIEventDispatcher*                  EventDispatcher;                                   // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxUIUMGGameUIPolicy*                  CurrentPolicy;                                     // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGbxUIUMGGameUIPolicy>      DefaultUIPolicyClass;                              // 0x0098(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGSubsystem")
	}
	static class UGbxUIUMGSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGSubsystem;

// Class GbxUIUMG.GbxUIUMGGameUIPolicy
// 0x0020 (0x0048 - 0x0028)
class UGbxUIUMGGameUIPolicy final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UPrimaryGameLayout>         LayoutClass;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FRootViewportLayoutInfo>        RootViewportLayouts;                               // 0x0038(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGGameUIPolicy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGGameUIPolicy")
	}
	static class UGbxUIUMGGameUIPolicy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGGameUIPolicy>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGGameUIPolicy;

// Class GbxUIUMG.GbxUIUMGGridPanel
// 0x0000 (0x01B0 - 0x01B0)
class UGbxUIUMGGridPanel final : public UGridPanel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGGridPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGGridPanel")
	}
	static class UGbxUIUMGGridPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGGridPanel>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGGridPanel;

// Class GbxUIUMG.GbxUIUMGHardwareVisibilityBorder
// 0x0000 (0x0380 - 0x0380)
class UGbxUIUMGHardwareVisibilityBorder final : public UCommonHardwareVisibilityBorder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGHardwareVisibilityBorder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGHardwareVisibilityBorder")
	}
	static class UGbxUIUMGHardwareVisibilityBorder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGHardwareVisibilityBorder>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGHardwareVisibilityBorder;

// Class GbxUIUMG.GbxUIUMGHorizontalBox
// 0x0000 (0x0190 - 0x0190)
class UGbxUIUMGHorizontalBox final : public UHorizontalBox
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGHorizontalBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGHorizontalBox")
	}
	static class UGbxUIUMGHorizontalBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGHorizontalBox>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGHorizontalBox;

// Class GbxUIUMG.GbxUIUMGStateDef
// 0x0090 (0x00B8 - 0x0028)
class UGbxUIUMGStateDef : public UObject
{
public:
	TSoftClassPtr<class UClass>                   WidgetClass;                                       // 0x0028(0x0028)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RequireTags;                                       // 0x0050(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RejectTags;                                        // 0x0070(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FSName                                 NexusIdent;                                        // 0x0090(0x0028)(Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGStateDef")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGStateDef")
	}
	static class UGbxUIUMGStateDef* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGStateDef>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGStateDef;

// Class GbxUIUMG.GbxUIUMGHUDDef
// 0x0008 (0x00C0 - 0x00B8)
class UGbxUIUMGHUDDef final : public UGbxUIUMGStateDef
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x00B8(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGHUDDef")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGHUDDef")
	}
	static class UGbxUIUMGHUDDef* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGHUDDef>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGHUDDef;

// Class GbxUIUMG.GbxUIUMGHUDManager
// 0x0068 (0x0098 - 0x0030)
class UGbxUIUMGHUDManager final : public ULocalPlayerSubsystem
{
public:
	TMap<int32, struct FUIExtensionHandle>        ActiveExtensionHandles;                            // 0x0030(0x0050)(Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x18];                                      // 0x0080(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGHUDManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGHUDManager")
	}
	static class UGbxUIUMGHUDManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGHUDManager>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGHUDManager;

// Class GbxUIUMG.GbxUIUMGImage
// 0x0000 (0x02B0 - 0x02B0)
class UGbxUIUMGImage final : public UImage
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGImage")
	}
	static class UGbxUIUMGImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGImage>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGImage;

// Class GbxUIUMG.GbxUIUMGIndicatorManager
// 0x0078 (0x00A8 - 0x0030)
class UGbxUIUMGIndicatorManager final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x38];                                      // 0x0030(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGbxUIUMGIndicatorDescriptor*>   Indicators;                                        // 0x0068(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UGbxUIUMGIndicatorDescriptor*>   IndicatorsToAdd;                                   // 0x0078(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UGbxUIUMGIndicatorDescriptor*>   IndicatorsToRemove;                                // 0x0088(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_98[0x10];                                      // 0x0098(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddIndicator(class UGbxUIUMGIndicatorDescriptor* IndicatorDescriptor);
	void RemoveIndicator(class UGbxUIUMGIndicatorDescriptor* IndicatorDescriptor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGIndicatorManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGIndicatorManager")
	}
	static class UGbxUIUMGIndicatorManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGIndicatorManager>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGIndicatorManager;

// Class GbxUIUMG.GbxUIUMGIndicatorWidget
// 0x0000 (0x0000 - 0x0000)
class IGbxUIUMGIndicatorWidget final
{
public:
	void BP_BindIndicator(const class UGbxUIUMGIndicatorDescriptor* Indicator);
	void BP_UnbindIndicator(const class UGbxUIUMGIndicatorDescriptor* Indicator);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGIndicatorWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGIndicatorWidget")
	}
	static class IGbxUIUMGIndicatorWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxUIUMGIndicatorWidget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxUIUMGIndicatorWidget;

// Class GbxUIUMG.GbxUIUMGInputKeySelector
// 0x0000 (0x0860 - 0x0860)
class UGbxUIUMGInputKeySelector final : public UInputKeySelector
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGInputKeySelector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGInputKeySelector")
	}
	static class UGbxUIUMGInputKeySelector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGInputKeySelector>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGInputKeySelector;

// Class GbxUIUMG.GbxUIUMGInvalidationBox
// 0x0000 (0x0198 - 0x0198)
class UGbxUIUMGInvalidationBox final : public UInvalidationBox
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGInvalidationBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGInvalidationBox")
	}
	static class UGbxUIUMGInvalidationBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGInvalidationBox>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGInvalidationBox;

// Class GbxUIUMG.GbxUIUMGLazyImage
// 0x0000 (0x03A0 - 0x03A0)
class UGbxUIUMGLazyImage final : public UCommonLazyImage
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGLazyImage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGLazyImage")
	}
	static class UGbxUIUMGLazyImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGLazyImage>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGLazyImage;

// Class GbxUIUMG.GbxUIUMGLazyWidget
// 0x0000 (0x02B0 - 0x02B0)
class UGbxUIUMGLazyWidget final : public UCommonLazyWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGLazyWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGLazyWidget")
	}
	static class UGbxUIUMGLazyWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGLazyWidget>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGLazyWidget;

// Class GbxUIUMG.GbxUIUMGListView
// 0x0070 (0x0BB0 - 0x0B40)
class UGbxUIUMGListView final : public UCommonListView
{
public:
	TArray<class UGbxUIUMGWidgetFactory*>         FactoryRules;                                      // 0x0B40(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSubclassOf<class UObject>                    DefaultViewModelClass;                             // 0x0B50(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B58[0x58];                                     // 0x0B58(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGListView")
	}
	static class UGbxUIUMGListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGListView>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGListView;

// Class GbxUIUMG.GbxUIUMGListViewItemWidget
// 0x0048 (0x0398 - 0x0350)
class UGbxUIUMGListViewItemWidget final : public UGbxUIUMGCommonWidget
{
public:
	uint8                                         Pad_350[0x8];                                      // 0x0350(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    PrimaryInput;                                      // 0x0358(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    SecondaryInput;                                    // 0x0368(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    TertiaryInput;                                     // 0x0378(0x0010)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bTriggerPrimaryActionOnMouseDown;                  // 0x0388(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_389[0xF];                                      // 0x0389(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BP_OnPrimaryAction();
	void BP_OnSecondaryAction();
	void BP_OnTertiaryAction();
	void OnPrimaryAction();
	void OnSecondaryAction();
	void OnTertiaryAction();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGListViewItemWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGListViewItemWidget")
	}
	static class UGbxUIUMGListViewItemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGListViewItemWidget>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGListViewItemWidget;

// Class GbxUIUMG.GbxUIUMGListView_ObjectEntry
// 0x0000 (0x0000 - 0x0000)
class IGbxUIUMGListView_ObjectEntry final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGListView_ObjectEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGListView_ObjectEntry")
	}
	static class IGbxUIUMGListView_ObjectEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxUIUMGListView_ObjectEntry>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxUIUMGListView_ObjectEntry;

// Class GbxUIUMG.GbxUIUMGListView_ViewModel
// 0x0000 (0x0000 - 0x0000)
class IGbxUIUMGListView_ViewModel final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGListView_ViewModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGListView_ViewModel")
	}
	static class IGbxUIUMGListView_ViewModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxUIUMGListView_ViewModel>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxUIUMGListView_ViewModel;

// Class GbxUIUMG.GbxUIUMGLoadGuard
// 0x0000 (0x02C0 - 0x02C0)
class UGbxUIUMGLoadGuard final : public UCommonLoadGuard
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGLoadGuard")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGLoadGuard")
	}
	static class UGbxUIUMGLoadGuard* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGLoadGuard>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGLoadGuard;

// Class GbxUIUMG.GbxUIUMGMenuAnchor
// 0x0000 (0x01D0 - 0x01D0)
class UGbxUIUMGMenuAnchor final : public UMenuAnchor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGMenuAnchor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGMenuAnchor")
	}
	static class UGbxUIUMGMenuAnchor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGMenuAnchor>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGMenuAnchor;

// Class GbxUIUMG.GbxUIUMGMenuManager
// 0x0058 (0x0088 - 0x0030)
class UGbxUIUMGMenuManager final : public ULocalPlayerSubsystem
{
public:
	TArray<class UGbxUIUMGMenuInstance*>          MenuInstances;                                     // 0x0030(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UGbxUIUMGMenuManagerSettings*           settings;                                          // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x40];                                      // 0x0048(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGMenuManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGMenuManager")
	}
	static class UGbxUIUMGMenuManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGMenuManager>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGMenuManager;

// Class GbxUIUMG.GbxUIUMGMenuManagerAction
// 0x0000 (0x0028 - 0x0028)
class UGbxUIUMGMenuManagerAction final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGMenuManagerAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGMenuManagerAction")
	}
	static class UGbxUIUMGMenuManagerAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGMenuManagerAction>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGMenuManagerAction;

// Class GbxUIUMG.GbxUIUMGMenuManagerFlowCondition
// 0x0000 (0x0028 - 0x0028)
class UGbxUIUMGMenuManagerFlowCondition : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGMenuManagerFlowCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGMenuManagerFlowCondition")
	}
	static class UGbxUIUMGMenuManagerFlowCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGMenuManagerFlowCondition>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGMenuManagerFlowCondition;

// Class GbxUIUMG.GbxUIUMGMenuManagerLevelCondition
// 0x0078 (0x00A0 - 0x0028)
class UGbxUIUMGMenuManagerLevelCondition final : public UGbxUIUMGMenuManagerFlowCondition
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bActivateInEditor;                                 // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      ForceFlowCondition;                                // 0x0058(0x0048)(Edit, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIUMGMenuManagerLevelCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIUMGMenuManagerLevelCondition")
	}
	static class UGbxUIUMGMenuManagerLevelCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIUMGMenuManagerLevelCondition>();
	}
};
DUMPER7_ASSERTS_UGbxUIUMGMenuManagerLevelCondition;

// Class GbxUIUMG.GbxUIUMGMenuManagerPhaseCondition
// 0x0078 (0x00A0 - 0x0028)
class UGbxUIUMGMenuManagerPhaseCondition final : public UGbxUIUMGMenuManagerFlowCondition
{
public:
	EGameInstancePhase                            phase;                                             // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bValidatePrimaryPlayer;                            // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
