#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxUICore

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GbxEngine_classes.hpp"


namespace SDK
{

// Class GbxUICore.GbxLoadingScreenManager
// 0x0010 (0x0040 - 0x0030)
class UGbxLoadingScreenManager : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RemoveLoadingScreen(struct FGbxUILoadingScreenHandle& Handle);
	void RequestLoadingScreen(struct FGbxUILoadingScreenHandle& Handle);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxLoadingScreenManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxLoadingScreenManager")
	}
	static class UGbxLoadingScreenManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxLoadingScreenManager>();
	}
};
DUMPER7_ASSERTS_UGbxLoadingScreenManager;

// Class GbxUICore.GbxUIPopupManager
// 0x0030 (0x0060 - 0x0030)
class UGbxUIPopupManager final : public ULocalPlayerSubsystem
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RemovePopup(struct FGbxUIPopupHandle& Handle);
	void RequestPopup(struct FGbxUIPopupHandle& Handle, const struct FGbxUIPopupOptions& options);
	void UpdatePopup(const struct FGbxUIPopupHandle& Handle, const struct FGbxUIPopupOptions& options);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIPopupManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIPopupManager")
	}
	static class UGbxUIPopupManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIPopupManager>();
	}
};
DUMPER7_ASSERTS_UGbxUIPopupManager;

// Class GbxUICore.GbxUICoreSubsystem
// 0x00A8 (0x00D8 - 0x0030)
class UGbxUICoreSubsystem : public UGameInstanceSubsystem
{
public:
	TMap<class UObject*, class UGbxUIStateManager*> StateManagerMap;                                 // 0x0030(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<class UObject*, class UGbxUIEventDispatcher*> EventDispatcherMap;                           // 0x0080(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UGbxUIEventDispatcher*                  GlobalEventDispatcher;                             // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUICoreSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUICoreSubsystem")
	}
	static class UGbxUICoreSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUICoreSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxUICoreSubsystem;

// Class GbxUICore.GbxUIEventDispatcher
// 0x0068 (0x0090 - 0x0028)
class UGbxUIEventDispatcher final : public UObject
{
public:
	uint8                                         Pad_28[0x68];                                      // 0x0028(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIEventDispatcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIEventDispatcher")
	}
	static class UGbxUIEventDispatcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIEventDispatcher>();
	}
};
DUMPER7_ASSERTS_UGbxUIEventDispatcher;

// Class GbxUICore.GbxUIIconAction
// 0x0010 (0x0038 - 0x0028)
class UGbxUIIconAction : public UObject
{
public:
	TWeakObjectPtr<class UGbxUIIconBehavior>      IconBehavior;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UGbxUIIconComponent>     IconComponent;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction")
	}
	static class UGbxUIIconAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction;

// Class GbxUICore.GbxUIIconAction_BaseModifier
// 0x0018 (0x0040 - 0x0028)
class UGbxUIIconAction_BaseModifier : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction_BaseModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction_BaseModifier")
	}
	static class UGbxUIIconAction_BaseModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction_BaseModifier>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction_BaseModifier;

// Class GbxUICore.GbxUIIconAction_Opacity
// 0x0008 (0x0040 - 0x0038)
class UGbxUIIconAction_Opacity final : public UGbxUIIconAction
{
public:
	class UGbxUIIconAction_OpacityModifier*       OpacityModifier;                                   // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction_Opacity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction_Opacity")
	}
	static class UGbxUIIconAction_Opacity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction_Opacity>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction_Opacity;

// Class GbxUICore.GbxUIIconAction_OpacityModifier
// 0x0000 (0x0040 - 0x0040)
class UGbxUIIconAction_OpacityModifier : public UGbxUIIconAction_BaseModifier
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction_OpacityModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction_OpacityModifier")
	}
	static class UGbxUIIconAction_OpacityModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction_OpacityModifier>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction_OpacityModifier;

// Class GbxUICore.GbxUIIconAction_OpacityModifierScalar
// 0x0008 (0x0048 - 0x0040)
class UGbxUIIconAction_OpacityModifierScalar final : public UGbxUIIconAction_OpacityModifier
{
public:
	float                                         Opacity;                                           // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction_OpacityModifierScalar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction_OpacityModifierScalar")
	}
	static class UGbxUIIconAction_OpacityModifierScalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction_OpacityModifierScalar>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction_OpacityModifierScalar;

// Class GbxUICore.GbxUIIconAction_OpacityModifierTimeCurve
// 0x0010 (0x0050 - 0x0040)
class UGbxUIIconAction_OpacityModifierTimeCurve final : public UGbxUIIconAction_OpacityModifier
{
public:
	class UCurveFloat*                            curve;                                             // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction_OpacityModifierTimeCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction_OpacityModifierTimeCurve")
	}
	static class UGbxUIIconAction_OpacityModifierTimeCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction_OpacityModifierTimeCurve>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction_OpacityModifierTimeCurve;

// Class GbxUICore.GbxUIIconAction_Scale
// 0x0008 (0x0040 - 0x0038)
class UGbxUIIconAction_Scale final : public UGbxUIIconAction
{
public:
	class UGbxUIIconAction_ScaleModifier*         ScaleModifier;                                     // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction_Scale")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction_Scale")
	}
	static class UGbxUIIconAction_Scale* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction_Scale>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction_Scale;

// Class GbxUICore.GbxUIIconAction_ScaleModifier
// 0x0000 (0x0040 - 0x0040)
class UGbxUIIconAction_ScaleModifier : public UGbxUIIconAction_BaseModifier
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction_ScaleModifier")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction_ScaleModifier")
	}
	static class UGbxUIIconAction_ScaleModifier* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction_ScaleModifier>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction_ScaleModifier;

// Class GbxUICore.GbxUIIconAction_ScaleModifierScalar
// 0x0008 (0x0048 - 0x0040)
class UGbxUIIconAction_ScaleModifierScalar final : public UGbxUIIconAction_ScaleModifier
{
public:
	float                                         scale;                                             // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction_ScaleModifierScalar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction_ScaleModifierScalar")
	}
	static class UGbxUIIconAction_ScaleModifierScalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction_ScaleModifierScalar>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction_ScaleModifierScalar;

// Class GbxUICore.GbxUIIconAction_ScaleModifierDistanceCurve
// 0x0010 (0x0050 - 0x0040)
class UGbxUIIconAction_ScaleModifierDistanceCurve final : public UGbxUIIconAction_ScaleModifier
{
public:
	class UCurveFloat*                            curve;                                             // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconAction_ScaleModifierDistanceCurve")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconAction_ScaleModifierDistanceCurve")
	}
	static class UGbxUIIconAction_ScaleModifierDistanceCurve* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconAction_ScaleModifierDistanceCurve>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconAction_ScaleModifierDistanceCurve;

// Class GbxUICore.GbxUIIconBehavior
// 0x0070 (0x0098 - 0x0028)
class UGbxUIIconBehavior final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxUIIconCondition*                    ActivationCondition;                               // 0x0058(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UGbxUIIconAction*>               IconActions;                                       // 0x0060(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	class UGbxUIIconData*                         CachedIconData;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x20];                                      // 0x0078(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconBehavior")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconBehavior")
	}
	static class UGbxUIIconBehavior* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconBehavior>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconBehavior;

// Class GbxUICore.GbxUIIconComponent
// 0x0010 (0x02C0 - 0x02B0)
class UGbxUIIconComponent final : public USceneComponent
{
public:
	TArray<class UGbxUIIconBehavior*>             behaviors;                                         // 0x02A8(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconComponent")
	}
	static class UGbxUIIconComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconComponent>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconComponent;

// Class GbxUICore.GbxUIIconCondition
// 0x0018 (0x0040 - 0x0028)
class UGbxUIIconCondition : public UObject
{
public:
	TWeakObjectPtr<class UGbxUIIconBehavior>      IconBehavior;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UGbxUIIconComponent>     IconComponent;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvert;                                           // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconCondition")
	}
	static class UGbxUIIconCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconCondition>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconCondition;

// Class GbxUICore.GbxUIIconCondition_All
// 0x0010 (0x0050 - 0x0040)
class UGbxUIIconCondition_All final : public UGbxUIIconCondition
{
public:
	TArray<class UGbxUIIconCondition*>            Conditions;                                        // 0x0040(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconCondition_All")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconCondition_All")
	}
	static class UGbxUIIconCondition_All* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconCondition_All>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconCondition_All;

// Class GbxUICore.GbxUIIconCondition_Any
// 0x0010 (0x0050 - 0x0040)
class UGbxUIIconCondition_Any final : public UGbxUIIconCondition
{
public:
	TArray<class UGbxUIIconCondition*>            Conditions;                                        // 0x0040(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconCondition_Any")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconCondition_Any")
	}
	static class UGbxUIIconCondition_Any* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconCondition_Any>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconCondition_Any;

// Class GbxUICore.GbxUIIconCondition_Distance
// 0x0018 (0x0058 - 0x0040)
class UGbxUIIconCondition_Distance final : public UGbxUIIconCondition
{
public:
	float                                         Distance;                                          // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Threashold;                                        // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconCondition_Distance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconCondition_Distance")
	}
	static class UGbxUIIconCondition_Distance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconCondition_Distance>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconCondition_Distance;

// Class GbxUICore.GbxUIIconData
// 0x0048 (0x0070 - 0x0028)
class UGbxUIIconData final : public UObject
{
public:
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x0028(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateColor                            IconTint;                                          // 0x0050(0x0014)(Edit, NativeAccessSpecifierPrivate)
	float                                         IconScale;                                         // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         IconOpacity;                                       // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         IconZOrder;                                        // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconData")
	}
	static class UGbxUIIconData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconData>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconData;

// Class GbxUICore.GbxUIIconDataAssetInterface
// 0x0000 (0x0000 - 0x0000)
class IGbxUIIconDataAssetInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconDataAssetInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconDataAssetInterface")
	}
	static class IGbxUIIconDataAssetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGbxUIIconDataAssetInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGbxUIIconDataAssetInterface;

// Class GbxUICore.GbxUIIconDataAsset
// 0x0010 (0x0040 - 0x0030)
class UGbxUIIconDataAsset final : public UDataAsset
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxUIIconData*                         IconData;                                          // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconDataAsset")
	}
	static class UGbxUIIconDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconDataAsset>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconDataAsset;

// Class GbxUICore.GbxUIIconSubsystem
// 0x0028 (0x0058 - 0x0030)
class UGbxUIIconSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x28];                                      // 0x0030(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIIconSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIIconSubsystem")
	}
	static class UGbxUIIconSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIIconSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxUIIconSubsystem;

// Class GbxUICore.GbxGameplayStateDef
// 0x0088 (0x00B0 - 0x0028)
class UGbxGameplayStateDef final : public UObject
{
public:
	struct FGameplayTag                           State;                                             // 0x0028(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ApplyTags;                                         // 0x0030(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  RemoveTags;                                        // 0x0050(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  exclusivetags;                                     // 0x0070(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  StatesToRemove;                                    // 0x0090(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameplayStateDef")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameplayStateDef")
	}
	static class UGbxGameplayStateDef* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameplayStateDef>();
	}
};
DUMPER7_ASSERTS_UGbxGameplayStateDef;

// Class GbxUICore.GbxUIStateManager
// 0x0118 (0x0140 - 0x0028)
class UGbxUIStateManager : public UObject
{
public:
	uint8                                         Pad_28[0x108];                                     // 0x0028(0x0108)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGbxGameplayStateDef*>           UIStateDefs;                                       // 0x0130(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUIStateManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUIStateManager")
	}
	static class UGbxUIStateManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUIStateManager>();
	}
};
DUMPER7_ASSERTS_UGbxUIStateManager;

// Class GbxUICore.GbxGameplayTagStateDef
// 0x0088 (0x00B0 - 0x0028)
class UGbxGameplayTagStateDef final : public UObject
{
public:
	struct FGameplayTag                           State;                                             // 0x0028(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ApplyTags;                                         // 0x0030(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  RemoveTags;                                        // 0x0050(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  exclusivetags;                                     // 0x0070(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  StatesToRemove;                                    // 0x0090(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxGameplayTagStateDef")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxGameplayTagStateDef")
	}
	static class UGbxGameplayTagStateDef* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxGameplayTagStateDef>();
	}
};
DUMPER7_ASSERTS_UGbxGameplayTagStateDef;

// Class GbxUICore.GbxUITagStateManager
// 0x00F0 (0x0118 - 0x0028)
class UGbxUITagStateManager final : public UObject
{
public:
	uint8                                         Pad_28[0xF0];                                      // 0x0028(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxUITagStateManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxUITagStateManager")
	}
	static class UGbxUITagStateManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxUITagStateManager>();
	}
};
DUMPER7_ASSERTS_UGbxUITagStateManager;

// Class GbxUICore.NexusConfigStoreUIStates
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStoreUIStates final : public UNexusConfigStoreBasic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreUIStates")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreUIStates")
	}
	static class UNexusConfigStoreUIStates* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreUIStates>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreUIStates;

// Class GbxUICore.NexusConfigStoreUIUMGWidgets
// 0x0050 (0x03E0 - 0x0390)
class UNexusConfigStoreUIUMGWidgets final : public UNexusConfigStoreBasic
{
public:
	uint8                                         Pad_390[0x50];                                     // 0x0390(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreUIUMGWidgets")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreUIUMGWidgets")
	}
	static class UNexusConfigStoreUIUMGWidgets* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreUIUMGWidgets>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreUIUMGWidgets;

}

