#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxUISettings

#include "Basic.hpp"

#include "GbxUISettings_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function GbxUISettings.GbxUIGameUserSettings.GetDefaultGraphicsQualityMode
// 0x0004 (0x0004 - 0x0000)
struct GbxUIGameUserSettings_GetDefaultGraphicsQualityMode final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_GetDefaultGraphicsQualityMode;

// Function GbxUISettings.GbxUIGameUserSettings.SetBrightness
// 0x0004 (0x0004 - 0x0000)
struct GbxUIGameUserSettings_SetBrightness final
{
public:
	float                                         NewBightness;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_SetBrightness;

// Function GbxUISettings.GbxUIGameUserSettings.SetSafeZone
// 0x0004 (0x0004 - 0x0000)
struct GbxUIGameUserSettings_SetSafeZone final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_SetSafeZone;

// Function GbxUISettings.GbxUIGameUserSettings.SetScreenPercentage
// 0x0004 (0x0004 - 0x0000)
struct GbxUIGameUserSettings_SetScreenPercentage final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_SetScreenPercentage;

// Function GbxUISettings.GbxUIGameUserSettings.GetBrightness
// 0x0004 (0x0004 - 0x0000)
struct GbxUIGameUserSettings_GetBrightness final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_GetBrightness;

// Function GbxUISettings.GbxUIGameUserSettings.GetOverrideGraphicsQualityMode
// 0x0004 (0x0004 - 0x0000)
struct GbxUIGameUserSettings_GetOverrideGraphicsQualityMode final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_GetOverrideGraphicsQualityMode;

// Function GbxUISettings.GbxUIGameUserSettings.GetRecommendedGraphicsQualityMode
// 0x0004 (0x0004 - 0x0000)
struct GbxUIGameUserSettings_GetRecommendedGraphicsQualityMode final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_GetRecommendedGraphicsQualityMode;

// Function GbxUISettings.GbxUIGameUserSettings.GetSafeZone
// 0x0004 (0x0004 - 0x0000)
struct GbxUIGameUserSettings_GetSafeZone final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_GetSafeZone;

// Function GbxUISettings.GbxUIGameUserSettings.GetScreenPercentage
// 0x0004 (0x0004 - 0x0000)
struct GbxUIGameUserSettings_GetScreenPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_GetScreenPercentage;

// Function GbxUISettings.GbxUIGameUserSettings.IsSafeZoneSet
// 0x0001 (0x0001 - 0x0000)
struct GbxUIGameUserSettings_IsSafeZoneSet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIGameUserSettings_IsSafeZoneSet;

// Function GbxUISettings.GbxUIPlatformEmulationSettings.GetKnownDeviceProfiles
// 0x0010 (0x0010 - 0x0000)
struct GbxUIPlatformEmulationSettings_GetKnownDeviceProfiles final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIPlatformEmulationSettings_GetKnownDeviceProfiles;

// Function GbxUISettings.GbxUIPlatformEmulationSettings.GetKnownPlatformIds
// 0x0010 (0x0010 - 0x0000)
struct GbxUIPlatformEmulationSettings_GetKnownPlatformIds final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUIPlatformEmulationSettings_GetKnownPlatformIds;

// Function GbxUISettings.GbxUISaveGameSettings.SetColorBlindMode
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetColorBlindMode final
{
public:
	EColorVisionDeficiency                        InMode;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetColorBlindMode;

// Function GbxUISettings.GbxUISaveGameSettings.SetColorBlindStrength
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_SetColorBlindStrength final
{
public:
	int32                                         InColorBlindStrength;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetColorBlindStrength;

// Function GbxUISettings.GbxUISaveGameSettings.SetDialogLanguage
// 0x0010 (0x0010 - 0x0000)
struct GbxUISaveGameSettings_SetDialogLanguage final
{
public:
	class FString                                 NewValue;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetDialogLanguage;

// Function GbxUISettings.GbxUISaveGameSettings.SetDialogVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_SetDialogVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetDialogVolume;

// Function GbxUISettings.GbxUISaveGameSettings.SetDynamicRange
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_SetDynamicRange final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetDynamicRange;

// Function GbxUISettings.GbxUISaveGameSettings.SetEffectsVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_SetEffectsVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetEffectsVolume;

// Function GbxUISettings.GbxUISaveGameSettings.SetForceFeedbackScale
// 0x0008 (0x0008 - 0x0000)
struct GbxUISaveGameSettings_SetForceFeedbackScale final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetForceFeedbackScale;

// Function GbxUISettings.GbxUISaveGameSettings.SetGamepadPreset
// 0x0010 (0x0010 - 0x0000)
struct GbxUISaveGameSettings_SetGamepadPreset final
{
public:
	class FString                                 NewValue;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetGamepadPreset;

// Function GbxUISettings.GbxUISaveGameSettings.SetGamepadSensitivity
// 0x0008 (0x0008 - 0x0000)
struct GbxUISaveGameSettings_SetGamepadSensitivity final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetGamepadSensitivity;

// Function GbxUISettings.GbxUISaveGameSettings.SetHoldToSprint
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetHoldToSprint final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetHoldToSprint;

// Function GbxUISettings.GbxUISaveGameSettings.SetInvertVerticalAxis
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetInvertVerticalAxis final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetInvertVerticalAxis;

// Function GbxUISettings.GbxUISaveGameSettings.SetMasterVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_SetMasterVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetMasterVolume;

// Function GbxUISettings.GbxUISaveGameSettings.SetMono
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetMono final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetMono;

// Function GbxUISettings.GbxUISaveGameSettings.SetMouseSensitivity
// 0x0008 (0x0008 - 0x0000)
struct GbxUISaveGameSettings_SetMouseSensitivity final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetMouseSensitivity;

// Function GbxUISettings.GbxUISaveGameSettings.SetMusicVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_SetMusicVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetMusicVolume;

// Function GbxUISettings.GbxUISaveGameSettings.SetShowSpeakerColor
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetShowSpeakerColor final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetShowSpeakerColor;

// Function GbxUISettings.GbxUISaveGameSettings.SetShowSpeakerName
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetShowSpeakerName final
{
public:
	bool                                          NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetShowSpeakerName;

// Function GbxUISettings.GbxUISaveGameSettings.SetShowSubtitles
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetShowSubtitles final
{
public:
	ESubtitlesSettings                            NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetShowSubtitles;

// Function GbxUISettings.GbxUISaveGameSettings.SetSubtitlesBackgroundOpacity
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetSubtitlesBackgroundOpacity final
{
public:
	ESubtitlesBackgroundOpacity                   NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetSubtitlesBackgroundOpacity;

// Function GbxUISettings.GbxUISaveGameSettings.SetSubtitlesTextColor
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetSubtitlesTextColor final
{
public:
	ESubtitlesTextColor                           NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetSubtitlesTextColor;

// Function GbxUISettings.GbxUISaveGameSettings.SetSubtitlesTextSize
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_SetSubtitlesTextSize final
{
public:
	ESubtitlesTextSize                            NewValue;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetSubtitlesTextSize;

// Function GbxUISettings.GbxUISaveGameSettings.SetUIVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_SetUIVolume final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_SetUIVolume;

// Function GbxUISettings.GbxUISaveGameSettings.GetColorBlindMode
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetColorBlindMode final
{
public:
	EColorVisionDeficiency                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetColorBlindMode;

// Function GbxUISettings.GbxUISaveGameSettings.GetColorBlindStrength
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_GetColorBlindStrength final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetColorBlindStrength;

// Function GbxUISettings.GbxUISaveGameSettings.GetDialogLanguage
// 0x0010 (0x0010 - 0x0000)
struct GbxUISaveGameSettings_GetDialogLanguage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetDialogLanguage;

// Function GbxUISettings.GbxUISaveGameSettings.GetDialogVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_GetDialogVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetDialogVolume;

// Function GbxUISettings.GbxUISaveGameSettings.GetDynamicRange
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_GetDynamicRange final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetDynamicRange;

// Function GbxUISettings.GbxUISaveGameSettings.GetEffectsVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_GetEffectsVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetEffectsVolume;

// Function GbxUISettings.GbxUISaveGameSettings.GetForceFeedbackScale
// 0x0008 (0x0008 - 0x0000)
struct GbxUISaveGameSettings_GetForceFeedbackScale final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetForceFeedbackScale;

// Function GbxUISettings.GbxUISaveGameSettings.GetGamepadPreset
// 0x0010 (0x0010 - 0x0000)
struct GbxUISaveGameSettings_GetGamepadPreset final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetGamepadPreset;

// Function GbxUISettings.GbxUISaveGameSettings.GetGamepadSensitivity
// 0x0008 (0x0008 - 0x0000)
struct GbxUISaveGameSettings_GetGamepadSensitivity final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetGamepadSensitivity;

// Function GbxUISettings.GbxUISaveGameSettings.GetHoldToSprint
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetHoldToSprint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetHoldToSprint;

// Function GbxUISettings.GbxUISaveGameSettings.GetInvertVerticalAxis
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetInvertVerticalAxis final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetInvertVerticalAxis;

// Function GbxUISettings.GbxUISaveGameSettings.GetMasterVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_GetMasterVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetMasterVolume;

// Function GbxUISettings.GbxUISaveGameSettings.GetMono
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetMono final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetMono;

// Function GbxUISettings.GbxUISaveGameSettings.GetMouseSensitivity
// 0x0008 (0x0008 - 0x0000)
struct GbxUISaveGameSettings_GetMouseSensitivity final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetMouseSensitivity;

// Function GbxUISettings.GbxUISaveGameSettings.GetMusicVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_GetMusicVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetMusicVolume;

// Function GbxUISettings.GbxUISaveGameSettings.GetShowSpeakerColor
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetShowSpeakerColor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetShowSpeakerColor;

// Function GbxUISettings.GbxUISaveGameSettings.GetShowSpeakerName
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetShowSpeakerName final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetShowSpeakerName;

// Function GbxUISettings.GbxUISaveGameSettings.GetShowSubtitles
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetShowSubtitles final
{
public:
	ESubtitlesSettings                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetShowSubtitles;

// Function GbxUISettings.GbxUISaveGameSettings.GetSubtitlesBackgroundOpacity
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetSubtitlesBackgroundOpacity final
{
public:
	ESubtitlesBackgroundOpacity                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetSubtitlesBackgroundOpacity;

// Function GbxUISettings.GbxUISaveGameSettings.GetSubtitlesTextColor
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetSubtitlesTextColor final
{
public:
	ESubtitlesTextColor                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetSubtitlesTextColor;

// Function GbxUISettings.GbxUISaveGameSettings.GetSubtitlesTextSize
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetSubtitlesTextSize final
{
public:
	ESubtitlesTextSize                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetSubtitlesTextSize;

// Function GbxUISettings.GbxUISaveGameSettings.GetToggleToSprint
// 0x0001 (0x0001 - 0x0000)
struct GbxUISaveGameSettings_GetToggleToSprint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetToggleToSprint;

// Function GbxUISettings.GbxUISaveGameSettings.GetUIVolume
// 0x0004 (0x0004 - 0x0000)
struct GbxUISaveGameSettings_GetUIVolume final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxUISaveGameSettings_GetUIVolume;

// Function GbxUISettings.InputSettingsGamepadPreset.GetAvailableGamepadMappableNames
// 0x0010 (0x0010 - 0x0000)
struct InputSettingsGamepadPreset_GetAvailableGamepadMappableNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InputSettingsGamepadPreset_GetAvailableGamepadMappableNames;

}

