#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxUICore

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GbxNexus_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum GbxUICore.EGbxUIPopupResult
// NumValues: 0x0005
enum class EGbxUIPopupResult : uint8
{
	AcceptYesOk                              = 0,
	CancelNo                                 = 1,
	ThirdOption                              = 2,
	ListChoice                               = 3,
	EGbxUIPopupResult_MAX                    = 4,
};

// Enum GbxUICore.EGbxUIPopupType
// NumValues: 0x0008
enum class EGbxUIPopupType : uint8
{
	NoButtton                                = 0,
	OneButton                                = 1,
	TwoButtons                               = 2,
	ThreeButtons                             = 3,
	Loading                                  = 4,
	ConflictedInputs                         = 5,
	List                                     = 6,
	EGbxUIPopupType_MAX                      = 7,
};

// Enum GbxUICore.EGbxUIPopupPriority
// NumValues: 0x0004
enum class EGbxUIPopupPriority : uint8
{
	Normal                                   = 0,
	High                                     = 1,
	Critical                                 = 2,
	EGbxUIPopupPriority_MAX                  = 3,
};

// Enum GbxUICore.GbxUITagStateRequestType
// NumValues: 0x0006
enum class EGbxUITagStateRequestType : uint8
{
	StateAdd                                 = 0,
	StateRemove                              = 1,
	StateRefresh                             = 2,
	StateClearAll                            = 3,
	StateRemoveTag                           = 4,
	GbxUITagStateRequestType_MAX             = 5,
};

// ScriptStruct GbxUICore.GbxUIDefaultInfo
// 0x0048 (0x0048 - 0x0000)
struct FGbxUIDefaultInfo final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Ident;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   page;                                              // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   View;                                              // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldCombineStates;                               // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  States;                                            // 0x0028(0x0020)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIDefaultInfo;

// ScriptStruct GbxUICore.GbxUIPreloadingInfo
// 0x0040 (0x0040 - 0x0000)
struct FGbxUIPreloadingInfo final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          Active;                                            // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           States;                                            // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         FoldersToPreload;                                  // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         OtherFileTypesToPreload;                           // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIPreloadingInfo;

// ScriptStruct GbxUICore.GbxUILayer
// 0x0020 (0x0020 - 0x0000)
struct FGbxUILayer final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   behavior;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LayerType;                                         // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUILayer;

// ScriptStruct GbxUICore.GbxGlobalsUI
// 0x00F0 (0x0110 - 0x0020)
struct FGbxGlobalsUI : public FGbxGlobalDef
{
public:
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxUIDefaultInfo                      DefaultInfo;                                       // 0x0030(0x0048)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIDefaultInfo>              DefaultInfoPhases;                                 // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIDefaultInfo>              DefaultInfoMaps;                                   // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGbxUIPreloadingInfo                   PreloadingInfo;                                    // 0x0098(0x0040)(Edit, NativeAccessSpecifierPublic)
	class FName                                   DefaultView;                                       // 0x00D8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  PerformanceBookmarkTags;                           // 0x00E0(0x0020)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FGbxUILayer>                    LayerBehaviors;                                    // 0x0100(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxGlobalsUI;

// ScriptStruct GbxUICore.GbxUILoadingScreenHandle
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FGbxUILoadingScreenHandle final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUILoadingScreenHandle;

// ScriptStruct GbxUICore.GbxUIPopupHandle
// 0x000C (0x000C - 0x0000)
struct alignas(0x04) FGbxUIPopupHandle final
{
public:
	uint8                                         Pad_0[0xC];                                        // 0x0000(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIPopupHandle;

// ScriptStruct GbxUICore.GbxUIPopupChoice
// 0x0018 (0x0018 - 0x0000)
struct FGbxUIPopupChoice final
{
public:
	class FText                                   ChoiceText;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   ChoiceId;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIPopupChoice;

// ScriptStruct GbxUICore.GbxUIPopupOptions
// 0x0090 (0x0090 - 0x0000)
struct FGbxUIPopupOptions final
{
public:
	class FText                                   TitleText;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   MainText;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   FirstButtonText;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   SecondButtonText;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   ThirdButtonText;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIPopupChoice>              ListChoices;                                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	EGbxUIPopupType                               PopupType;                                         // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxUIPopupPriority                           priority;                                          // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EGbxUIPopupResult Result, class FName ChoiceId)> Callback;                        // 0x0064(0x0010)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x14];                                      // 0x0074(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoClose;                                        // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIPopupOptions;

// ScriptStruct GbxUICore.GbxUIGameDataCategories_DONTUSE
// 0x0001 (0x0001 - 0x0000)
struct FGbxUIGameDataCategories_DONTUSE final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIGameDataCategories_DONTUSE;

// ScriptStruct GbxUICore.GbxUIState
// 0x0080 (0x0098 - 0x0018)
struct FGbxUIState final : public FGbxDef
{
public:
	uint8                                         Pad_18[0xC];                                       // 0x0018(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           State;                                             // 0x0024(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   layer;                                             // 0x002C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  apply_tags;                                        // 0x0038(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  StatesToRemove;                                    // 0x0058(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Exclusive_Tags;                                    // 0x0078(0x0020)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIState;

// ScriptStruct GbxUICore.GbxUIUMGWidgetType
// 0x0000 (0x0008 - 0x0008)
struct FGbxUIUMGWidgetType : public FGbxHasStructType
{
};
DUMPER7_ASSERTS_FGbxUIUMGWidgetType;

// ScriptStruct GbxUICore.GbxUIUMGWidgetType_HUD
// 0x0008 (0x0010 - 0x0008)
struct FGbxUIUMGWidgetType_HUD final : public FGbxUIUMGWidgetType
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0008(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxUIUMGWidgetType_HUD;

// ScriptStruct GbxUICore.GbxUIUMGWidgetType_Menu
// 0x0010 (0x0018 - 0x0008)
struct FGbxUIUMGWidgetType_Menu final : public FGbxUIUMGWidgetType
{
public:
	struct FGameplayTag                           LayerTag;                                          // 0x0008(0x0008)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRemoveTagStateOnDeactivate;                       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIUMGWidgetType_Menu;

// ScriptStruct GbxUICore.GbxUIUMGWidget
// 0x0120 (0x0138 - 0x0018)
struct FGbxUIUMGWidget final : public FGbxDef
{
public:
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   Widget;                                            // 0x0020(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxInlineStruct                       type;                                              // 0x0048(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  require_gameplaytags;                              // 0x0060(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  reject_gameplaytags;                               // 0x0080(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  hide_gameplaytags;                                 // 0x00A0(0x0020)(Edit, NativeAccessSpecifierPublic)
	int32                                         InputPriority;                                     // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UInputMappingContext>> MappingContexts;                              // 0x00C8(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UInputMappingContext>> SupportMappingContexts;            // 0x00D8(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x10];                                     // 0x0128(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIUMGWidget;

}

