#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxUICoherent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GbxUICoreGame_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxNexus_structs.hpp"


namespace SDK
{

// Enum GbxUICoherent.EWidgetHideFlags
// NumValues: 0x0005
enum class EWidgetHideFlags : uint8
{
	None                                     = 0,
	HideTags                                 = 1,
	MaterialAnimation                        = 2,
	NativeCode                               = 4,
	EWidgetHideFlags_MAX                     = 5,
};

// Enum GbxUICoherent.ETagAggregationType
// NumValues: 0x0003
enum class ETagAggregationType : uint8
{
	Any                                      = 0,
	All                                      = 1,
	ETagAggregationType_MAX                  = 2,
};

// Enum GbxUICoherent.WidgetType
// NumValues: 0x0003
enum class EWidgetType : uint8
{
	Default                                  = 0,
	List                                     = 1,
	WidgetType_MAX                           = 2,
};

// ScriptStruct GbxUICoherent.GbxSkillComponentData_UI_SkillParamData
// 0x0010 (0x0010 - 0x0000)
struct FGbxSkillComponentData_UI_SkillParamData final
{
public:
	class FName                                   behavior;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxSkillParamData*                     SkillParam;                                        // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxSkillComponentData_UI_SkillParamData;

// ScriptStruct GbxUICoherent.GbxSkillComponentData_UI_SkillConditionData
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxSkillComponentData_UI_SkillConditionData final
{
public:
	class FName                                   behavior;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           ConditionDef;                                      // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InvertState;                                       // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxSkillComponentData_UI_SkillConditionData;

// ScriptStruct GbxUICoherent.GbxSkillComponentData_UI_SkillStateData
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxSkillComponentData_UI_SkillStateData final
{
public:
	class FName                                   behavior;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      SkillStateDef;                                     // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InvertState;                                       // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxSkillComponentData_UI_SkillStateData;

// ScriptStruct GbxUICoherent.GbxSkillComponentData_UI_SkillEventData
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FGbxSkillComponentData_UI_SkillEventData final
{
public:
	class FName                                   behavior;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           SkillEventDef;                                     // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxSkillComponentData_UI_SkillEventData;

// ScriptStruct GbxUICoherent.GbxSkillComponentUIHandlerData
// 0x0058 (0x0060 - 0x0008)
struct FGbxSkillComponentUIHandlerData : public FGbxHasStructType
{
public:
	FGbxDefPtrProperty_                           SkillDisplayDataDef;                               // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGbxSkillComponentData_UI_SkillParamData> SkillParams;                             // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxSkillComponentData_UI_SkillStateData> SkillStates;                             // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxSkillComponentData_UI_SkillEventData> SkillEvents;                             // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxSkillComponentData_UI_SkillConditionData> SkillConditions;                     // 0x0050(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxSkillComponentUIHandlerData;

// ScriptStruct GbxUICoherent.GbxUIDisplayDataDef_Skill
// 0x0000 (0x0018 - 0x0018)
struct FGbxUIDisplayDataDef_Skill : public FGbxUIDisplayDataDef
{
};
DUMPER7_ASSERTS_FGbxUIDisplayDataDef_Skill;

// ScriptStruct GbxUICoherent.GbxSkillComponent_UIEx
// 0x0010 (0x0060 - 0x0050)
struct FGbxSkillComponent_UIEx final : public FGbxSkillComponent
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxSkillComponent_UIEx;

// ScriptStruct GbxUICoherent.GbxSkillComponentData_UIItemEx
// 0x0030 (0x0058 - 0x0028)
struct FGbxSkillComponentData_UIItemEx final : public FGbxSkillComponentDataItem
{
public:
	struct FGbxInlineStruct                       HandlerData;                                       // 0x0028(0x0018)(Edit, NativeAccessSpecifierPublic)
	struct FGbxInlineStruct                       ActivationStrategy;                                // 0x0040(0x0018)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxSkillComponentData_UIItemEx;

// ScriptStruct GbxUICoherent.GbxSkillComponentData_UIEx
// 0x0028 (0x0058 - 0x0030)
struct FGbxSkillComponentData_UIEx final : public FGbxSkillComponentData
{
public:
	TArray<struct FGbxSkillComponentData_UIItemEx> items;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGbxInlineStruct                       DefaultActivationStrategy;                         // 0x0040(0x0018)(Edit, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxSkillComponentData_UIEx;

// ScriptStruct GbxUICoherent.GbxUIComponent
// 0x0030 (0x0048 - 0x0018)
struct FGbxUIComponent final : public FGbxDef
{
public:
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ContentPath;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JSPath;                                            // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIComponent;

// ScriptStruct GbxUICoherent.GbxUIElement
// 0x0008 (0x0008 - 0x0000)
struct FGbxUIElement
{
public:
	class FName                                   Ident;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIElement;

// ScriptStruct GbxUICoherent.GbxUIInteractiveElement
// 0x0008 (0x0010 - 0x0008)
struct FGbxUIInteractiveElement : public FGbxUIElement
{
public:
	bool                                          IsDisabled;                                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ContainerIdx;                                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIInteractiveElement;

// ScriptStruct GbxUICoherent.GbxUIMaterialAnimator
// 0x00A0 (0x00A0 - 0x0000)
struct alignas(0x08) FGbxUIMaterialAnimator final
{
public:
	uint8                                         Pad_0[0xA0];                                       // 0x0000(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIMaterialAnimator;

// ScriptStruct GbxUICoherent.GbxUIPageDef
// 0x0038 (0x0050 - 0x0018)
struct FGbxUIPageDef final : public FGbxDef
{
public:
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 path;                                              // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          buildcontentpath;                                  // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x17];                                      // 0x0039(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIPageDef;

// ScriptStruct GbxUICoherent.GbxUIViewDef
// 0x0138 (0x0150 - 0x0018)
struct FGbxUIViewDef final : public FGbxDef
{
public:
	uint8                                         Pad_18[0x20];                                      // 0x0018(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 page;                                              // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           PageDef;                                           // 0x0048(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          overlay;                                           // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         curve;                                             // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         display_order;                                     // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          abstract;                                          // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          use_viewport;                                      // 0x006D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          preload;                                           // 0x006E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Preload_PS;                                        // 0x006F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Preload_PC;                                        // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Preload_XB;                                        // 0x0071(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Preload_Sage;                                      // 0x0072(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          suspend;                                           // 0x0073(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          apply_safe_zone;                                   // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Ignores_Round_Robin_Mode;                          // 0x0075(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EGameInstancePhase>                    LoadPhases;                                        // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      Material_Path;                                     // 0x0088(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      Material_Parameters;                               // 0x00B0(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<class FName, FGbxDefPtrProperty_>        materialevents;                                    // 0x0100(0x0050)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIViewDef;

// ScriptStruct GbxUICoherent.GbxUIViewHandle
// 0x0010 (0x0010 - 0x0000)
struct FGbxUIViewHandle final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Context;                                           // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIViewHandle;

// ScriptStruct GbxUICoherent.GbxUIWidgetDataBase
// 0x00A8 (0x00B0 - 0x0008)
struct FGbxUIWidgetDataBase : public FGbxHasStructType
{
public:
	class FString                                 EventName;                                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LayerName;                                         // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LayerType;                                         // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RootClassHTML;                                     // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LayerIndex;                                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        HideFlags;                                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InputActive;                                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x5F];                                      // 0x0051(0x005F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIWidgetDataBase;

// ScriptStruct GbxUICoherent.GbxUIWidgetDef
// 0x0250 (0x0268 - 0x0018)
struct FGbxUIWidgetDef : public FGbxDef
{
public:
	uint8                                         Pad_18[0x30];                                      // 0x0018(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           Widget_Class;                                      // 0x0048(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 layer;                                             // 0x0060(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           ViewDef;                                           // 0x0070(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  require_gameplaytags;                              // 0x0088(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  reject_gameplaytags;                               // 0x00A8(0x0020)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  hide_gameplaytags;                                 // 0x00C8(0x0020)(Edit, NativeAccessSpecifierPublic)
	bool                                          IgnoreInputPriority;                               // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InputPriority;                                     // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UInputMappingContext>> MappingContexts;                              // 0x00F0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UInputMappingContext>> SupportMappingContexts;            // 0x0100(0x0050)(Edit, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, FGbxDefPtrProperty_> AudioDefTable;                                    // 0x0150(0x0050)(Edit, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UClass>>           EventScripts;                                      // 0x01A0(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0xB8];                                     // 0x01B0(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIWidgetDef;

// ScriptStruct GbxUICoherent.GbxUIWidgetClassDef
// 0x0058 (0x0070 - 0x0018)
struct FGbxUIWidgetClassDef final : public FGbxDef
{
public:
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Class;                                             // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          abstract;                                          // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 path;                                              // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 script_class;                                      // 0x0058(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          use_cursor;                                        // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          exclusive_input;                                   // 0x0069(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          use_device_input;                                  // 0x006A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIWidgetClassDef;

// ScriptStruct GbxUICoherent.GbxUIListEntryAction
// 0x0020 (0x0020 - 0x0000)
struct FGbxUIListEntryAction final
{
public:
	class FName                                   Ident;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 payload;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PayLoadTag;                                        // 0x0018(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIListEntryAction;

// ScriptStruct GbxUICoherent.GbxUIListEntryData
// 0x0090 (0x0090 - 0x0000)
struct FGbxUIListEntryData final
{
public:
	class FName                                   Ident;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           UXDisplayText;                                     // 0x0008(0x0018)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           UXDescriptionText;                                 // 0x0020(0x0018)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DebugText;                                         // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Style;                                             // 0x0048(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RequiredNexusLayer;                                // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TooltipKey;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         pips;                                              // 0x0070(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIListEntryAction>          actions;                                           // 0x0080(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIListEntryData;

// ScriptStruct GbxUICoherent.GbxUIListEntry
// 0x00A0 (0x00A0 - 0x0000)
struct FGbxUIListEntry final
{
public:
	struct FGbxUIListEntryData                    EntryData;                                         // 0x0000(0x0090)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIListEntryData>            sub_entries;                                       // 0x0090(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIListEntry;

// ScriptStruct GbxUICoherent.GbxUIListMenuEntrySet
// 0x0028 (0x0028 - 0x0000)
struct FGbxUIListMenuEntrySet final
{
public:
	class FName                                   Ident;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIListEntry>                Entries;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIListEntryAction>          back_actions;                                      // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIListMenuEntrySet;

// ScriptStruct GbxUICoherent.GbxUIWidgetDef_List
// 0x0010 (0x0278 - 0x0268)
struct FGbxUIWidgetDef_List final : public FGbxUIWidgetDef
{
public:
	TArray<struct FGbxUIListMenuEntrySet>         ListMenuEntrySets;                                 // 0x0268(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIWidgetDef_List;

// ScriptStruct GbxUICoherent.GbxUIListMenuEntry
// 0x0090 (0x00A0 - 0x0010)
struct FGbxUIListMenuEntry final : public FGbxUIInteractiveElement
{
public:
	class FText                                   Text;                                              // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   SecondaryText;                                     // 0x0020(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   DescriptionText;                                   // 0x0030(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 Style;                                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TooltipKey;                                        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PipKey;                                            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsBlacklisted;                                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x2F];                                      // 0x0071(0x002F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIListMenuEntry;

// ScriptStruct GbxUICoherent.GbxUIMenuEntrySet
// 0x0030 (0x0030 - 0x0000)
struct FGbxUIMenuEntrySet final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxUIListMenuEntry>            Entries;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x10];                                      // 0x0020(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIMenuEntrySet;

// ScriptStruct GbxUICoherent.GbxUIWidgetData_TooltipCheckboxEntry
// 0x0018 (0x0018 - 0x0000)
struct FGbxUIWidgetData_TooltipCheckboxEntry final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIWidgetData_TooltipCheckboxEntry;

// ScriptStruct GbxUICoherent.GbxUIWidgetData_TooltipCardHintEntry
// 0x0020 (0x0020 - 0x0000)
struct FGbxUIWidgetData_TooltipCardHintEntry final
{
public:
	class FString                                 input_action;                                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 loc_text;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIWidgetData_TooltipCardHintEntry;

// ScriptStruct GbxUICoherent.GbxUIWidgetData_Tooltip
// 0x0098 (0x0098 - 0x0000)
struct FGbxUIWidgetData_Tooltip final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Notify_Text;                                       // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   Header_Text;                                       // 0x0020(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   SubHeader_Text;                                    // 0x0030(0x0010)(NativeAccessSpecifierPublic)
	class FText                                   Body_Text;                                         // 0x0040(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 Image_Path;                                        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Checklist_Title_Text;                              // 0x0060(0x0010)(NativeAccessSpecifierPublic)
	TArray<struct FGbxUIWidgetData_TooltipCheckboxEntry> CheckboxEntries;                            // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIWidgetData_TooltipCardHintEntry> HintEntries;                                // 0x0080(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ShowTopDivider;                                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIWidgetData_Tooltip;

// ScriptStruct GbxUICoherent.GbxUIData_ListMenu
// 0x00F0 (0x01A0 - 0x00B0)
struct FGbxUIData_ListMenu : public FGbxUIWidgetDataBase
{
public:
	class FText                                   Title;                                             // 0x00B0(0x0010)(NativeAccessSpecifierPublic)
	TArray<struct FGbxUIListMenuEntry>            Entries;                                           // 0x00C0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         EntryStackIndex;                                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EntriesRev;                                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentFocusedIndex;                               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          horizontal;                                        // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InputContainerIdent;                               // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxUIWidgetData_Tooltip               TooltipData;                                       // 0x00F0(0x0098)(NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x18];                                     // 0x0188(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIData_ListMenu;

// ScriptStruct GbxUICoherent.GbxUIDebugEntry
// 0x00C8 (0x00C8 - 0x0000)
struct FGbxUIDebugEntry final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Localized_Text;                                    // 0x0010(0x0010)(NativeAccessSpecifierPublic)
	class FString                                 Text;                                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Tip;                                               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Idx;                                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Color_String;                                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x14];                                      // 0x005C(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Exec;                                              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Image;                                             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsImageReady;                                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsActiveSelection;                                 // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCloseDebugMenuOnExec;                             // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TooltipKey;                                        // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x20];                                      // 0x00A8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIDebugEntry;

// ScriptStruct GbxUICoherent.GbxUIData_DebugSubMenu
// 0x0018 (0x0018 - 0x0000)
struct FGbxUIData_DebugSubMenu final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxUIDebugEntry>               Entries;                                           // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIData_DebugSubMenu;

// ScriptStruct GbxUICoherent.GbxUIData_MenuDebugBase
// 0x0018 (0x00C8 - 0x00B0)
struct FGbxUIData_MenuDebugBase : public FGbxUIWidgetDataBase
{
public:
	TArray<struct FGbxUIData_DebugSubMenu>        Sub_Menus;                                         // 0x00B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         FontSize;                                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIData_MenuDebugBase;

// ScriptStruct GbxUICoherent.GbxUIDebugUICategoryEntry
// 0x0018 (0x0018 - 0x0000)
struct FGbxUIDebugUICategoryEntry final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CategoryIdx;                                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsActiveSelection;                                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIDebugUICategoryEntry;

// ScriptStruct GbxUICoherent.GbxUIData_DebugWidgetInfo
// 0x0020 (0x0020 - 0x0000)
struct FGbxUIData_DebugWidgetInfo final
{
public:
	class FString                                 Ident;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DataId;                                            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIData_DebugWidgetInfo;

// ScriptStruct GbxUICoherent.GbxUIData_DebugStateList
// 0x0010 (0x0010 - 0x0000)
struct FGbxUIData_DebugStateList final
{
public:
	TArray<class FString>                         States;                                            // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIData_DebugStateList;

// ScriptStruct GbxUICoherent.GbxUIData_DebugStackLayer
// 0x0020 (0x0020 - 0x0000)
struct FGbxUIData_DebugStackLayer final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Widgets;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxUIData_DebugStackLayer;

// ScriptStruct GbxUICoherent.GbxUIData_MenuDebugUI
// 0x0038 (0x0100 - 0x00C8)
struct FGbxUIData_MenuDebugUI final : public FGbxUIData_MenuDebugBase
{
public:
	TArray<struct FGbxUIDebugUICategoryEntry>     Category_Entries;                                  // 0x00C8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIData_DebugWidgetInfo>     Widgets;                                           // 0x00D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGbxUIData_DebugStackLayer>     StackLayers;                                       // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          HideWidgetData;                                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxUIData_MenuDebugUI;

// ScriptStruct GbxUICoherent.OakUIData_TestingWidget
// 0x0010 (0x00C0 - 0x00B0)
struct FOakUIData_TestingWidget final : public FGbxUIWidgetDataBase
{
public:
	class FString                                 path;                                              // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOakUIData_TestingWidget;

// ScriptStruct GbxUICoherent.TooltipHintDef
// 0x0028 (0x0028 - 0x0000)
struct FTooltipHintDef final
{
public:
	class FString                                 input_action;                                      // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           DisplayData;                                       // 0x0010(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTooltipHintDef;

// ScriptStruct GbxUICoherent.TooltipDataDef
// 0x0080 (0x0098 - 0x0018)
struct FTooltipDataDef : public FGbxDef
{
public:
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NotifyText;                                        // 0x0020(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Header;                                            // 0x0030(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   SubHeader;                                         // 0x0040(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   Body;                                              // 0x0050(0x0010)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              Image;                                             // 0x0060(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTooltipHintDef>                HintEntries;                                       // 0x0088(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTooltipDataDef;

}

