#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxVegetation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GbxVegetation_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GbxVegetation.GbxDynamicVegetationActor
// 0x0008 (0x0398 - 0x0390)
class AGbxDynamicVegetationActor final : public AActor
{
public:
	class UGbxDynamicVegetationComponent*         VegetationComponent;                               // 0x0390(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDynamicVegetationActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDynamicVegetationActor")
	}
	static class AGbxDynamicVegetationActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxDynamicVegetationActor>();
	}
};
DUMPER7_ASSERTS_AGbxDynamicVegetationActor;

// Class GbxVegetation.GbxDynamicVegetationCollisionComponent
// 0x0100 (0x03B0 - 0x02B0)
class UGbxDynamicVegetationCollisionComponent final : public USceneComponent
{
public:
	EGbxVegetationCollisionType                   CollisionType;                                     // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Radius;                                            // 0x02AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x02B4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x02C0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C8[0xE8];                                     // 0x02C8(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDynamicVegetationCollisionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDynamicVegetationCollisionComponent")
	}
	static class UGbxDynamicVegetationCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDynamicVegetationCollisionComponent>();
	}
};
DUMPER7_ASSERTS_UGbxDynamicVegetationCollisionComponent;

// Class GbxVegetation.GbxDynamicVegetationComponent
// 0x0020 (0x1170 - 0x1150)
class UGbxDynamicVegetationComponent final : public USkeletalMeshComponent
{
public:
	struct FGbxDynamicVegetationSimulationParameters SimulationParameters;                           // 0x1148(0x001C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnableSkeletalMeshComponent;                      // 0x1164(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1165[0xB];                                     // 0x1165(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxDynamicVegetationComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxDynamicVegetationComponent")
	}
	static class UGbxDynamicVegetationComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxDynamicVegetationComponent>();
	}
};
DUMPER7_ASSERTS_UGbxDynamicVegetationComponent;

// Class GbxVegetation.GbxCollisionSubsystem
// 0x0158 (0x0198 - 0x0040)
class UGbxCollisionSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x158];                                     // 0x0040(0x0158)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxCollisionSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxCollisionSubsystem")
	}
	static class UGbxCollisionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxCollisionSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxCollisionSubsystem;

// Class GbxVegetation.GbxVegetationProjectSettings
// 0x0008 (0x0030 - 0x0028)
class UGbxVegetationProjectSettings final : public UObject
{
public:
	float                                         DefaultActivationDistanceCM;                       // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKillCollisions;                                   // 0x002C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bKillSimulation;                                   // 0x002D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxVegetationProjectSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxVegetationProjectSettings")
	}
	static class UGbxVegetationProjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxVegetationProjectSettings>();
	}
};
DUMPER7_ASSERTS_UGbxVegetationProjectSettings;

// Class GbxVegetation.GbxVegetationSubsystem
// 0x0250 (0x0280 - 0x0030)
class UGbxVegetationSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x250];                                     // 0x0030(0x0250)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxVegetationSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxVegetationSubsystem")
	}
	static class UGbxVegetationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxVegetationSubsystem>();
	}
};
DUMPER7_ASSERTS_UGbxVegetationSubsystem;

// Class GbxVegetation.MaterialExpressionVegetationBoneTextureDecode
// 0x0068 (0x0118 - 0x00B0)
class UMaterialExpressionVegetationBoneTextureDecode final : public UMaterialExpression
{
public:
	struct FExpressionInput                       BoneIndex;                                         // 0x00B0(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	struct FExpressionInput                       TextureObject;                                     // 0x00D8(0x0028)(NoDestructor, NativeAccessSpecifierPrivate)
	uint32                                        ConstBoneIndex;                                    // 0x0100(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Texture;                                           // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x8];                                      // 0x0110(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MaterialExpressionVegetationBoneTextureDecode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MaterialExpressionVegetationBoneTextureDecode")
	}
	static class UMaterialExpressionVegetationBoneTextureDecode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionVegetationBoneTextureDecode>();
	}
};
DUMPER7_ASSERTS_UMaterialExpressionVegetationBoneTextureDecode;

}

