#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxWeapon

#include "Basic.hpp"

#include "GbxNexus_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxAI_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxAudio_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum GbxWeapon.EWeaponTargetLockChannel
// NumValues: 0x0003
enum class EWeaponTargetLockChannel : uint8
{
	Default                                  = 0,
	Ability                                  = 1,
	MAX                                      = 2,
};

// Enum GbxWeapon.EHideWeaponNotifyOption
// NumValues: 0x0003
enum class EHideWeaponNotifyOption : uint8
{
	Hide                                     = 0,
	Unhide                                   = 1,
	EHideWeaponNotifyOption_MAX              = 2,
};

// Enum GbxWeapon.EWeaponActionChannel
// NumValues: 0x0005
enum class EWeaponActionChannel : uint8
{
	Use                                      = 0,
	Zoom                                     = 1,
	Reload                                   = 2,
	Other                                    = 3,
	MAX                                      = 4,
};

// Enum GbxWeapon.EShotDamageModifierType
// NumValues: 0x0004
enum class EShotDamageModifierType : uint32
{
	ScaleAdd                                 = 0,
	Add                                      = 1,
	ScaleMultiply                            = 2,
	EShotDamageModifierType_MAX              = 3,
};

// Enum GbxWeapon.EWeaponUseEvent
// NumValues: 0x0004
enum class EWeaponUseEvent : uint8
{
	UseStarted                               = 0,
	Used                                     = 1,
	UseFinished                              = 2,
	EWeaponUseEvent_MAX                      = 3,
};

// Enum GbxWeapon.EWeaponHeatNotifyEvent
// NumValues: 0x0003
enum class EWeaponHeatNotifyEvent : uint8
{
	Changed                                  = 0,
	Impulse                                  = 1,
	EWeaponHeatNotifyEvent_MAX               = 2,
};

// Enum GbxWeapon.EWeaponAudioBehaviorScope
// NumValues: 0x0005
enum class EWeaponAudioBehaviorScope : uint8
{
	NPC                                      = 1,
	RemotePlayer                             = 2,
	LocalPlayer                              = 4,
	INVALID                                  = 8,
	EWeaponAudioBehaviorScope_MAX            = 9,
};

// Enum GbxWeapon.EAtt_Weapon
// NumValues: 0x0003
enum class EAtt_Weapon : uint8
{
	weapon_equip_time                        = 0,
	weapon_put_down_time                     = 1,
	weapon_MAX                               = 2,
};

// Enum GbxWeapon.EAudioWeaponStates
// NumValues: 0x0009
enum class EAudioWeaponStates : uint8
{
	Inactive                                 = 1,
	Active                                   = 2,
	Locked                                   = 4,
	Reloading                                = 8,
	Equipping                                = 16,
	PuttingDown                              = 32,
	Using                                    = 64,
	ModeSwitch                               = 128,
	EAudioWeaponStates_MAX                   = 129,
};

// Enum GbxWeapon.EAtt_WeaponBehaviorAmmo
// NumValues: 0x0004
enum class EAtt_WeaponBehaviorAmmo : uint8
{
	weapon_ammo_regen_rate                   = 0,
	weapon_ammo_consume_regen_delay          = 1,
	weapon_max_loaded_ammo                   = 2,
	weapon_MAX                               = 3,
};

// Enum GbxWeapon.EAmmoRegenType
// NumValues: 0x0004
enum class EAmmoRegenType : uint32
{
	None                                     = 0,
	GenerateAmmo                             = 1,
	RefillLoadedAmmo                         = 2,
	EAmmoRegenType_MAX                       = 3,
};

// Enum GbxWeapon.EAmmoRegenCondition
// NumValues: 0x0004
enum class EAmmoRegenCondition : uint32
{
	None                                     = 0,
	Equipped                                 = 1,
	Using                                    = 2,
	EAmmoRegenCondition_MAX                  = 3,
};

// Enum GbxWeapon.EAtt_WeaponBehaviorDamageModifier
// NumValues: 0x0002
enum class EAtt_WeaponBehaviorDamageModifier : uint8
{
	weapon_damage_modifier_add_critical_hit  = 0,
	weapon_damage_modifier_add_critical_MAX  = 1,
};

// Enum GbxWeapon.EAtt_WeaponBehaviorFire
// NumValues: 0x0019
enum class EAtt_WeaponBehaviorFire : uint8
{
	weapon_fire_rate                         = 0,
	weapon_auto_burst_count                  = 1,
	weapon_burst_fire_delay                  = 2,
	weapon_fire_rate_accel_duration          = 3,
	weapon_fire_rate_decel_duration          = 4,
	weapon_shot_cost                         = 5,
	weapon_damage                            = 6,
	weapon_damage_radius                     = 7,
	weapon_spread                            = 8,
	weapon_accuracy_impulse                  = 9,
	weapon_burst_accuracy_impulse_scale      = 10,
	weapon_recoil_scale_x                    = 11,
	weapon_recoil_scale_y                    = 12,
	weapon_impact_force                      = 13,
	weapon_destructible_force                = 14,
	weapon_destructible_strain               = 15,
	weapon_lock_onto_target                  = 16,
	weapon_heat_impulse                      = 17,
	weapon_ai_damage_scale                   = 18,
	weapon_shot_offset_scale                 = 19,
	weapon_min_fire_rate_scale               = 20,
	weapon_burst_fire_rate_scale             = 21,
	weapon_ai_force_scale                    = 22,
	weapon_ai_fire_rate_scale                = 23,
	weapon_MAX                               = 24,
};

// Enum GbxWeapon.EAtt_WeaponBehaviorHeat
// NumValues: 0x0005
enum class EAtt_WeaponBehaviorHeat : uint8
{
	weapon_heat_cooldown_rate                = 0,
	weapon_heat_cooldown_delay               = 1,
	weapon_overheat_time                     = 2,
	weapon_overheat_cooldown_delay           = 3,
	weapon_MAX                               = 4,
};

// Enum GbxWeapon.EAtt_WeaponBehaviorSway
// NumValues: 0x0005
enum class EAtt_WeaponBehaviorSway : uint8
{
	weapon_sway_scale                        = 0,
	weapon_sway_accuracy_scale               = 1,
	weapon_sway_zoom_scale                   = 2,
	weapon_sway_zoom_accuracy_scale          = 3,
	weapon_sway_MAX                          = 4,
};

// Enum GbxWeapon.EAtt_WeaponBehaviorUse
// NumValues: 0x000D
enum class EAtt_WeaponBehaviorUse : uint8
{
	weapon_switch_mode_time_scale            = 0,
	weapon_ai_accuracy                       = 1,
	weapon_ai_max_accuracy_scale_range       = 2,
	weapon_ai_min_accuracy_scale_range       = 3,
	weapon_ai_min_accuracy                   = 4,
	weapon_ai_min_desired_range              = 5,
	weapon_ai_max_desired_range              = 6,
	weapon_ai_preferred_range                = 7,
	weapon_ai_burst_count                    = 8,
	weapon_ai_burst_time                     = 9,
	weapon_ai_burst_delay                    = 10,
	weapon_ai_projectile_speed               = 11,
	weapon_MAX                               = 12,
};

// Enum GbxWeapon.EAtt_WeaponBehaviorVisibleAmmo
// NumValues: 0x0002
enum class EAtt_WeaponBehaviorVisibleAmmo : uint8
{
	weapon_visible_bones_per_loaded_ammo     = 0,
	weapon_visible_bones_per_loaded_MAX      = 1,
};

// Enum GbxWeapon.EVisibleAmmoState
// NumValues: 0x0004
enum class EVisibleAmmoState : uint8
{
	LoadedAmmo                               = 0,
	PendingLoadedAmmo                        = 1,
	Disabled                                 = 2,
	EVisibleAmmoState_MAX                    = 3,
};

// Enum GbxWeapon.EVisibleAmmoUpdateMethod
// NumValues: 0x0005
enum class EVisibleAmmoUpdateMethod : uint8
{
	Auto                                     = 0,
	Manual                                   = 1,
	AutoAdd                                  = 2,
	AutoRemove                               = 3,
	EVisibleAmmoUpdateMethod_MAX             = 4,
};

// Enum GbxWeapon.EVisibleAmmoUseModeType
// NumValues: 0x0004
enum class EVisibleAmmoUseModeType : uint8
{
	None                                     = 0,
	Start                                    = 1,
	Switch                                   = 2,
	EVisibleAmmoUseModeType_MAX              = 3,
};

// Enum GbxWeapon.EAtt_WeaponBehaviorZoom
// NumValues: 0x0004
enum class EAtt_WeaponBehaviorZoom : uint8
{
	weapon_zoom_fov_scale                    = 0,
	weapon_zoom_duration                     = 1,
	weapon_zoom_shot_offset_scale            = 2,
	weapon_zoom_MAX                          = 3,
};

// Enum GbxWeapon.EWeaponAmmoResolverValue
// NumValues: 0x000A
enum class EWeaponAmmoResolverValue : uint8
{
	LoadedAmmo                               = 0,
	MaxLoadedAmmo                            = 1,
	SpareAmmo                                = 2,
	MaxSpareAmmo                             = 3,
	StoredAmmo                               = 4,
	MaxStoredAmmo                            = 5,
	LoadedAmmoPercent                        = 6,
	SpareAmmoPercent                         = 7,
	StoredAmmoPercent                        = 8,
	EWeaponAmmoResolverValue_MAX             = 9,
};

// Enum GbxWeapon.EWeaponFireRateState
// NumValues: 0x0004
enum class EWeaponFireRateState : uint8
{
	None                                     = 0,
	Accelerating                             = 1,
	Decelerating                             = 2,
	EWeaponFireRateState_MAX                 = 3,
};

// Enum GbxWeapon.EAtt_WeaponBehaviorReload
// NumValues: 0x0002
enum class EAtt_WeaponBehaviorReload : uint8
{
	weapon_reload_time                       = 0,
	weapon_reload_MAX                        = 1,
};

// Enum GbxWeapon.EWeaponPutDownType
// NumValues: 0x0003
enum class EWeaponPutDownType : uint8
{
	Default                                  = 0,
	Instant                                  = 1,
	EWeaponPutDownType_MAX                   = 2,
};

// Enum GbxWeapon.EWeaponEquipType
// NumValues: 0x0004
enum class EWeaponEquipType : uint8
{
	Default                                  = 0,
	Instant                                  = 1,
	Custom                                   = 2,
	EWeaponEquipType_MAX                     = 3,
};

// Enum GbxWeapon.EResolverWeaponState
// NumValues: 0x0005
enum class EResolverWeaponState : uint8
{
	None                                     = 0,
	Using                                    = 1,
	Firing                                   = 2,
	Reloading                                = 3,
	EResolverWeaponState_MAX                 = 4,
};

// Enum GbxWeapon.EWeaponTargetLockContext
// NumValues: 0x0003
enum class EWeaponTargetLockContext : uint8
{
	Default                                  = 0,
	Instigator                               = 1,
	EWeaponTargetLockContext_MAX             = 2,
};

// Enum GbxWeapon.EWeaponTriggerFeedbackMode
// NumValues: 0x0006
enum class EWeaponTriggerFeedbackMode : uint8
{
	Off                                      = 0,
	Feedback                                 = 1,
	Weapon                                   = 2,
	Slope                                    = 3,
	Vibration                                = 4,
	EWeaponTriggerFeedbackMode_MAX           = 5,
};

// ScriptStruct GbxWeapon.CameraModeBehavior_WeaponLook
// 0x0008 (0x0098 - 0x0090)
struct FCameraModeBehavior_WeaponLook : public FCameraModeBehavior_Look
{
public:
	float                                         PreviousZoomPct;                                   // 0x0090(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentPitchSnap;                                  // 0x0094(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FCameraModeBehavior_WeaponLook;

// ScriptStruct GbxWeapon.WeaponAmmoChamberBoneControl
// 0x0010 (0x0058 - 0x0048)
struct FWeaponAmmoChamberBoneControl final : public FInventoryBodyControl
{
public:
	TArray<class FName>                           Bones;                                             // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FWeaponAmmoChamberBoneControl;

// ScriptStruct GbxWeapon.ActiveWeaponSlotData
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FActiveWeaponSlotData final
{
public:
	class FName                                   AttachSocket;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      AccuracyPool;                                      // 0x0008(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FActiveWeaponSlotData;

// ScriptStruct GbxWeapon.UseModeAttributeEffects
// 0x0018 (0x0018 - 0x0000)
struct FUseModeAttributeEffects final
{
public:
	int32                                         usemodebitmask;                                    // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxAttributeEffect>            attributeeffects;                                  // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FUseModeAttributeEffects;

// ScriptStruct GbxWeapon.ActiveWeaponSlot
// 0x0140 (0x0140 - 0x0000)
struct FActiveWeaponSlot final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                Weapon;                                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWeapon*                                PendingWeapon;                                     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWeapon*                                ClientPredictedPendingWeapon;                      // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x108];                                     // 0x0038(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActiveWeaponSlot;

// ScriptStruct GbxWeapon.ActiveWeaponsState
// 0x0208 (0x0208 - 0x0000)
struct FActiveWeaponsState
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AWeapon* EventWeapon, bool bAutoReload)> OnWeaponReloadStarted; // 0x0008(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x18];                                      // 0x0018(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AWeapon* EventWeapon, bool bCompleted)> OnWeaponReloadEnded; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x18];                                      // 0x0040(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bRestricted)> OnWeaponRestrictionChanged;                     // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x38];                                      // 0x0068(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveWeaponSlot>              Slots;                                             // 0x00A0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B0[0x158];                                     // 0x00B0(0x0158)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActiveWeaponsState;

// ScriptStruct GbxWeapon.CameraWeaponData
// 0x0138 (0x0138 - 0x0000)
struct alignas(0x08) FCameraWeaponData final
{
public:
	uint8                                         Pad_0[0x138];                                      // 0x0000(0x0138)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCameraWeaponData;

// ScriptStruct GbxWeapon.WeaponFireMidiSequence
// 0x0018 (0x0018 - 0x0000)
struct FWeaponFireMidiSequence final
{
public:
	TArray<uint8>                                 Sequence;                                          // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         LoopIndex;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponFireMidiSequence;

// ScriptStruct GbxWeapon.WeaponFireAudioBehavior
// 0x0090 (0x0090 - 0x0000)
struct FWeaponFireAudioBehavior final
{
public:
	struct FGameplayTag                           BehaviorName;                                      // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetSocket;                                        // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EmitterSocket;                                     // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x1];                                       // 0x0014(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSetEvent;                                         // 0x0015(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           WwiseEvent;                                        // 0x0018(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetStopEvent;                                     // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           StopEvent;                                         // 0x0038(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x1];                                       // 0x0050(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSetModeMask;                                      // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ModeMask;                                          // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x1];                                       // 0x0058(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSetDelay;                                         // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         delay;                                             // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x1];                                       // 0x0060(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSetScope;                                         // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ScopeMask;                                         // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x1];                                       // 0x0068(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSetMidiSequence;                                  // 0x0069(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponFireMidiSequence                MidiSequence;                                      // 0x0070(0x0018)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FWeaponFireAudioBehavior;

// ScriptStruct GbxWeapon.AIWantsToFireWeaponValueResolver
// 0x0000 (0x0008 - 0x0008)
struct FAIWantsToFireWeaponValueResolver final : public FAttributeValueResolver
{
};
DUMPER7_ASSERTS_FAIWantsToFireWeaponValueResolver;

// ScriptStruct GbxWeapon.AIWeaponUserState
// 0x01F0 (0x01F0 - 0x0000)
struct FAIWeaponUserState final
{
public:
	TMulticastInlineDelegate<void()>              OnWeaponReloadStarted;                             // 0x0000(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x30];                                      // 0x0010(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerActor;                                        // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IAIWeaponUser>         owner;                                             // 0x0048(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_58[0x30];                                      // 0x0058(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAITicketUseData                    AIWeaponUseTicket;                                 // 0x0088(0x00B8)(NativeAccessSpecifierPrivate)
	uint8                                         Pad_140[0xB0];                                     // 0x0140(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIWeaponUserState;

// ScriptStruct GbxWeapon.AIWeaponUseSettings
// 0x04C0 (0x04C0 - 0x0000)
struct FAIWeaponUseSettings final
{
public:
	struct FGbxAttributeInit                      MaxDesiredRange;                                   // 0x0000(0x0050)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxAttributeInit                      MinDesiredRange;                                   // 0x0050(0x0050)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideDesiredRange;                             // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      PreferredRange;                                    // 0x00A8(0x0050)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverridePerferredRange;                           // 0x00F8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      DesiredUseMode;                                    // 0x0100(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideDesiredUseMode;                           // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      FireConeAngle;                                     // 0x0158(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideFireConeAngle;                            // 0x01A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBurstTime;                                     // 0x01A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideUseBurstTime;                             // 0x01AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      BurstCount;                                        // 0x01B0(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideBurstCount;                               // 0x0200(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      BurstTime;                                         // 0x0208(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideBurstTime;                                // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      BurstDelay;                                        // 0x0260(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideBurstDelay;                               // 0x02B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      Accuracy;                                          // 0x02B8(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideAccuracy;                                 // 0x0308(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      MinAccuracy;                                       // 0x0310(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideMinAccuracy;                              // 0x0360(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      MaxAccuracyScaleRange;                             // 0x0368(0x0050)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxAttributeInit                      MinAccuracyScaleRange;                             // 0x03B8(0x0050)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideAccuracyScaleRange;                       // 0x0408(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      ProjectileSpeed;                                   // 0x0410(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideProjectileSpeed;                          // 0x0460(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      CoveringFireTime;                                  // 0x0468(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideCoveringFireTime;                         // 0x04B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIWeaponUseSettings;

// ScriptStruct GbxWeapon.CrosshairDef
// 0x0010 (0x0028 - 0x0018)
struct FCrosshairDef : public FGbxDef
{
public:
	class FString                                 DynamicCrosshairVisual;                            // 0x0018(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FCrosshairDef;

// ScriptStruct GbxWeapon.CurrentWeaponValueResolver
// 0x0000 (0x0008 - 0x0008)
struct FCurrentWeaponValueResolver final : public FAttributeValueResolver
{
};
DUMPER7_ASSERTS_FCurrentWeaponValueResolver;

// ScriptStruct GbxWeapon.GbxBrainAspectSettings_CanUseWeapon
// 0x0000 (0x0080 - 0x0080)
struct FGbxBrainAspectSettings_CanUseWeapon final : public FGbxBrainAspectSettings
{
};
DUMPER7_ASSERTS_FGbxBrainAspectSettings_CanUseWeapon;

// ScriptStruct GbxWeapon.GbxBrainAspect_CanUseWeapon
// 0x0010 (0x00E8 - 0x00D8)
struct FGbxBrainAspect_CanUseWeapon final : public FGbxBrainAspect
{
public:
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainAspect_CanUseWeapon;

// ScriptStruct GbxWeapon.GbxBrainAspectSettings_ReloadWeapon
// 0x0070 (0x00F0 - 0x0080)
struct FGbxBrainAspectSettings_ReloadWeapon final : public FGbxBrainAspectSettings
{
public:
	struct FGbxParam                              LoadedAmmoThreshold;                               // 0x0080(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              NoTargetWarmup;                                    // 0x00B8(0x0038)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxBrainAspectSettings_ReloadWeapon;

// ScriptStruct GbxWeapon.GbxBrainAspect_ReloadWeapon
// 0x0028 (0x0100 - 0x00D8)
struct FGbxBrainAspect_ReloadWeapon final : public FGbxBrainAspect
{
public:
	uint8                                         Pad_D8[0x28];                                      // 0x00D8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainAspect_ReloadWeapon;

// ScriptStruct GbxWeapon.GbxBrainAspectSettings_UseWeapon
// 0x04D0 (0x0550 - 0x0080)
struct FGbxBrainAspectSettings_UseWeapon final : public FGbxBrainAspectSettings
{
public:
	struct FAIWeaponUseSettings                   AIWeaponOverrides;                                 // 0x0080(0x04C0)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxAIHeldFilter                       WeaponFilter;                                      // 0x0540(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainAspectSettings_UseWeapon;

// ScriptStruct GbxWeapon.GbxBrainAspect_UseWeapon
// 0x0020 (0x00F8 - 0x00D8)
struct FGbxBrainAspect_UseWeapon final : public FGbxBrainAspect
{
public:
	uint8                                         Pad_D8[0x20];                                      // 0x00D8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainAspect_UseWeapon;

// ScriptStruct GbxWeapon.GbxBrainTaskSettings_CoverAttack
// 0x0358 (0x04F0 - 0x0198)
struct FGbxBrainTaskSettings_CoverAttack final : public FGbxBrainTaskSettings_CompositeQuery
{
public:
	struct FCoverUseParams                        UseParams;                                         // 0x0198(0x0110)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bCanFireWhileMoving;                               // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMustHaveUsableWeapon;                             // 0x02A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2AA[0x2];                                      // 0x02AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAIHeldFilter                       WeaponFilter;                                      // 0x02AC(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGbxParam                              target;                                            // 0x02B8(0x0038)(Edit, NativeAccessSpecifierPrivate)
	FGbxDefPtrProperty_                           TakeCoverDialogEvent;                              // 0x02F0(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EGbxBrainRotationPreset                       RotationWhileMoving;                               // 0x0308(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGpsQueryRunData                       Query;                                             // 0x0310(0x01E0)(Edit, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxBrainTaskSettings_CoverAttack;

// ScriptStruct GbxWeapon.GbxBrainTaskSettings_Hide
// 0x0320 (0x04B8 - 0x0198)
struct FGbxBrainTaskSettings_Hide final : public FGbxBrainTaskSettings_CompositeQuery
{
public:
	struct FGbxParam                              target;                                            // 0x0198(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGpsQueryRunData                       HidingSpotQuery;                                   // 0x01D0(0x01E0)(Edit, NativeAccessSpecifierPublic)
	bool                                          bFaceTargetWhileMoving;                            // 0x03B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShootTargetWhileMoving;                           // 0x03B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFaceTargetWhileHiding;                            // 0x03B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B3[0x5];                                      // 0x03B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              HideDuration;                                      // 0x03B8(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseHideDuration;                                  // 0x03F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHideAction;                                    // 0x03F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxTrickRef                           HideAction;                                        // 0x03F8(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxParam                              HideActionCooldown;                                // 0x0410(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              HideActionCount;                                   // 0x0448(0x0038)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FGbxParam                              HideActionPlayRate;                                // 0x0480(0x0038)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FGbxBrainTaskSettings_Hide;

// ScriptStruct GbxWeapon.GbxBrainTaskSettings_Wait
// 0x0550 (0x06E8 - 0x0198)
struct FGbxBrainTaskSettings_Wait final : public FGbxBrainTaskSettings_Composite
{
public:
	struct FGbxParam                              target;                                            // 0x0198(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bAllowRotateBody;                                  // 0x01D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRotateAim;                                   // 0x01D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRotateHead;                                  // 0x01D2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowRotateEyes;                                  // 0x01D3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              DesiredBodyAngle;                                  // 0x01D8(0x0038)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bUseDesiredBodyAngle;                              // 0x0210(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowWeaponFire;                                  // 0x0211(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIWeaponUseSettings                   WeaponUseSettingsOverrides;                        // 0x0218(0x04C0)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxAIHeldFilter                       WeaponFilter;                                      // 0x06D8(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxBrainTaskSettings_Wait;

// ScriptStruct GbxWeapon.GbxBrainTaskSettings_WeaponAttack
// 0x06E0 (0x0878 - 0x0198)
struct FGbxBrainTaskSettings_WeaponAttack final : public FGbxBrainTaskSettings_CompositeQuery
{
public:
	struct FGbxParam                              target;                                            // 0x0198(0x0038)(Edit, NativeAccessSpecifierPrivate)
	bool                                          bCanMoveIntoPosition;                              // 0x01D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCanFireWhileMoving;                               // 0x01D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EGbxBrainRotationPreset                       RotationWhileMoving;                               // 0x01D2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EGbxBrainRotationPreset                       RotationWhileStill;                                // 0x01D3(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGpsQueryRunData                       Query;                                             // 0x01D8(0x01E0)(Edit, NativeAccessSpecifierPrivate)
	struct FAIWeaponUseSettings                   AIWeaponOverrides;                                 // 0x03B8(0x04C0)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxBrainTaskSettings_WeaponAttack;

// ScriptStruct GbxWeapon.GbxBrainTaskSettings_WeaponAttack_v2
// 0x0F48 (0x10E0 - 0x0198)
struct FGbxBrainTaskSettings_WeaponAttack_v2 final : public FGbxBrainTaskSettings_CompositeQuery
{
public:
	struct FAIWeaponUseSettings                   AIWeaponOverrides;                                 // 0x0198(0x04C0)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxAIHeldFilter                       WeaponFilter;                                      // 0x0658(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_664[0x4];                                      // 0x0664(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              BoundMinRange;                                     // 0x0668(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              BoundMaxRange;                                     // 0x06A0(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              DesiredHeightMin;                                  // 0x06D8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              DesiredHeightMax;                                  // 0x0710(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              ProjectUpOffset;                                   // 0x0748(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              BoundCooldown;                                     // 0x0780(0x0038)(Edit, NativeAccessSpecifierPublic)
	bool                                          bUseTicketForBound;                                // 0x07B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B9[0x7];                                      // 0x07B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAITicketUseData                    MoveTicket;                                        // 0x07C0(0x00B8)(Edit, NativeAccessSpecifierPublic)
	EGbxBrainRotationPreset                       RotationWhileStill;                                // 0x0878(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxBrainRotationPreset                       RotationWhileBound;                                // 0x0879(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanFireWhileBounding;                             // 0x087A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_87B[0x5];                                      // 0x087B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           AdvancingDialogEvent;                              // 0x0880(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           RepositioningDialogEvent;                          // 0x0898(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanDoBackup;                                      // 0x08B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8B1[0x7];                                      // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxParam                              BackupStartRange;                                  // 0x08B8(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              BackupCooldown;                                    // 0x08F0(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGbxParam                              WaitForTargetTime;                                 // 0x0928(0x0038)(Edit, NativeAccessSpecifierPublic)
	struct FGpsQueryRunData                       SmthSmartQuery;                                    // 0x0960(0x01E0)(NativeAccessSpecifierPrivate)
	struct FGpsQueryRunData                       AdjustQuery;                                       // 0x0B40(0x01E0)(NativeAccessSpecifierPrivate)
	struct FGpsQueryRunData                       BackupQuery;                                       // 0x0D20(0x01E0)(NativeAccessSpecifierPrivate)
	struct FGpsQueryRunData                       BoundQuery;                                        // 0x0F00(0x01E0)(NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxBrainTaskSettings_WeaponAttack_v2;

// ScriptStruct GbxWeapon.GbxCondition_CanReloadWeapon
// 0x0000 (0x0010 - 0x0010)
struct FGbxCondition_CanReloadWeapon final : public FGbxConditionValueResolver
{
};
DUMPER7_ASSERTS_FGbxCondition_CanReloadWeapon;

// ScriptStruct GbxWeapon.GbxCondition_WeaponActiveSlot
// 0x0008 (0x0018 - 0x0010)
struct FGbxCondition_WeaponActiveSlot final : public FGbxConditionValueResolver
{
public:
	int32                                         ActiveSlot;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxCondition_WeaponActiveSlot;

// ScriptStruct GbxWeapon.GbxCondition_WeaponAmmoCount
// 0x0008 (0x0018 - 0x0010)
struct FGbxCondition_WeaponAmmoCount final : public FGbxConditionValueResolver
{
public:
	int32                                         Count;                                             // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          GreaterCheck;                                      // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxCondition_WeaponAmmoCount;

// ScriptStruct GbxWeapon.GbxCondition_WeaponHeldComponent
// 0x0008 (0x0018 - 0x0010)
struct FGbxCondition_WeaponHeldComponent final : public FGbxConditionValueResolver
{
public:
	class FName                                   Identifier;                                        // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
DUMPER7_ASSERTS_FGbxCondition_WeaponHeldComponent;

// ScriptStruct GbxWeapon.GbxCondition_WeaponUseMode
// 0x0008 (0x0018 - 0x0010)
struct FGbxCondition_WeaponUseMode final : public FGbxConditionValueResolver
{
public:
	uint8                                         Mode;                                              // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxCondition_WeaponUseMode;

// ScriptStruct GbxWeapon.GbxCondition_WeaponZoom
// 0x0008 (0x0018 - 0x0010)
struct FGbxCondition_WeaponZoom final : public FGbxConditionValueResolver
{
public:
	bool                                          bIsZoomedIn;                                       // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIncludeTransition;                                // 0x0011(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxCondition_WeaponZoom;

// ScriptStruct GbxWeapon.GpsGeneratorSettings_TargetingOwner
// 0x0000 (0x0040 - 0x0040)
struct FGpsGeneratorSettings_TargetingOwner final : public FGpsGeneratorSettings
{
};
DUMPER7_ASSERTS_FGpsGeneratorSettings_TargetingOwner;

// ScriptStruct GbxWeapon.GpsGenerator_TargetingOwner
// 0x0390 (0x07A8 - 0x0418)
struct FGpsGenerator_TargetingOwner final : public FGpsGenerator
{
public:
	uint8                                         Pad_418[0x390];                                    // 0x0418(0x0390)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsGenerator_TargetingOwner;

// ScriptStruct GbxWeapon.GpsGeneratorSettings_WeaponTargetLocks
// 0x0008 (0x0048 - 0x0040)
struct FGpsGeneratorSettings_WeaponTargetLocks final : public FGpsGeneratorSettings
{
public:
	EWeaponTargetLockContext                      SourceContext;                                     // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EWeaponTargetLockChannel                      SourceChannel;                                     // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsGeneratorSettings_WeaponTargetLocks;

// ScriptStruct GbxWeapon.GpsGenerator_WeaponTargetLocks
// 0x0390 (0x07A8 - 0x0418)
struct FGpsGenerator_WeaponTargetLocks final : public FGpsGenerator
{
public:
	uint8                                         Pad_418[0x390];                                    // 0x0418(0x0390)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsGenerator_WeaponTargetLocks;

// ScriptStruct GbxWeapon.GpsTestSettings_WeaponTargetLockScoringBoost
// 0x0008 (0x0088 - 0x0080)
struct FGpsTestSettings_WeaponTargetLockScoringBoost final : public FGpsTestSettings
{
public:
	float                                         Boost;                                             // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponTargetLockContext                      SourceContext;                                     // 0x0084(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EWeaponTargetLockChannel                      SourceChannel;                                     // 0x0085(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGpsTestSettings_WeaponTargetLockScoringBoost;

// ScriptStruct GbxWeapon.GpsTest_WeaponTargetLockScoringBoost
// 0x0000 (0x0060 - 0x0060)
struct FGpsTest_WeaponTargetLockScoringBoost final : public FGpsTest
{
};
DUMPER7_ASSERTS_FGpsTest_WeaponTargetLockScoringBoost;

// ScriptStruct GbxWeapon.ShotModifierData
// 0x0210 (0x0218 - 0x0008)
struct FShotModifierData final : public FGbxHasStructType
{
public:
	uint16                                        ModifierFlags;                                     // 0x0008(0x0002)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bModifyDamage;                                     // 0x000A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      DamageModifier;                                    // 0x0010(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	EShotDamageModifierType                       DamageModifierType;                                // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDistributeBetweenProjectiles;                     // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      DamageType;                                        // 0x0068(0x0018)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAppendDamageSource;                               // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageSourceContainer                 DamageSource;                                      // 0x0088(0x0040)(Edit, NativeAccessSpecifierPublic)
	struct FDamageTags                            DamageTags;                                        // 0x00C8(0x0020)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FGbxInlineStruct>               ConditionalModifiers;                              // 0x00E8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGbxAttributeInit                      ProxyRadius;                                       // 0x00F8(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bTriggerEveryXShots;                               // 0x0148(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      TriggerEveryXShots;                                // 0x0150(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseRandomChance;                                  // 0x01A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      RandomChance;                                      // 0x01A8(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
