#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxWeatherOcclusion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GbxWeatherOcclusion.GbxWeatherOcclusionSubsystem.ReadbackDynamicOcclusionHeightMap
// 0x0040 (0x0040 - 0x0000)
struct GbxWeatherOcclusionSubsystem_ReadbackDynamicOcclusionHeightMap final
{
public:
	class UNiagaraSystem*                         InNiagaraSystem;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InOrigin;                                          // 0x0008(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InSize;                                            // 0x0020(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxWeatherOcclusionSubsystem_ReadbackDynamicOcclusionHeightMap;

// Function GbxWeatherOcclusion.GbxWeatherOcclusionSubsystem.RegisterDynamicOcclusionNS
// 0x0008 (0x0008 - 0x0000)
struct GbxWeatherOcclusionSubsystem_RegisterDynamicOcclusionNS final
{
public:
	class UNiagaraSystem*                         InNiagaraSystem;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxWeatherOcclusionSubsystem_RegisterDynamicOcclusionNS;

// Function GbxWeatherOcclusion.GbxWeatherOcclusionSubsystem.UnregisterDynamicOcclusionNS
// 0x0008 (0x0008 - 0x0000)
struct GbxWeatherOcclusionSubsystem_UnregisterDynamicOcclusionNS final
{
public:
	class UNiagaraSystem*                         InNiagaraSystem;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxWeatherOcclusionSubsystem_UnregisterDynamicOcclusionNS;

// Function GbxWeatherOcclusion.GbxWeatherOcclusionSubsystem.IsOccluded
// 0x0020 (0x0020 - 0x0000)
struct GbxWeatherOcclusionSubsystem_IsOccluded final
{
public:
	struct FVector                                InPosition;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxWeatherOcclusionSubsystem_IsOccluded;

}

