#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxWeapon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxAI_structs.hpp"
#include "GbxGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxWeapon_structs.hpp"


namespace SDK::Params
{

// Function GbxWeapon.GbxWeaponHeldActorFunctionLibrary.AIHeldWeapon_Destroy
// 0x0018 (0x0018 - 0x0000)
struct GbxWeaponHeldActorFunctionLibrary_AIHeldWeapon_Destroy final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GbxWeaponHeldActorFunctionLibrary_AIHeldWeapon_Destroy;

// Function GbxWeapon.GbxWeaponHeldActorFunctionLibrary.AIHeldWeapon_Drop
// 0x0020 (0x0020 - 0x0000)
struct GbxWeaponHeldActorFunctionLibrary_AIHeldWeapon_Drop final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequestNewHeldActor;                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InstigatorOverride;                                // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxWeaponHeldActorFunctionLibrary_AIHeldWeapon_Drop;

// Function GbxWeapon.GbxWeaponHeldActorFunctionLibrary.AIHeldWeapon_GetActors
// 0x0028 (0x0028 - 0x0000)
struct GbxWeaponHeldActorFunctionLibrary_AIHeldWeapon_GetActors final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AWeapon*>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxWeaponHeldActorFunctionLibrary_AIHeldWeapon_GetActors;

// Function GbxWeapon.GbxWeaponHeldActorFunctionLibrary.AIHeldWeapon_Spawn
// 0x0080 (0x0080 - 0x0000)
struct GbxWeaponHeldActorFunctionLibrary_AIHeldWeapon_Spawn final
{
public:
	class AActor*                                 AIActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGbxAIHeldFilterType                          FilterType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryItemSelectionData            WeaponOverride;                                    // 0x0018(0x0068)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GbxWeaponHeldActorFunctionLibrary_AIHeldWeapon_Spawn;

// Function GbxWeapon.Weapon.ClientConsumeAmmo
// 0x0008 (0x0008 - 0x0000)
struct Weapon_ClientConsumeAmmo final
{
public:
	uint8                                         UseModeIndex;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Amount;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ClientConsumeAmmo;

// Function GbxWeapon.Weapon.ClientLock
// 0x0004 (0x0004 - 0x0000)
struct Weapon_ClientLock final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ClientLock;

// Function GbxWeapon.Weapon.ClientRefillAmmo
// 0x0008 (0x0008 - 0x0000)
struct Weapon_ClientRefillAmmo final
{
public:
	uint8                                         UseModeIndex;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Amount;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ClientRefillAmmo;

// Function GbxWeapon.Weapon.ClientSetAmmoState
// 0x000C (0x000C - 0x0000)
struct Weapon_ClientSetAmmoState final
{
public:
	uint8                                         UseModeIndex;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FReplicatedAmmoState                   NewState;                                          // 0x0004(0x0008)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ClientSetAmmoState;

// Function GbxWeapon.Weapon.ClientSetLoadedAmmo
// 0x0008 (0x0008 - 0x0000)
struct Weapon_ClientSetLoadedAmmo final
{
public:
	uint8                                         UseModeIndex;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewLoadedAmmo;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ClientSetLoadedAmmo;

// Function GbxWeapon.Weapon.OnNotifyBodyControlsOfTargetLock
// 0x0010 (0x0010 - 0x0000)
struct Weapon_OnNotifyBodyControlsOfTargetLock final
{
public:
	class AWeapon*                                EventWeapon;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLockedOn;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Weapon_OnNotifyBodyControlsOfTargetLock;

// Function GbxWeapon.Weapon.OnRep_CurrentUseModeIndex
// 0x0001 (0x0001 - 0x0000)
struct Weapon_OnRep_CurrentUseModeIndex final
{
public:
	uint8                                         PreviousUseModeIndex;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_OnRep_CurrentUseModeIndex;

// Function GbxWeapon.Weapon.PlayEffects
// 0x0014 (0x0014 - 0x0000)
struct Weapon_PlayEffects final
{
public:
	class FName                                   type;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UseModeIndex;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ID;                                                // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUntilStopped;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Weapon_PlayEffects;

// Function GbxWeapon.Weapon.ServerInterruptReloadToUse
// 0x0004 (0x0004 - 0x0000)
struct Weapon_ServerInterruptReloadToUse final
{
public:
	int32                                         ClientLoadedAmmo;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerInterruptReloadToUse;

// Function GbxWeapon.Weapon.ServerLock
// 0x0004 (0x0004 - 0x0000)
struct Weapon_ServerLock final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerLock;

// Function GbxWeapon.Weapon.ServerSendAmmoState
// 0x0001 (0x0001 - 0x0000)
struct Weapon_ServerSendAmmoState final
{
public:
	uint8                                         UseModeIndex;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerSendAmmoState;

// Function GbxWeapon.Weapon.ServerSetPatternSeed
// 0x0002 (0x0002 - 0x0000)
struct Weapon_ServerSetPatternSeed final
{
public:
	uint16                                        ClientPatternSeed;                                 // 0x0000(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerSetPatternSeed;

// Function GbxWeapon.Weapon.ServerStartReloading
// 0x0002 (0x0002 - 0x0000)
struct Weapon_ServerStartReloading final
{
public:
	uint8                                         UseModeIndex;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Flags_0;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerStartReloading;

// Function GbxWeapon.Weapon.ServerStartUsing
// 0x0004 (0x0004 - 0x0000)
struct Weapon_ServerStartUsing final
{
public:
	uint8                                         InputChannel;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x1];                                        // 0x0001(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint16                                        ClientPatternSeed;                                 // 0x0002(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerStartUsing;

// Function GbxWeapon.Weapon.ServerStopModeSwitch
// 0x0002 (0x0002 - 0x0000)
struct Weapon_ServerStopModeSwitch final
{
public:
	uint8                                         InputChannel;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ClientUseModeIndex;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerStopModeSwitch;

// Function GbxWeapon.Weapon.ServerStopUsing
// 0x0004 (0x0004 - 0x0000)
struct Weapon_ServerStopUsing final
{
public:
	uint8                                         InputChannel;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForced;                                           // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        SyncData;                                          // 0x0002(0x0002)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerStopUsing;

// Function GbxWeapon.Weapon.ServerSwitchMode
// 0x0004 (0x0004 - 0x0000)
struct Weapon_ServerSwitchMode final
{
public:
	uint8                                         InputChannel;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NextUseModeIndex;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForced;                                           // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         SwitchOption;                                      // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerSwitchMode;

// Function GbxWeapon.Weapon.ServerUpdateFPUseOffet
// 0x0018 (0x0018 - 0x0000)
struct Weapon_ServerUpdateFPUseOffet final
{
public:
	struct FVector_NetQuantize100                 Offset;                                            // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_ServerUpdateFPUseOffet;

// Function GbxWeapon.Weapon.StopAllEffects
// 0x0008 (0x0008 - 0x0000)
struct Weapon_StopAllEffects final
{
public:
	class FName                                   type;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_StopAllEffects;

// Function GbxWeapon.Weapon.StopEffects
// 0x000C (0x000C - 0x0000)
struct Weapon_StopEffects final
{
public:
	class FName                                   type;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UseModeIndex;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyStopLoopingEffects;                           // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Weapon_StopEffects;

// Function GbxWeapon.Weapon.GetTargetLockChannel
// 0x0001 (0x0001 - 0x0000)
struct Weapon_GetTargetLockChannel final
{
public:
	EWeaponTargetLockChannel                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_GetTargetLockChannel;

// Function GbxWeapon.Weapon.IsTargetLocked
// 0x0001 (0x0001 - 0x0000)
struct Weapon_IsTargetLocked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Weapon_IsTargetLocked;

// Function GbxWeapon.WeaponBehavior_Sway.OnZoomed
// 0x0001 (0x0001 - 0x0000)
struct WeaponBehavior_Sway_OnZoomed final
{
public:
	uint8                                         Level;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponBehavior_Sway_OnZoomed;

// Function GbxWeapon.WeaponStatics.ConsumeAmmo
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_ConsumeAmmo final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsPercent;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_ConsumeAmmo;

// Function GbxWeapon.WeaponStatics.GetCurrentDamageType
// 0x0020 (0x0020 - 0x0000)
struct WeaponStatics_GetCurrentDamageType final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGameDataHandleProperty_                      ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_GetCurrentDamageType;

// Function GbxWeapon.WeaponStatics.GetDamageType
// 0x0028 (0x0028 - 0x0000)
struct WeaponStatics_GetDamageType final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UseMode;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_GetDamageType;

// Function GbxWeapon.WeaponStatics.GetEditorBodyActionNames
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_GetEditorBodyActionNames final
{
public:
	TArray<class FName>                           OutNames;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_GetEditorBodyActionNames;

// Function GbxWeapon.WeaponStatics.GetFireRateAccelPercent
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_GetFireRateAccelPercent final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UseMode;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_GetFireRateAccelPercent;

// Function GbxWeapon.WeaponStatics.GetLoadedAmmo
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_GetLoadedAmmo final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UseMode;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_GetLoadedAmmo;

// Function GbxWeapon.WeaponStatics.GetMaxLoadedAmmo
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_GetMaxLoadedAmmo final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         UseMode;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_GetMaxLoadedAmmo;

// Function GbxWeapon.WeaponStatics.GetWeapon
// 0x0018 (0x0018 - 0x0000)
struct WeaponStatics_GetWeapon final
{
public:
	class AActor*                                 WeaponUser;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         slot;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_GetWeapon;

// Function GbxWeapon.WeaponStatics.GetWeaponViewRelativeSocketTransform
// 0x0070 (0x0070 - 0x0000)
struct WeaponStatics_GetWeaponViewRelativeSocketTransform final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_GetWeaponViewRelativeSocketTransform;

// Function GbxWeapon.WeaponStatics.GiveAmmo
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_GiveAmmo final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoaded;                                           // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsPercent;                                        // 0x000D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_GiveAmmo;

// Function GbxWeapon.WeaponStatics.HasPartDependencyTag
// 0x0018 (0x0018 - 0x0000)
struct WeaponStatics_HasPartDependencyTag final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Tag;                                               // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_HasPartDependencyTag;

// Function GbxWeapon.WeaponStatics.HideWeapon
// 0x0018 (0x0018 - 0x0000)
struct WeaponStatics_HideWeapon final
{
public:
	class AActor*                                 WeaponUser;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         slot;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   reason;                                            // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServerAuthority;                                  // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_HideWeapon;

// Function GbxWeapon.WeaponStatics.HideWeapons
// 0x0018 (0x0018 - 0x0000)
struct WeaponStatics_HideWeapons final
{
public:
	class AActor*                                 WeaponUser;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServerAuthority;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_HideWeapons;

// Function GbxWeapon.WeaponStatics.IsLocalWeaponAuthority
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_IsLocalWeaponAuthority final
{
public:
	class AActor*                                 WeaponUser;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_IsLocalWeaponAuthority;

// Function GbxWeapon.WeaponStatics.RefillAmmo
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_RefillAmmo final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsPercent;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_RefillAmmo;

// Function GbxWeapon.WeaponStatics.RefillAmmoForCurrentWeapon
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_RefillAmmoForCurrentWeapon final
{
public:
	class UObject*                                OwnerContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsPercent;                                        // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_RefillAmmoForCurrentWeapon;

// Function GbxWeapon.WeaponStatics.ResetVisibleAmmoState
// 0x0008 (0x0008 - 0x0000)
struct WeaponStatics_ResetVisibleAmmoState final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_ResetVisibleAmmoState;

// Function GbxWeapon.WeaponStatics.RestrictWeapons
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_RestrictWeapons final
{
public:
	class AActor*                                 WeaponUser;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_RestrictWeapons;

// Function GbxWeapon.WeaponStatics.SetVisibleAmmoState
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_SetVisibleAmmoState final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVisibleAmmoState                             NewState;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_SetVisibleAmmoState;

// Function GbxWeapon.WeaponStatics.SetVisibleAmmoUpdateMethod
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_SetVisibleAmmoUpdateMethod final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVisibleAmmoUpdateMethod                      NewUpdateMethod;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_SetVisibleAmmoUpdateMethod;

// Function GbxWeapon.WeaponStatics.ToggleWeaponMode
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_ToggleWeaponMode final
{
public:
	class AActor*                                 WeaponUser;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         slot;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_ToggleWeaponMode;

// Function GbxWeapon.WeaponStatics.UnhideWeapon
// 0x0018 (0x0018 - 0x0000)
struct WeaponStatics_UnhideWeapon final
{
public:
	class AActor*                                 WeaponUser;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         slot;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   reason;                                            // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServerAuthority;                                  // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0015(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_UnhideWeapon;

// Function GbxWeapon.WeaponStatics.UnhideWeapons
// 0x0018 (0x0018 - 0x0000)
struct WeaponStatics_UnhideWeapons final
{
public:
	class AActor*                                 WeaponUser;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServerAuthority;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_UnhideWeapons;

// Function GbxWeapon.WeaponStatics.UnrestrictWeapons
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_UnrestrictWeapons final
{
public:
	class AActor*                                 WeaponUser;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   reason;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponStatics_UnrestrictWeapons;

// Function GbxWeapon.WeaponStatics.UpdateAmmoVisibility
// 0x0010 (0x0010 - 0x0000)
struct WeaponStatics_UpdateAmmoVisibility final
{
public:
	class AWeapon*                                Weapon;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForce;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponStatics_UpdateAmmoVisibility;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.AddTargetLock
// 0x0060 (0x0060 - 0x0000)
struct WeaponTargetLockFunctionLibrary_AddTargetLock final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponTargetLockChannel                      channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 target;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   socket;                                            // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      Effect;                                            // 0x0040(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRelativeOffset;                                   // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bServerAuthority;                                  // 0x0059(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x005C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_AddTargetLock;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.DoesSourceHaveLockOnTarget
// 0x0020 (0x0020 - 0x0000)
struct WeaponTargetLockFunctionLibrary_DoesSourceHaveLockOnTarget final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponTargetLockChannel                      channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 target;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_DoesSourceHaveLockOnTarget;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.GetRandomTargetLock
// 0x0058 (0x0058 - 0x0000)
struct WeaponTargetLockFunctionLibrary_GetRandomTargetLock final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponTargetLockChannel                      channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeaponTargetLockResult                Result;                                            // 0x0010(0x0040)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_GetRandomTargetLock;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.GetTargetLockList
// 0x0020 (0x0020 - 0x0000)
struct WeaponTargetLockFunctionLibrary_GetTargetLockList final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponTargetLockChannel                      channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWeaponTargetLockResult>        ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_GetTargetLockList;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.HasTargetLock
// 0x0010 (0x0010 - 0x0000)
struct WeaponTargetLockFunctionLibrary_HasTargetLock final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponTargetLockChannel                      channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_HasTargetLock;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.NumTargetLocks
// 0x0010 (0x0010 - 0x0000)
struct WeaponTargetLockFunctionLibrary_NumTargetLocks final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponTargetLockChannel                      channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_NumTargetLocks;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.RemoveAllTargetLocks
// 0x0008 (0x0008 - 0x0000)
struct WeaponTargetLockFunctionLibrary_RemoveAllTargetLocks final
{
public:
	class AActor*                                 target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_RemoveAllTargetLocks;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.RemoveAllTargetLocksForSource
// 0x0008 (0x0008 - 0x0000)
struct WeaponTargetLockFunctionLibrary_RemoveAllTargetLocksForSource final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_RemoveAllTargetLocksForSource;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.RemoveAllTargetLocksForSourceChannel
// 0x0010 (0x0010 - 0x0000)
struct WeaponTargetLockFunctionLibrary_RemoveAllTargetLocksForSourceChannel final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponTargetLockChannel                      channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_RemoveAllTargetLocksForSourceChannel;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.RemoveTargetLock
// 0x0010 (0x0010 - 0x0000)
struct WeaponTargetLockFunctionLibrary_RemoveTargetLock final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LockId;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_RemoveTargetLock;

// Function GbxWeapon.WeaponTargetLockFunctionLibrary.RemoveTargetLocksBetweenSourceAndTarget
// 0x0018 (0x0018 - 0x0000)
struct WeaponTargetLockFunctionLibrary_RemoveTargetLocksBetweenSourceAndTarget final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWeaponTargetLockChannel                      channel;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 target;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WeaponTargetLockFunctionLibrary_RemoveTargetLocksBetweenSourceAndTarget;

}

