#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GbxWorldPainter

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "GbxWorldPainter_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class GbxWorldPainter.GbxWorldPainterActor
// 0x0048 (0x03D8 - 0x0390)
class AGbxWorldPainterActor : public AInfo
{
public:
	uint8                                         Pad_390[0x40];                                     // 0x0390(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxWorldPainterLayerData*              LayerData;                                         // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxWorldPainterActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxWorldPainterActor")
	}
	static class AGbxWorldPainterActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxWorldPainterActor>();
	}
};
DUMPER7_ASSERTS_AGbxWorldPainterActor;

// Class GbxWorldPainter.GbxWorldPainterLayer
// 0x0030 (0x0060 - 0x0030)
class UGbxWorldPainterLayer : public UDataAsset
{
public:
	float                                         CellSize;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMutuallyExclusive;                                // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGbxWorldPainterOption>         options;                                           // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                          bIsEditorOnly;                                     // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0050(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialParameterCollection*           MaterialParameterCollection;                       // 0x0058(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxWorldPainterLayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxWorldPainterLayer")
	}
	static class UGbxWorldPainterLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxWorldPainterLayer>();
	}
};
DUMPER7_ASSERTS_UGbxWorldPainterLayer;

// Class GbxWorldPainter.GbxWorldPainterLayerData
// 0x0058 (0x0080 - 0x0028)
class UGbxWorldPainterLayerData final : public UObject
{
public:
	class UGbxWorldPainterLayer*                  layer;                                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              MinBounds;                                         // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              MaxBounds;                                         // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CellSize;                                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SizeX;                                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         SizeY;                                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 data;                                              // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FGbxWorldPainterOption>         options;                                           // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxWorldPainterLayerData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxWorldPainterLayerData")
	}
	static class UGbxWorldPainterLayerData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxWorldPainterLayerData>();
	}
};
DUMPER7_ASSERTS_UGbxWorldPainterLayerData;

// Class GbxWorldPainter.GbxWorldPainterVolume
// 0x0008 (0x0398 - 0x0390)
class AGbxWorldPainterVolume final : public AActor
{
public:
	class UGbxWorldPainterBoxComponent*           BoxComponent;                                      // 0x0390(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxWorldPainterVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxWorldPainterVolume")
	}
	static class AGbxWorldPainterVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGbxWorldPainterVolume>();
	}
};
DUMPER7_ASSERTS_AGbxWorldPainterVolume;

// Class GbxWorldPainter.GbxWorldPainterBoxComponent
// 0x0040 (0x0670 - 0x0630)
class UGbxWorldPainterBoxComponent final : public UBoxComponent
{
public:
	uint8                                         Pad_630[0x20];                                     // 0x0630(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxWorldPainterLayer*                  PaintLayer;                                        // 0x0650(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PaintOption;                                       // 0x0658(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         PaintPriority;                                     // 0x0660(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         PaintOptionIdx;                                    // 0x0664(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FColor                                 PaintOptionColor;                                  // 0x0668(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetEditOptionNames(TArray<class FName>* OutNames) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxWorldPainterBoxComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxWorldPainterBoxComponent")
	}
	static class UGbxWorldPainterBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxWorldPainterBoxComponent>();
	}
};
DUMPER7_ASSERTS_UGbxWorldPainterBoxComponent;

}

