#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelViewViewModel

#include "Basic.hpp"

#include "FieldNotification_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ModelViewViewModel_structs.hpp"


namespace SDK::Params
{

// Function ModelViewViewModel.MVVMConversionLibrary.Conv_BoolToSlateVisibility
// 0x0004 (0x0004 - 0x0000)
struct MVVMConversionLibrary_Conv_BoolToSlateVisibility final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              TrueVisibility;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              FalseVisibility;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              ReturnValue;                                       // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMConversionLibrary_Conv_BoolToSlateVisibility;

// Function ModelViewViewModel.MVVMSlateBrushConversionLibrary.Conv_SetScalarParameter
// 0x0170 (0x0170 - 0x0000)
struct MVVMSlateBrushConversionLibrary_Conv_SetScalarParameter final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x00B8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ReturnValue;                                       // 0x00C0(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMSlateBrushConversionLibrary_Conv_SetScalarParameter;

// Function ModelViewViewModel.MVVMSlateBrushConversionLibrary.Conv_SetScalarParameterMID
// 0x0180 (0x0180 - 0x0000)
struct MVVMSlateBrushConversionLibrary_Conv_SetScalarParameterMID final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x00B0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x00B8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x00C0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0xC];                                       // 0x00C4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ReturnValue;                                       // 0x00D0(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMSlateBrushConversionLibrary_Conv_SetScalarParameterMID;

// Function ModelViewViewModel.MVVMSlateBrushConversionLibrary.Conv_SetTextureParameter
// 0x0170 (0x0170 - 0x0000)
struct MVVMSlateBrushConversionLibrary_Conv_SetTextureParameter final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Value;                                             // 0x00B8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ReturnValue;                                       // 0x00C0(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMSlateBrushConversionLibrary_Conv_SetTextureParameter;

// Function ModelViewViewModel.MVVMSlateBrushConversionLibrary.Conv_SetTextureParameterMID
// 0x0180 (0x0180 - 0x0000)
struct MVVMSlateBrushConversionLibrary_Conv_SetTextureParameterMID final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x00B0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x00B8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Value;                                             // 0x00C0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ReturnValue;                                       // 0x00D0(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMSlateBrushConversionLibrary_Conv_SetTextureParameterMID;

// Function ModelViewViewModel.MVVMSlateBrushConversionLibrary.Conv_SetVectorParameter
// 0x0180 (0x0180 - 0x0000)
struct MVVMSlateBrushConversionLibrary_Conv_SetVectorParameter final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x00B0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x00B8(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ReturnValue;                                       // 0x00D0(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMSlateBrushConversionLibrary_Conv_SetVectorParameter;

// Function ModelViewViewModel.MVVMSlateBrushConversionLibrary.Conv_SetVectorParameterMID
// 0x0180 (0x0180 - 0x0000)
struct MVVMSlateBrushConversionLibrary_Conv_SetVectorParameterMID final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00B0)(Parm, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Material;                                          // 0x00B0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParameterName;                                     // 0x00B8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x00C0(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ReturnValue;                                       // 0x00D0(0x00B0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMSlateBrushConversionLibrary_Conv_SetVectorParameterMID;

// Function ModelViewViewModel.MVVMGameSubsystem.GetViewModelCollection
// 0x0008 (0x0008 - 0x0000)
struct MVVMGameSubsystem_GetViewModelCollection final
{
public:
	class UMVVMViewModelCollectionObject*         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMGameSubsystem_GetViewModelCollection;

// Function ModelViewViewModel.MVVMView.ExecuteViewModelBindings
// 0x000C (0x000C - 0x0000)
struct MVVMView_ExecuteViewModelBindings final
{
public:
	class FName                                   ViewModelName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMView_ExecuteViewModelBindings;

// Function ModelViewViewModel.MVVMView.SetViewModel
// 0x0020 (0x0020 - 0x0000)
struct MVVMView_SetViewModel final
{
public:
	class FName                                   ViewModelName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class INotifyFieldValueChanged> ViewModel;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMView_SetViewModel;

// Function ModelViewViewModel.MVVMView.SetViewModelByClass
// 0x0018 (0x0018 - 0x0000)
struct MVVMView_SetViewModelByClass final
{
public:
	TScriptInterface<class INotifyFieldValueChanged> NewValue;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMView_SetViewModelByClass;

// Function ModelViewViewModel.MVVMView.AreBindingsInitialized
// 0x0001 (0x0001 - 0x0000)
struct MVVMView_AreBindingsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMView_AreBindingsInitialized;

// Function ModelViewViewModel.MVVMView.AreEventsInitialized
// 0x0001 (0x0001 - 0x0000)
struct MVVMView_AreEventsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMView_AreEventsInitialized;

// Function ModelViewViewModel.MVVMView.AreSourcesInitialized
// 0x0001 (0x0001 - 0x0000)
struct MVVMView_AreSourcesInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMView_AreSourcesInitialized;

// Function ModelViewViewModel.MVVMView.AreSourcesValidForBinding
// 0x0008 (0x0008 - 0x0000)
struct MVVMView_AreSourcesValidForBinding final
{
public:
	int32                                         BindingKey;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMView_AreSourcesValidForBinding;

// Function ModelViewViewModel.MVVMView.AreSourcesValidForEvent
// 0x0008 (0x0008 - 0x0000)
struct MVVMView_AreSourcesValidForEvent final
{
public:
	int32                                         EventKey;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMView_AreSourcesValidForEvent;

// Function ModelViewViewModel.MVVMView.GetViewModel
// 0x0018 (0x0018 - 0x0000)
struct MVVMView_GetViewModel final
{
public:
	class FName                                   ViewModelName;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class INotifyFieldValueChanged> ReturnValue;                                    // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMView_GetViewModel;

// Function ModelViewViewModel.MVVMPanelWidgetViewExtension.BP_SetItems
// 0x0010 (0x0010 - 0x0000)
struct MVVMPanelWidgetViewExtension_BP_SetItems final
{
public:
	TArray<class UObject*>                        InItems;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMPanelWidgetViewExtension_BP_SetItems;

// Function ModelViewViewModel.MVVMSubsystem.K2_CompareFloatValues
// 0x0014 (0x0014 - 0x0000)
struct MVVMSubsystem_K2_CompareFloatValues final
{
public:
	EMVVMConditionOperation                       Operation;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CompareValue;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CompareMaxValue;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMSubsystem_K2_CompareFloatValues;

// Function ModelViewViewModel.MVVMSubsystem.DoesWidgetTreeContainedWidget
// 0x0018 (0x0018 - 0x0000)
struct MVVMSubsystem_DoesWidgetTreeContainedWidget final
{
public:
	const class UWidgetTree*                      WidgetTree;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UWidget*                          ViewWidget;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMSubsystem_DoesWidgetTreeContainedWidget;

// Function ModelViewViewModel.MVVMSubsystem.GetGlobalViewModelCollection
// 0x0008 (0x0008 - 0x0000)
struct MVVMSubsystem_GetGlobalViewModelCollection final
{
public:
	class UMVVMViewModelCollectionObject*         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMSubsystem_GetGlobalViewModelCollection;

// Function ModelViewViewModel.MVVMSubsystem.K2_GetAvailableBinding
// 0x0028 (0x0028 - 0x0000)
struct MVVMSubsystem_K2_GetAvailableBinding final
{
public:
	const class UClass*                           Class_0;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMVVMBindingName                       BindingName;                                       // 0x0008(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UClass*                           Accessor;                                          // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMVVMAvailableBinding                  ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMSubsystem_K2_GetAvailableBinding;

// Function ModelViewViewModel.MVVMSubsystem.K2_GetAvailableBindings
// 0x0020 (0x0020 - 0x0000)
struct MVVMSubsystem_K2_GetAvailableBindings final
{
public:
	const class UClass*                           Class_0;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UClass*                           Accessor;                                          // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMVVMAvailableBinding>          ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMSubsystem_K2_GetAvailableBindings;

// Function ModelViewViewModel.MVVMSubsystem.K2_GetViewFromUserWidget
// 0x0010 (0x0010 - 0x0000)
struct MVVMSubsystem_K2_GetViewFromUserWidget final
{
public:
	const class UUserWidget*                      UserWidget;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMView*                              ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMSubsystem_K2_GetViewFromUserWidget;

// Function ModelViewViewModel.MVVMViewModelBase.K2_AddFieldValueChangedDelegate
// 0x0018 (0x0018 - 0x0000)
struct MVVMViewModelBase_K2_AddFieldValueChangedDelegate final
{
public:
	struct FFieldNotificationId                   FieldId;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> Delegate;       // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMViewModelBase_K2_AddFieldValueChangedDelegate;

// Function ModelViewViewModel.MVVMViewModelBase.K2_BroadcastFieldValueChanged
// 0x0008 (0x0008 - 0x0000)
struct MVVMViewModelBase_K2_BroadcastFieldValueChanged final
{
public:
	struct FFieldNotificationId                   FieldId;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMViewModelBase_K2_BroadcastFieldValueChanged;

// Function ModelViewViewModel.MVVMViewModelBase.K2_RemoveFieldValueChangedDelegate
// 0x0018 (0x0018 - 0x0000)
struct MVVMViewModelBase_K2_RemoveFieldValueChangedDelegate final
{
public:
	struct FFieldNotificationId                   FieldId;                                           // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Object, const struct FFieldNotificationId& Field)> Delegate;       // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMViewModelBase_K2_RemoveFieldValueChangedDelegate;

// Function ModelViewViewModel.MVVMViewModelBase.K2_SetPropertyValue
// 0x000C (0x000C - 0x0000)
struct MVVMViewModelBase_K2_SetPropertyValue final
{
public:
	int32                                         OldValue;                                          // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewValue;                                          // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMViewModelBase_K2_SetPropertyValue;

// Function ModelViewViewModel.MVVMViewModelCollectionObject.AddViewModelInstance
// 0x0020 (0x0020 - 0x0000)
struct MVVMViewModelCollectionObject_AddViewModelInstance final
{
public:
	struct FMVVMViewModelContext                  Context;                                           // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UMVVMViewModelBase*                     ViewModel;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMViewModelCollectionObject_AddViewModelInstance;

// Function ModelViewViewModel.MVVMViewModelCollectionObject.RemoveAllViewModelInstance
// 0x0010 (0x0010 - 0x0000)
struct MVVMViewModelCollectionObject_RemoveAllViewModelInstance final
{
public:
	class UMVVMViewModelBase*                     ViewModel;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMViewModelCollectionObject_RemoveAllViewModelInstance;

// Function ModelViewViewModel.MVVMViewModelCollectionObject.RemoveViewModel
// 0x0018 (0x0018 - 0x0000)
struct MVVMViewModelCollectionObject_RemoveViewModel final
{
public:
	struct FMVVMViewModelContext                  Context;                                           // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MVVMViewModelCollectionObject_RemoveViewModel;

// Function ModelViewViewModel.MVVMViewModelCollectionObject.FindFirstViewModelInstanceOfType
// 0x0010 (0x0010 - 0x0000)
struct MVVMViewModelCollectionObject_FindFirstViewModelInstanceOfType final
{
public:
	TSubclassOf<class UMVVMViewModelBase>         ViewModelClass;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMVVMViewModelBase*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMViewModelCollectionObject_FindFirstViewModelInstanceOfType;

// Function ModelViewViewModel.MVVMViewModelCollectionObject.FindViewModelInstance
// 0x0018 (0x0018 - 0x0000)
struct MVVMViewModelCollectionObject_FindViewModelInstance final
{
public:
	struct FMVVMViewModelContext                  Context;                                           // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UMVVMViewModelBase*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMViewModelCollectionObject_FindViewModelInstance;

// Function ModelViewViewModel.MVVMViewModelContextResolver.K2_CreateInstance
// 0x0020 (0x0020 - 0x0000)
struct MVVMViewModelContextResolver_K2_CreateInstance final
{
public:
	const class UClass*                           ExpectedType;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UUserWidget*                      UserWidget;                                        // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TScriptInterface<class INotifyFieldValueChanged> ReturnValue;                                    // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMViewModelContextResolver_K2_CreateInstance;

// Function ModelViewViewModel.MVVMViewModelContextResolver.K2_DestroyInstance
// 0x0010 (0x0010 - 0x0000)
struct MVVMViewModelContextResolver_K2_DestroyInstance final
{
public:
	const class UObject*                          ViewModel;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UMVVMView*                        View;                                              // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MVVMViewModelContextResolver_K2_DestroyInstance;

}

