#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakGame

#include "Basic.hpp"

#include "GbxOnline_structs.hpp"
#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxAI_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxWeapon_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GbxAudio_structs.hpp"


namespace SDK::Params
{

// Function OakGame.AITargetLockBlueprintLibrary.AbortTargetLock
// 0x0008 (0x0008 - 0x0000)
struct AITargetLockBlueprintLibrary_AbortTargetLock final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITargetLockBlueprintLibrary_AbortTargetLock;

// Function OakGame.AITargetLockBlueprintLibrary.ApplyTargetLock
// 0x0018 (0x0018 - 0x0000)
struct AITargetLockBlueprintLibrary_ApplyTargetLock final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timer;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AITargetLockBlueprintLibrary_ApplyTargetLock;

// Function OakGame.AITargetLockBlueprintLibrary.GetLockedTarget
// 0x0010 (0x0010 - 0x0000)
struct AITargetLockBlueprintLibrary_GetLockedTarget final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITargetLockBlueprintLibrary_GetLockedTarget;

// Function OakGame.AITargetLockBlueprintLibrary.IsTargetLocked
// 0x0010 (0x0010 - 0x0000)
struct AITargetLockBlueprintLibrary_IsTargetLocked final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AITargetLockBlueprintLibrary_IsTargetLocked;

// Function OakGame.OakInteractiveObject.OnActorOverlap
// 0x0010 (0x0010 - 0x0000)
struct OakInteractiveObject_OnActorOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakInteractiveObject_OnActorOverlap;

// Function OakGame.OakInteractiveObject.SetGrappleableEnabled
// 0x0001 (0x0001 - 0x0000)
struct OakInteractiveObject_SetGrappleableEnabled final
{
public:
	bool                                          bNewIsEnabled;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakInteractiveObject_SetGrappleableEnabled;

// Function OakGame.OakInteractiveObject.IsGrappleableEnabled
// 0x0001 (0x0001 - 0x0000)
struct OakInteractiveObject_IsGrappleableEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakInteractiveObject_IsGrappleableEnabled;

// Function OakGame.OakZoneTransition.OnZoneBeginOverlap
// 0x0120 (0x0120 - 0x0000)
struct OakZoneTransition_OnZoneBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakZoneTransition_OnZoneBeginOverlap;

// Function OakGame.OakZoneTransition.OnZoneEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct OakZoneTransition_OnZoneEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OakZoneTransition_OnZoneEndOverlap;

// Function OakGame.OakZoneTransition.GetTransitionEntryGate
// 0x0001 (0x0001 - 0x0000)
struct OakZoneTransition_GetTransitionEntryGate final
{
public:
	EOakZoneTransitionGate                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakZoneTransition_GetTransitionEntryGate;

// Function OakGame.OakAirlockTransition.PrepareZoneTransition
// 0x0008 (0x0008 - 0x0000)
struct OakAirlockTransition_PrepareZoneTransition final
{
public:
	class AOakPlayerController*                   Controller;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakAirlockTransition_PrepareZoneTransition;

// Function OakGame.LootableObject.OnComponentSleep
// 0x0010 (0x0010 - 0x0000)
struct LootableObject_OnComponentSleep final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootableObject_OnComponentSleep;

// Function OakGame.LootableObject.OnMeshCollision
// 0x0130 (0x0130 - 0x0000)
struct LootableObject_OnMeshCollision final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootableObject_OnMeshCollision;

// Function OakGame.LootableObject.OnMeshPhysicsStateChanged
// 0x0010 (0x0010 - 0x0000)
struct LootableObject_OnMeshPhysicsStateChanged final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentPhysicsStateChange                  StateChange;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootableObject_OnMeshPhysicsStateChanged;

// Function OakGame.NexusConfigStoreUISpecializations.GetAllProgressGraphGroupDefs
// 0x0010 (0x0010 - 0x0000)
struct NexusConfigStoreUISpecializations_GetAllProgressGraphGroupDefs final
{
public:
	TArray<FGbxDefPtrProperty_>                   graphs;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusConfigStoreUISpecializations_GetAllProgressGraphGroupDefs;

// Function OakGame.NexusConfigStoreUISpecializations.GetNodeNames
// 0x0030 (0x0030 - 0x0000)
struct NexusConfigStoreUISpecializations_GetNodeNames final
{
public:
	class UObject*                                EditObject;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           ProgressGraph;                                     // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           OutNames;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NexusConfigStoreUISpecializations_GetNodeNames;

// Function OakGame.BioArmorStatics.HasBioArmor
// 0x0010 (0x0010 - 0x0000)
struct BioArmorStatics_HasBioArmor final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BioArmorStatics_HasBioArmor;

// Function OakGame.BioArmorStatics.IsBioArmorActive
// 0x0010 (0x0010 - 0x0000)
struct BioArmorStatics_IsBioArmorActive final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BioArmorStatics_IsBioArmorActive;

// Function OakGame.BioArmorStatics.TryActivateBioArmor
// 0x0010 (0x0010 - 0x0000)
struct BioArmorStatics_TryActivateBioArmor final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInstantaneous;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BioArmorStatics_TryActivateBioArmor;

// Function OakGame.BioArmorStatics.TryDeactivateBioArmor
// 0x0010 (0x0010 - 0x0000)
struct BioArmorStatics_TryDeactivateBioArmor final
{
public:
	class AActor*                                 Context;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BioArmorStatics_TryDeactivateBioArmor;

// Function OakGame.BlueprintableCameraModeTransition.EndTransition
// 0x0008 (0x0008 - 0x0000)
struct BlueprintableCameraModeTransition_EndTransition final
{
public:
	class UCameraModeState*                       State;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BlueprintableCameraModeTransition_EndTransition;

// Function OakGame.BlueprintableCameraModeTransition.PostUpdatePOV
// 0x2920 (0x2920 - 0x0000)
struct BlueprintableCameraModeTransition_PostUpdatePOV final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraModeState*                       State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       InPOV;                                             // 0x0010(0x0A20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPOV                                   InViewModelPOV;                                    // 0x0A30(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A68[0x8];                                      // 0x0A68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimalViewInfo                       InBlendDelta;                                      // 0x0A70(0x0A20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       OutPOV;                                            // 0x1490(0x0A20)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FPOV                                   OutViewModelPOV;                                   // 0x1EB0(0x0038)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EE8[0x8];                                     // 0x1EE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimalViewInfo                       OutBlendDelta;                                     // 0x1EF0(0x0A20)(Parm, OutParm, NativeAccessSpecifierPublic)
	float                                         BlendPct;                                          // 0x2910(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2914[0xC];                                     // 0x2914(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintableCameraModeTransition_PostUpdatePOV;

// Function OakGame.BlueprintableCameraModeTransition.PreUpdatePOV
// 0x2920 (0x2920 - 0x0000)
struct BlueprintableCameraModeTransition_PreUpdatePOV final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraModeState*                       State;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       InPOV;                                             // 0x0010(0x0A20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPOV                                   InViewModelPOV;                                    // 0x0A30(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A68[0x8];                                      // 0x0A68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimalViewInfo                       InBlendDelta;                                      // 0x0A70(0x0A20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       OutPOV;                                            // 0x1490(0x0A20)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FPOV                                   OutViewModelPOV;                                   // 0x1EB0(0x0038)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1EE8[0x8];                                     // 0x1EE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimalViewInfo                       OutBlendDelta;                                     // 0x1EF0(0x0A20)(Parm, OutParm, NativeAccessSpecifierPublic)
	float                                         BlendPct;                                          // 0x2910(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x2914(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2915[0xB];                                     // 0x2915(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintableCameraModeTransition_PreUpdatePOV;

// Function OakGame.BlueprintableCameraModeTransition.StartTransition
// 0x0A80 (0x0A80 - 0x0000)
struct BlueprintableCameraModeTransition_StartTransition final
{
public:
	class UCameraModeState*                       State;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PreviousModeName;                                  // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMinimalViewInfo                       PreviousPOV;                                       // 0x0010(0x0A20)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FPOV                                   PreviousViewModelPOV;                              // 0x0A30(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bWasUsingViewModel;                                // 0x0A68(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A69[0x3];                                      // 0x0A69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InBlendTimeOverride;                               // 0x0A6C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutBlendTimeOverride;                              // 0x0A70(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A74[0xC];                                      // 0x0A74(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BlueprintableCameraModeTransition_StartTransition;

// Function OakGame.CarryableObject.OnComponentSleep
// 0x0010 (0x0010 - 0x0000)
struct CarryableObject_OnComponentSleep final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CarryableObject_OnComponentSleep;

// Function OakGame.CarryableObject.OnComponentWake
// 0x0010 (0x0010 - 0x0000)
struct CarryableObject_OnComponentWake final
{
public:
	class UPrimitiveComponent*                    SleepingComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CarryableObject_OnComponentWake;

// Function OakGame.CarryableObject.OnMeshCollision
// 0x0130 (0x0130 - 0x0000)
struct CarryableObject_OnMeshCollision final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CarryableObject_OnMeshCollision;

// Function OakGame.CarryableObject.OnRep_CarryablePhysicsState
// 0x0003 (0x0003 - 0x0000)
struct CarryableObject_OnRep_CarryablePhysicsState final
{
public:
	struct FCarryablePhysicsState                 PreviousPhysicsState;                              // 0x0000(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CarryableObject_OnRep_CarryablePhysicsState;

// Function OakGame.CarryableObjectContainer.OnContainerBeginOverlap
// 0x0120 (0x0120 - 0x0000)
struct CarryableObjectContainer_OnContainerBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CarryableObjectContainer_OnContainerBeginOverlap;

// Function OakGame.CarryableObjectContainer.OnContainerEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct CarryableObjectContainer_OnContainerEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CarryableObjectContainer_OnContainerEndOverlap;

// Function OakGame.CarryableObjectContainer.SetContainerEnabled
// 0x0001 (0x0001 - 0x0000)
struct CarryableObjectContainer_SetContainerEnabled final
{
public:
	bool                                          bNewEnabled;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CarryableObjectContainer_SetContainerEnabled;

// Function OakGame.OakWeapon.ClientReduceWear
// 0x0008 (0x0008 - 0x0000)
struct OakWeapon_ClientReduceWear final
{
public:
	uint8                                         UseModeIndex;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Percent;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakWeapon_ClientReduceWear;

// Function OakGame.OakWeapon.ServerSetCommandRingTarget
// 0x0040 (0x0040 - 0x0000)
struct OakWeapon_ServerSetCommandRingTarget final
{
public:
	struct FCommandRingTarget                     target;                                            // 0x0000(0x0040)(ConstParm, Parm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakWeapon_ServerSetCommandRingTarget;

// Function OakGame.OakWeapon.GetChargePercent
// 0x0004 (0x0004 - 0x0000)
struct OakWeapon_GetChargePercent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakWeapon_GetChargePercent;

// Function OakGame.OakWeapon.GetPartValue
// 0x0008 (0x0008 - 0x0000)
struct OakWeapon_GetPartValue final
{
public:
	EWeaponPartValue                              type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakWeapon_GetPartValue;

// Function OakGame.CarryableObjectDispenser.IsDispenserActive
// 0x0001 (0x0001 - 0x0000)
struct CarryableObjectDispenser_IsDispenserActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CarryableObjectDispenser_IsDispenserActive;

// Function OakGame.InventoryItemBlueprintLibrary.GetSummary_InventoryItemSelectionData
// 0x0078 (0x0078 - 0x0000)
struct InventoryItemBlueprintLibrary_GetSummary_InventoryItemSelectionData final
{
public:
	struct FInventoryItemSelectionData            data;                                              // 0x0000(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0068(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryItemBlueprintLibrary_GetSummary_InventoryItemSelectionData;

// Function OakGame.CarryableObjectStatics.ActorForceDropCarriedObject
// 0x0010 (0x0010 - 0x0000)
struct CarryableObjectStatics_ActorForceDropCarriedObject final
{
public:
	class AActor*                                 TargetCarrier;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CarryableObjectStatics_ActorForceDropCarriedObject;

// Function OakGame.CarryableObjectStatics.ForceActorCarryObject
// 0x0010 (0x0010 - 0x0000)
struct CarryableObjectStatics_ForceActorCarryObject final
{
public:
	class AActor*                                 TargetCarrier;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetCarryable;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CarryableObjectStatics_ForceActorCarryObject;

// Function OakGame.CarryableObjectStatics.ForceDropCarriedObject
// 0x0018 (0x0018 - 0x0000)
struct CarryableObjectStatics_ForceDropCarriedObject final
{
public:
	TScriptInterface<class ICarrier>              TargetCarrier;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CarryableObjectStatics_ForceDropCarriedObject;

// Function OakGame.CarryableObjectStatics.GetCarriedActor
// 0x0010 (0x0010 - 0x0000)
struct CarryableObjectStatics_GetCarriedActor final
{
public:
	class AActor*                                 TargetCarrier;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CarryableObjectStatics_GetCarriedActor;

// Function OakGame.CarryableObjectStatics.IsActorCarryingObject
// 0x0010 (0x0010 - 0x0000)
struct CarryableObjectStatics_IsActorCarryingObject final
{
public:
	class AActor*                                 TargetCarrier;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CarryableObjectStatics_IsActorCarryingObject;

// Function OakGame.CarryableObjectStatics.SetCarryAbilityLock
// 0x0018 (0x0018 - 0x0000)
struct CarryableObjectStatics_SetCarryAbilityLock final
{
public:
	class AActor*                                 TargetCarrier;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocked;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   reason;                                            // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CarryableObjectStatics_SetCarryAbilityLock;

// Function OakGame.OakEcho4Statics.CanEcho4BeInterrupted
// 0x0010 (0x0010 - 0x0000)
struct OakEcho4Statics_CanEcho4BeInterrupted final
{
public:
	class AOakCharacter*                          DroneOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OakEcho4Statics_CanEcho4BeInterrupted;

// Function OakGame.OakEcho4Statics.CanEcho4Deploy
// 0x0010 (0x0010 - 0x0000)
struct OakEcho4Statics_CanEcho4Deploy final
{
public:
	class AOakCharacter*                          DroneOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OakEcho4Statics_CanEcho4Deploy;

// Function OakGame.OakEcho4Statics.DeployEcho4AtLocationLatent
// 0x0068 (0x0068 - 0x0000)
struct OakEcho4Statics_DeployEcho4AtLocationLatent final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Echo4DeployCooldown;                               // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          DroneOwner;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOakDrone*                              projectile;                                        // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0030(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseOverrideRotation;                              // 0x0048(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OverrideRotation;                                  // 0x0050(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakEcho4Statics_DeployEcho4AtLocationLatent;

// Function OakGame.OakEcho4Statics.DeployEcho4Latent
// 0x00B8 (0x00B8 - 0x0000)
struct OakEcho4Statics_DeployEcho4Latent final
{
public:
	struct FGbxRelativeLocation                   LocationOptions;                                   // 0x0000(0x0060)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Echo4DeployCooldown;                               // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          DroneOwner;                                        // 0x0068(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOakDrone*                              projectile;                                        // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0078(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseOverrideRotation;                              // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OverrideRotation;                                  // 0x0098(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 OverrideActor;                                     // 0x00B0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakEcho4Statics_DeployEcho4Latent;

// Function OakGame.OakEcho4Statics.DeployEcho4WithDefLatent
// 0x00D0 (0x00D0 - 0x0000)
struct OakEcho4Statics_DeployEcho4WithDefLatent final
{
public:
	FGbxDefPtrProperty_                           DroneDef;                                          // 0x0000(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxRelativeLocation                   LocationOptions;                                   // 0x0018(0x0060)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Echo4DeployCooldown;                               // 0x0078(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          DroneOwner;                                        // 0x0080(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOakDrone*                              projectile;                                        // 0x0088(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0090(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUseOverrideRotation;                              // 0x00A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               OverrideRotation;                                  // 0x00B0(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 OverrideActor;                                     // 0x00C8(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakEcho4Statics_DeployEcho4WithDefLatent;

// Function OakGame.OakEcho4Statics.FlyToActor
// 0x0020 (0x0020 - 0x0000)
struct OakEcho4Statics_FlyToActor final
{
public:
	class AOakDrone*                              OakDrone;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 MoveActor;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DroneSpeed;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DroneAccelerationTime;                             // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopFlyAtTargetDisance;                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OakEcho4Statics_FlyToActor;

// Function OakGame.OakEcho4Statics.FlyToLocation
// 0x0030 (0x0030 - 0x0000)
struct OakEcho4Statics_FlyToLocation final
{
public:
	class AOakDrone*                              OakDrone;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MoveLocation;                                      // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DroneSpeed;                                        // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DroneAccelerationTime;                             // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopFlyAtTargetDisance;                            // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OakEcho4Statics_FlyToLocation;

// Function OakGame.OakEcho4Statics.GetEcho4ActorScript
// 0x0010 (0x0010 - 0x0000)
struct OakEcho4Statics_GetEcho4ActorScript final
{
public:
	class AOakDrone*                              OakDrone;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOakActorScript_Echo4*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakEcho4Statics_GetEcho4ActorScript;

// Function OakGame.OakEcho4Statics.GetEcho4Drone
// 0x0010 (0x0010 - 0x0000)
struct OakEcho4Statics_GetEcho4Drone final
{
public:
	class AOakCharacter*                          DroneOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOakDrone*                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakEcho4Statics_GetEcho4Drone;

// Function OakGame.OakEcho4Statics.IsEcho4Deployed
// 0x0010 (0x0010 - 0x0000)
struct OakEcho4Statics_IsEcho4Deployed final
{
public:
	class AOakCharacter*                          DroneOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OakEcho4Statics_IsEcho4Deployed;

// Function OakGame.OakEcho4Statics.NotifyEchoLocationAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct OakEcho4Statics_NotifyEchoLocationAnimFinished final
{
public:
	class AOakDrone*                              OakDrone;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakEcho4Statics_NotifyEchoLocationAnimFinished;

// Function OakGame.OakEcho4Statics.RetrieveEcho4
// 0x0008 (0x0008 - 0x0000)
struct OakEcho4Statics_RetrieveEcho4 final
{
public:
	class AOakCharacter*                          DroneOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakEcho4Statics_RetrieveEcho4;

// Function OakGame.OakEcho4Statics.SetEcho4DeploymentLocked
// 0x0010 (0x0010 - 0x0000)
struct OakEcho4Statics_SetEcho4DeploymentLocked final
{
public:
	class AOakCharacter*                          DroneOwner;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InLock;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OakEcho4Statics_SetEcho4DeploymentLocked;

// Function OakGame.OakEcho4Statics.WasWaypointPathFound
// 0x0010 (0x0010 - 0x0000)
struct OakEcho4Statics_WasWaypointPathFound final
{
public:
	class AActor*                                 DroneOrOwner;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OakEcho4Statics_WasWaypointPathFound;

// Function OakGame.OakEcho4Statics.WasWaypointPathFoundLatent
// 0x0028 (0x0028 - 0x0000)
struct OakEcho4Statics_WasWaypointPathFoundLatent final
{
public:
	class AActor*                                 DroneOrOwner;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0010(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakEcho4Statics_WasWaypointPathFoundLatent;

// Function OakGame.OakAIHeldLootableComponent.Lootable_OnPhysicsSleep
// 0x0010 (0x0010 - 0x0000)
struct OakAIHeldLootableComponent_Lootable_OnPhysicsSleep final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakAIHeldLootableComponent_Lootable_OnPhysicsSleep;

// Function OakGame.OakUIScript_EchoUpgrades.InsufficientPoints
// 0x0030 (0x0030 - 0x0000)
struct OakUIScript_EchoUpgrades_InsufficientPoints final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           OwningWidgetDef;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              position;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakUIScript_EchoUpgrades_InsufficientPoints;

// Function OakGame.OakUIScript_EchoUpgrades.StartTutorial
// 0x0030 (0x0030 - 0x0000)
struct OakUIScript_EchoUpgrades_StartTutorial final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           OwningWidgetDef;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              position;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakUIScript_EchoUpgrades_StartTutorial;

// Function OakGame.OakUIScript_EchoUpgrades.Upgraded
// 0x0030 (0x0030 - 0x0000)
struct OakUIScript_EchoUpgrades_Upgraded final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FGbxDefPtrProperty_                           OwningWidgetDef;                                   // 0x0008(0x0018)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              position;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OakUIScript_EchoUpgrades_Upgraded;

// Function OakGame.TravelStationObject.GetDisplayName
// 0x0010 (0x0010 - 0x0000)
struct TravelStationObject_GetDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TravelStationObject_GetDisplayName;

// Function OakGame.TravelStationObject.IsZoneActive
// 0x0001 (0x0001 - 0x0000)
struct TravelStationObject_IsZoneActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TravelStationObject_IsZoneActive;

// Function OakGame.OakUIScript_Social.FriendRequestReceived
// 0x0030 (0x0030 - 0x0000)
struct OakUIScript_Social_FriendRequestReceived final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
