#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OakGame

#include "Basic.hpp"

#include "GbxDefaultLoadingScreen_classes.hpp"
#include "GbxOnline_structs.hpp"
#include "GbxOnline_classes.hpp"
#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GbxAI_structs.hpp"
#include "GbxAI_classes.hpp"
#include "GbxSpawn_structs.hpp"
#include "GbxSpawn_classes.hpp"
#include "GbxGame_structs.hpp"
#include "GbxGame_classes.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxEngine_classes.hpp"
#include "GbxWeapon_structs.hpp"
#include "GbxWeapon_classes.hpp"
#include "GbxCore_structs.hpp"
#include "GameSettings_classes.hpp"
#include "GbxUICoherent_structs.hpp"
#include "GbxUICoherent_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GbxAudio_structs.hpp"
#include "GbxAudio_classes.hpp"
#include "CinematicCamera_classes.hpp"
#include "GbxUICore_classes.hpp"
#include "GbxAnimTexture_classes.hpp"
#include "GbxDecorator_classes.hpp"
#include "Niagara_classes.hpp"
#include "GbxNav_classes.hpp"
#include "ChaosVehicles_classes.hpp"
#include "GbxEnhancedInput_classes.hpp"
#include "GbxNetGame_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "GbxWorldPainter_classes.hpp"
#include "UMG_classes.hpp"
#include "MovieScene_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "EngineSettings_structs.hpp"
#include "GbxUISettings_classes.hpp"


namespace SDK
{

// Class OakGame.AITargetLockBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAITargetLockBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AbortTargetLock(class AActor* Context);
	static bool ApplyTargetLock(class AActor* Context, class AActor* target, float Timer);
	static class AActor* GetLockedTarget(class AActor* Context);
	static bool IsTargetLocked(class AActor* Context);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITargetLockBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITargetLockBlueprintLibrary")
	}
	static class UAITargetLockBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITargetLockBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UAITargetLockBlueprintLibrary;

// Class OakGame.NameplateInfoProviderInterface
// 0x0000 (0x0000 - 0x0000)
class INameplateInfoProviderInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NameplateInfoProviderInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NameplateInfoProviderInterface")
	}
	static class INameplateInfoProviderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<INameplateInfoProviderInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_INameplateInfoProviderInterface;

// Class OakGame.NexusConfigStorePoAActor
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStorePoAActor final : public UNexusConfigStoreBasic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStorePoAActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStorePoAActor")
	}
	static class UNexusConfigStorePoAActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStorePoAActor>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStorePoAActor;

// Class OakGame.AITargetLock
// 0x0000 (0x0000 - 0x0000)
class IAITargetLock final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITargetLock")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITargetLock")
	}
	static class IAITargetLock* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAITargetLock>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAITargetLock;

// Class OakGame.NexusConfigStoreLuckCategory
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStoreLuckCategory final : public UNexusConfigStoreBasic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreLuckCategory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreLuckCategory")
	}
	static class UNexusConfigStoreLuckCategory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreLuckCategory>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreLuckCategory;

// Class OakGame.AITargetLockUser
// 0x0000 (0x0000 - 0x0000)
class IAITargetLockUser final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITargetLockUser")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITargetLockUser")
	}
	static class IAITargetLockUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAITargetLockUser>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAITargetLockUser;

// Class OakGame.OakInteractiveObject
// 0x0B60 (0x25B0 - 0x1A50)
class AOakInteractiveObject : public AInteractiveObject
{
public:
	uint8                                         Pad_1A50[0x80];                                    // 0x1A50(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakInteractiveObjectBodyState         BodyState;                                         // 0x1AD0(0x0220)(ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CF0[0x8];                                     // 0x1CF0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bShowDiscoveryZones;                               // 0x1CF8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CF9[0x1];                                     // 0x1CF9(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         WorldDifficulty;                                   // 0x1CFA(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGrappleEnabled;                                   // 0x1CFB(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGbxMovingPlatformActorStateIsVisible         MovingPlatformActorStateIsVisible;                 // 0x1CFC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1CFD[0x3];                                     // 0x1CFD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakIntrinsicElementState              IntrinsicElementState;                             // 0x1D00(0x0060)(Edit, DisableEditOnTemplate, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D60[0x8];                                     // 0x1D60(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxInlineStruct                       DamageState;                                       // 0x1D68(0x0018)(Transient, NativeAccessSpecifierPrivate)
	struct FGbxHealthState                        HealthState;                                       // 0x1D80(0x00F8)(Net, Transient, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E78[0x38];                                    // 0x1E78(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakDiscoveryLocationInstanceConfig    OakDiscoveryLocationConfig;                        // 0x1EB0(0x0480)(Edit, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2330[0x8];                                     // 0x2330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EditorGeneratedDiscoveryLocationGuidString;        // 0x2338(0x0010)(Edit, ZeroConstructor, EditConst, Protected, TextExportTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGbxMovingPlatformInstanceConfig       MovingPlatformInstanceConfig;                      // 0x2348(0x00D0)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2418[0x8];                                     // 0x2418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxInlineStruct                       StructuredInteractableState;                       // 0x2420(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(class AActor* Grappler, const struct FGrappleableTarget& GrappleTarget)> OnGrappled; // 0x2438(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* Grappler, const struct FGrappleableTarget& GrappleTarget)> OnGrapplerAttached; // 0x2448(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* Grappler, const struct FGrappleableTarget& GrappleTarget)> OnGrapplerDetached; // 0x2458(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2468[0x48];                                    // 0x2468(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrappleableState                      GrappleableState;                                  // 0x24B0(0x0098)(Net, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2548[0x58];                                    // 0x2548(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class AOakPlayerController* OakPC)> OnEcho4DeploymentReady;        // 0x25A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void OnActorOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnRep_HealthState();
	void SetGrappleableEnabled(bool bNewIsEnabled);

	bool IsGrappleableEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OakInteractiveObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OakInteractiveObject")
	}
	static class AOakInteractiveObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOakInteractiveObject>();
	}
};
DUMPER7_ASSERTS_AOakInteractiveObject;

// Class OakGame.GrappleableObject
// 0x0080 (0x2630 - 0x25B0)
class AGrappleableObject : public AOakInteractiveObject
{
public:
	TMulticastInlineDelegate<void(class AActor* Grappler, const struct FGrappleableTarget& GrappleTarget)> OnGrapplerApexReached; // 0x25B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C0[0x18];                                    // 0x25C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAttributeInit                      GrappleEnabledAttribute;                           // 0x25D8(0x0050)(Edit, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2628[0x8];                                     // 0x2628(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GrappleableObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GrappleableObject")
	}
	static class AGrappleableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGrappleableObject>();
	}
};
DUMPER7_ASSERTS_AGrappleableObject;

// Class OakGame.GrapplePoint
// 0x0040 (0x2670 - 0x2630)
class AGrapplePoint : public AGrappleableObject
{
public:
	bool                                          bSearchForMantleUpDestination;                     // 0x2630(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSearchForDropDownDestination;                     // 0x2631(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideDropDownTrace;                            // 0x2632(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2633[0x1];                                     // 0x2633(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DropDownTraceDistance;                             // 0x2634(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideDestinationApexDimensions;                // 0x2638(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2639[0x3];                                     // 0x2639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DestinationApexDistance;                           // 0x263C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DestinationApexHeight;                             // 0x2640(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideApexOffset;                               // 0x2644(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2645[0x3];                                     // 0x2645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ApexOffset;                                        // 0x2648(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideDestinationLocation;                      // 0x264C(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_264D[0x3];                                     // 0x264D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OverrideDestinationLocationActor;                  // 0x2650(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideMantleUpPushbackDimensions;               // 0x2658(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2659[0x3];                                     // 0x2659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PushbackDistance;                                  // 0x265C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         PushbackFloorSearchDistance;                       // 0x2660(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2664[0xC];                                     // 0x2664(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPlayerProxySpawned();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GrapplePoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GrapplePoint")
	}
	static class AGrapplePoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGrapplePoint>();
	}
};
DUMPER7_ASSERTS_AGrapplePoint;

// Class OakGame.SiloGrappleSlider
// 0x0020 (0x2690 - 0x2670)
class ASiloGrappleSlider final : public AGrapplePoint
{
public:
	class ASiloBaseObject*                        AssociatedSiloBase;                                // 0x2670(0x0008)(Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SiloBalloonApexHeight;                             // 0x2678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SiloBalloonApexDistance;                           // 0x267C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SiloBalloonTimeToApex;                             // 0x2680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SiloBalloonEasingTime;                             // 0x2684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2688[0x8];                                     // 0x2688(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SiloGrappleSlider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SiloGrappleSlider")
	}
	static class ASiloGrappleSlider* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASiloGrappleSlider>();
	}
};
DUMPER7_ASSERTS_ASiloGrappleSlider;

// Class OakGame.AnimNotifyState_DeathLootState
// 0x0008 (0x0038 - 0x0030)
class UAnimNotifyState_DeathLootState final : public UAnimNotifyState
{
public:
	float                                         LootSpawnWeight;                                   // 0x0030(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotifyState_DeathLootState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotifyState_DeathLootState")
	}
	static class UAnimNotifyState_DeathLootState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_DeathLootState>();
	}
};
DUMPER7_ASSERTS_UAnimNotifyState_DeathLootState;

// Class OakGame.AnimNotify_ActivateAttachedLoot
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_ActivateAttachedLoot final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_ActivateAttachedLoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_ActivateAttachedLoot")
	}
	static class UAnimNotify_ActivateAttachedLoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_ActivateAttachedLoot>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_ActivateAttachedLoot;

// Class OakGame.OakZoneTransition
// 0x00A0 (0x0468 - 0x03C8)
class AOakZoneTransition : public AVolume
{
public:
	TMulticastInlineDelegate<void(EOakZoneTransitionGate EntryGate)> OnTravelAttemptSucceeded;       // 0x03C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(EOakZoneTransitionGate EntryGate)> OnTravelAttemptBlocked;         // 0x03D8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EOakZoneTransitionDirection                   Direction;                                         // 0x03E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOakZoneTransitionGate                 Gate[0x2];                                         // 0x03F0(0x0008)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	FGameDataHandleProperty_                      StationActorDef;                                   // 0x0400(0x0018)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLinkStationTransform;                             // 0x0418(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AOakCharacter*>                  PlayersInZone;                                     // 0x0420(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AOakCharacter*>                  PlayersEnteringVehicle;                            // 0x0430(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AOakCharacter*>                  PlayersExitingVehicle;                             // 0x0440(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AOakVehicle*>                    DriverlessVehicles;                                // 0x0450(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_460[0x8];                                      // 0x0460(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnZoneBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnZoneEndOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

	EOakZoneTransitionGate GetTransitionEntryGate() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OakZoneTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OakZoneTransition")
	}
	static class AOakZoneTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOakZoneTransition>();
	}
};
DUMPER7_ASSERTS_AOakZoneTransition;

// Class OakGame.OakAirlockTransition
// 0x0040 (0x04A8 - 0x0468)
class AOakAirlockTransition : public AOakZoneTransition
{
public:
	struct FFactExpression                        dependency;                                        // 0x0468(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	FGameDataHandleProperty_                      GateARespawnStationHandle;                         // 0x0478(0x0018)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FGameDataHandleProperty_                      GateBRespawnStationHandle;                         // 0x0490(0x0018)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void PerformZoneTransition();
	void PrepareZoneTransition(class AOakPlayerController* Controller);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OakAirlockTransition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OakAirlockTransition")
	}
	static class AOakAirlockTransition* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOakAirlockTransition>();
	}
};
DUMPER7_ASSERTS_AOakAirlockTransition;

// Class OakGame.NexusConfigStoreNewsImageRepoDef
// 0x0000 (0x0380 - 0x0380)
class UNexusConfigStoreNewsImageRepoDef final : public UNexusConfigStoreBasicDefFlat
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreNewsImageRepoDef")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreNewsImageRepoDef")
	}
	static class UNexusConfigStoreNewsImageRepoDef* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreNewsImageRepoDef>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreNewsImageRepoDef;

// Class OakGame.AnimNotify_Carry
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_Carry final : public UAnimNotify
{
public:
	ECarryNotify                                  CarryAction;                                       // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_Carry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_Carry")
	}
	static class UAnimNotify_Carry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_Carry>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_Carry;

// Class OakGame.GrappleGrate
// 0x0010 (0x2640 - 0x2630)
class AGrappleGrate final : public AGrappleableObject
{
public:
	uint8                                         Pad_2630[0x10];                                    // 0x2630(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GrappleGrate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GrappleGrate")
	}
	static class AGrappleGrate* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGrappleGrate>();
	}
};
DUMPER7_ASSERTS_AGrappleGrate;

// Class OakGame.AnimNotify_DeathLoot
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_DeathLoot final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_DeathLoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_DeathLoot")
	}
	static class UAnimNotify_DeathLoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_DeathLoot>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_DeathLoot;

// Class OakGame.OakUIView
// 0x0030 (0x0600 - 0x05D0)
class UOakUIView final : public UGbxUIView
{
public:
	uint8                                         Pad_5D0[0x30];                                     // 0x05D0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OakUIView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OakUIView")
	}
	static class UOakUIView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOakUIView>();
	}
};
DUMPER7_ASSERTS_UOakUIView;

// Class OakGame.AnimNotify_DeathLootLootsplosion
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_DeathLootLootsplosion final : public UAnimNotify
{
public:
	float                                         LootSpawnWeight;                                   // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_DeathLootLootsplosion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_DeathLootLootsplosion")
	}
	static class UAnimNotify_DeathLootLootsplosion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_DeathLootLootsplosion>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_DeathLootLootsplosion;

// Class OakGame.AnimNotify_DeathLootSocketOverride
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_DeathLootSocketOverride final : public UAnimNotify
{
public:
	class FName                                   DeathLootSocketOverride;                           // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_DeathLootSocketOverride")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_DeathLootSocketOverride")
	}
	static class UAnimNotify_DeathLootSocketOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_DeathLootSocketOverride>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_DeathLootSocketOverride;

// Class OakGame.GbxTrick_AICharge
// 0x0060 (0x0130 - 0x00D0)
class UGbxTrick_AICharge : public UGbxTrick_AnimBase
{
public:
	TArray<struct FGbxTrickAnimRandomData>        Start;                                             // 0x00D0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FGbxTrickAnimRandomData>        HitWall;                                           // 0x00E0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FGbxTrickAnimRandomData>        Miss;                                              // 0x00F0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FGbxTrickAnimRandomData>        ReachCliff;                                        // 0x0100(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FGbxTrickAnimRandomData>        StopForFriendly;                                   // 0x0110(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FGbxTrickAnimRandomData>        Strike;                                            // 0x0120(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxTrick_AICharge")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxTrick_AICharge")
	}
	static class UGbxTrick_AICharge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxTrick_AICharge>();
	}
};
DUMPER7_ASSERTS_UGbxTrick_AICharge;

// Class OakGame.GbxTrick_AISwoop
// 0x0020 (0x0150 - 0x0130)
class UGbxTrick_AISwoop final : public UGbxTrick_AICharge
{
public:
	TArray<struct FGbxTrickAnimRandomData>        Loop;                                              // 0x0130(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FGbxTrickAnimRandomData>        Stop;                                              // 0x0140(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxTrick_AISwoop")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxTrick_AISwoop")
	}
	static class UGbxTrick_AISwoop* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxTrick_AISwoop>();
	}
};
DUMPER7_ASSERTS_UGbxTrick_AISwoop;

// Class OakGame.SiloBaseObject
// 0x02D0 (0x2880 - 0x25B0)
class ASiloBaseObject final : public AOakInteractiveObject
{
public:
	uint8                                         Pad_25B0[0x8];                                     // 0x25B0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bOverrideBalloonHeight;                            // 0x25B8(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25B9[0x3];                                     // 0x25B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideBalloonHeight;                             // 0x25BC(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideBalloonFwdDist;                           // 0x25C0(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25C1[0x3];                                     // 0x25C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideBalloonFwdDist;                            // 0x25C4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideSliderHeight;                             // 0x25C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25C9[0x3];                                     // 0x25C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverrideSliderHeight;                              // 0x25CC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDoNotMoveSlider;                                  // 0x25D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25D1[0x7];                                     // 0x25D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        BaseComponent;                                     // 0x25D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        BalloonComponent;                                  // 0x25E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        HolderComponent;                                   // 0x25E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        LineComponent;                                     // 0x25F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        LineStartComponent;                                // 0x25F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        LineEndComponent;                                  // 0x2600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ASiloGrappleSlider*>             Sliders;                                           // 0x2608(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FVector                                LineStart;                                         // 0x2618(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                LineEnd;                                           // 0x2630(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGbxMovingPlatformConfig               PlatformConfig;                                    // 0x2648(0x0120)(BlueprintVisible, BlueprintReadOnly, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2768[0x8];                                     // 0x2768(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             SliderStart;                                       // 0x2770(0x0060)(BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                             SliderEnd;                                         // 0x27D0(0x0060)(BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ApexOffset;                                        // 0x2830(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SliderDuration;                                    // 0x2834(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeToApex;                                        // 0x2838(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EasingTime;                                        // 0x283C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ReturnDelay;                                       // 0x2840(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2844[0x4];                                     // 0x2844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ASiloGrappleSlider* InSlider, int32 SliderIndex, float InSliderDuration, float InReturnDelay, const struct FVector& SliderStart, const struct FVector& SliderEnd)> OnInitializedSlider; // 0x2848(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2858[0x28];                                    // 0x2858(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBalloonReady();
	void OnPlayerProxySpawned();
	void OnRep_Sliders();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SiloBaseObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SiloBaseObject")
	}
	static class ASiloBaseObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASiloBaseObject>();
	}
};
DUMPER7_ASSERTS_ASiloBaseObject;

// Class OakGame.AnimNotify_DeathLootSpawnPatternOverride
// 0x0018 (0x0050 - 0x0038)
class UAnimNotify_DeathLootSpawnPatternOverride final : public UAnimNotify
{
public:
	FGbxDefPtrProperty_                           DeathLootSpawnPatternOverride;                     // 0x0038(0x0018)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_DeathLootSpawnPatternOverride")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_DeathLootSpawnPatternOverride")
	}
	static class UAnimNotify_DeathLootSpawnPatternOverride* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_DeathLootSpawnPatternOverride>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_DeathLootSpawnPatternOverride;

// Class OakGame.GbxTrick_Slam
// 0x0070 (0x0100 - 0x0090)
class UGbxTrick_Slam final : public UGbxTrick
{
public:
	bool                                          bAutoEnableRagdoll;                                // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAutoDisableRagdoll;                               // 0x0091(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bDisableAndRestoreBodyTargets;                     // 0x0092(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlamTrickProperties                   ReelProperties;                                    // 0x0094(0x0034)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FSlamTrickProperties                   SlamProperties;                                    // 0x00C8(0x0034)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	float                                         CollisionBufferDistance;                           // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GbxTrick_Slam")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GbxTrick_Slam")
	}
	static class UGbxTrick_Slam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGbxTrick_Slam>();
	}
};
DUMPER7_ASSERTS_UGbxTrick_Slam;

// Class OakGame.AnimNotify_GiveTakeItem
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_GiveTakeItem final : public UAnimNotify
{
public:
	EGiveTakeItemOption                           Option;                                            // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_GiveTakeItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_GiveTakeItem")
	}
	static class UAnimNotify_GiveTakeItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_GiveTakeItem>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_GiveTakeItem;

// Class OakGame.OakUISubtitleRole
// 0x0000 (0x0100 - 0x0100)
class UOakUISubtitleRole final : public UGbxProfileProgressRoleClientLocal
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OakUISubtitleRole")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OakUISubtitleRole")
	}
	static class UOakUISubtitleRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOakUISubtitleRole>();
	}
};
DUMPER7_ASSERTS_UOakUISubtitleRole;

// Class OakGame.AnimNotify_GrappleLineExtend
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_GrappleLineExtend final : public UAnimNotify
{
public:
	EGrappleNotify                                GrappleAction;                                     // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_GrappleLineExtend")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_GrappleLineExtend")
	}
	static class UAnimNotify_GrappleLineExtend* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_GrappleLineExtend>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_GrappleLineExtend;

// Class OakGame.AnimNotify_Melee
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_Melee final : public UAnimNotify
{
public:
	EMeleeNotify                                  MeleeAction;                                       // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_Melee")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_Melee")
	}
	static class UAnimNotify_Melee* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_Melee>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_Melee;

// Class OakGame.LootableObject
// 0x0330 (0x28E0 - 0x25B0)
class ALootableObject final : public AOakInteractiveObject
{
public:
	uint8                                         Pad_25B0[0x10];                                    // 0x25B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FJunkId& JunkId, class AGbxPlayerController* PickedUpBy)> OnJunkPickedUpEvent; // 0x25C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnAllJunkPickedUpEvent;                            // 0x25D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FJunkId& JunkId)> OnJunkAttachedEvent;                // 0x25E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bOverrideLootConfigDef;                            // 0x25F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideLootToDrop;                               // 0x25F1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25F2[0x6];                                     // 0x25F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           LootConfigDefOverride;                             // 0x25F8(0x0018)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FGameDataHandleProperty_                      LootToDropOverride;                                // 0x2610(0x0018)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APawn*                                  PawnThatOpenedMe;                                  // 0x2628(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkinnedMeshComponent*                  MeshComponent;                                     // 0x2630(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULootableObjectAnimInstance*            LootableAnimInstance;                              // 0x2638(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2640[0x2A0];                                   // 0x2640(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnComponentSleep(class UPrimitiveComponent* SleepingComponent, class FName BoneName);
	void OnMeshCollision(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnMeshPhysicsStateChanged(class UPrimitiveComponent* Component, EComponentPhysicsStateChange StateChange);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LootableObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LootableObject")
	}
	static class ALootableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALootableObject>();
	}
};
DUMPER7_ASSERTS_ALootableObject;

// Class OakGame.AnimNotify_SpawnLoot
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_SpawnLoot final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_SpawnLoot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_SpawnLoot")
	}
	static class UAnimNotify_SpawnLoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_SpawnLoot>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_SpawnLoot;

// Class OakGame.OakEnhancedInputActionHandler_Character
// 0x0018 (0x0048 - 0x0030)
class UOakEnhancedInputActionHandler_Character : public UGbxEnhancedInputActionHandler
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OakEnhancedInputActionHandler_Character")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OakEnhancedInputActionHandler_Character")
	}
	static class UOakEnhancedInputActionHandler_Character* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOakEnhancedInputActionHandler_Character>();
	}
};
DUMPER7_ASSERTS_UOakEnhancedInputActionHandler_Character;

// Class OakGame.OakEnhancedInputActionHandler_FFYL
// 0x0000 (0x0048 - 0x0048)
class UOakEnhancedInputActionHandler_FFYL final : public UOakEnhancedInputActionHandler_Character
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OakEnhancedInputActionHandler_FFYL")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OakEnhancedInputActionHandler_FFYL")
	}
	static class UOakEnhancedInputActionHandler_FFYL* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOakEnhancedInputActionHandler_FFYL>();
	}
};
DUMPER7_ASSERTS_UOakEnhancedInputActionHandler_FFYL;

// Class OakGame.AnimNotify_Vehicle
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_Vehicle final : public UAnimNotify
{
public:
	EVehicleNotify                                VehicleNotify;                                     // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_Vehicle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_Vehicle")
	}
	static class UAnimNotify_Vehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_Vehicle>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_Vehicle;

// Class OakGame.OakGameSettingDiscrete_AudioLanguage
// 0x0008 (0x01A0 - 0x0198)
class UOakGameSettingDiscrete_AudioLanguage final : public UGameSettingValueDiscreteDynamic
{
public:
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OakGameSettingDiscrete_AudioLanguage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OakGameSettingDiscrete_AudioLanguage")
	}
	static class UOakGameSettingDiscrete_AudioLanguage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOakGameSettingDiscrete_AudioLanguage>();
	}
};
DUMPER7_ASSERTS_UOakGameSettingDiscrete_AudioLanguage;

// Class OakGame.AOEActor
// 0x0460 (0x07F0 - 0x0390)
class alignas(0x10) AAOEActor final : public AActor
{
public:
	uint8                                         Pad_390[0x30];                                     // 0x0390(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorData                          GbxActorData;                                      // 0x03C0(0x0108)(Edit, Net, DisableEditOnTemplate, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGbxActorScriptOwnerState              ScriptData;                                        // 0x04C8(0x0080)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_548[0x230];                                    // 0x0548(0x0230)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxActorState                         ActorState;                                        // 0x0778(0x0070)(Edit, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7E8[0x8];                                      // 0x07E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AOEActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AOEActor")
	}
	static class AAOEActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAOEActor>();
	}
};
DUMPER7_ASSERTS_AAOEActor;

// Class OakGame.AOEActorBodyData
// 0x0000 (0x0060 - 0x0060)
class UAOEActorBodyData final : public UGbxBodyData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AOEActorBodyData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AOEActorBodyData")
	}
	static class UAOEActorBodyData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAOEActorBodyData>();
	}
};
DUMPER7_ASSERTS_UAOEActorBodyData;

// Class OakGame.NexusConfigStoreUISpecializations
// 0x0000 (0x0390 - 0x0390)
class UNexusConfigStoreUISpecializations final : public UNexusConfigStoreBasic
{
public:
	static void GetAllProgressGraphGroupDefs(TArray<FGbxDefPtrProperty_>* graphs);
	static void GetNodeNames(class UObject* EditObject, FGbxDefPtrProperty_ ProgressGraph, TArray<class FName>* OutNames);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NexusConfigStoreUISpecializations")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NexusConfigStoreUISpecializations")
	}
	static class UNexusConfigStoreUISpecializations* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNexusConfigStoreUISpecializations>();
	}
};
DUMPER7_ASSERTS_UNexusConfigStoreUISpecializations;

// Class OakGame.BioArmorStatics
// 0x0000 (0x0028 - 0x0028)
class UBioArmorStatics final : public UBlueprintFunctionLibrary
{
public:
	static bool HasBioArmor(class AActor* Context);
	static bool IsBioArmorActive(class AActor* Context);
	static bool TryActivateBioArmor(class AActor* Context, bool bIsInstantaneous);
	static bool TryDeactivateBioArmor(class AActor* Context);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BioArmorStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BioArmorStatics")
	}
	static class UBioArmorStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBioArmorStatics>();
	}
};
DUMPER7_ASSERTS_UBioArmorStatics;

// Class OakGame.BulletMagnetismInterface
// 0x0000 (0x0000 - 0x0000)
class IBulletMagnetismInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BulletMagnetismInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BulletMagnetismInterface")
	}
	static class IBulletMagnetismInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IBulletMagnetismInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IBulletMagnetismInterface;

// Class OakGame.OakVehicleAnimInstance
// 0x0080 (0x06B0 - 0x0630)
class UOakVehicleAnimInstance final : public UGbxGameAnimInstance
{
public:
	bool                                          bIsDriving;                                        // 0x0630(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DriveDirection;                                    // 0x0638(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteeringAngle;                                     // 0x0648(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Leaning;                                           // 0x064C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleSpeed;                                      // 0x0650(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VehicleWorldVelocity;                              // 0x0658(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VehicleLocalVelocity;                              // 0x0670(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
