#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_SpawnMesh_FogWall_Small

#include "Basic.hpp"

#include "Enum_SpawnMesh_CharacterAnimStyle_structs.hpp"
#include "Enum_SpawnMesh_FogWall_Shape_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_SpawnMesh_FogWall_Small.Script_SpawnMesh_FogWall_Small_C
// 0x0018 (0x00C0 - 0x00A8)
class UScript_SpawnMesh_FogWall_Small_C final : public UGbxActorScript_SpawnPoint
{
public:
	Enum_SpawnMesh_CharacterAnimStyle             CharacterAnimationStyle;                           // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_SpawnMesh_FogWall_Shape                  FogWallShape;                                      // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FogWallWidth;                                      // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FogWallHeight;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_SpawnMesh_FogWall_Small_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_SpawnMesh_FogWall_Small_C")
	}
	static class UScript_SpawnMesh_FogWall_Small_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_SpawnMesh_FogWall_Small_C>();
	}
};
DUMPER7_ASSERTS_UScript_SpawnMesh_FogWall_Small_C;

}

