#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_ExplodingObject_HangingLantern

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_ExplodingObject_HangingLantern.Script_ExplodingObject_HangingLantern_C
// 0x0040 (0x00E0 - 0x00A0)
class UScript_ExplodingObject_HangingLantern_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AOakCharacter*                          instigator;                                        // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      Damage_Data;                                       // 0x00B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AController*                            Details_Instigated_By;                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Light_Color;                                       // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Script_ExplodingObject_HangingLantern(int32 entrypoint);
	void Exploding__OnStateEnabled();

	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_ExplodingObject_HangingLantern_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_ExplodingObject_HangingLantern_C")
	}
	static class UScript_ExplodingObject_HangingLantern_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_ExplodingObject_HangingLantern_C>();
	}
};
DUMPER7_ASSERTS_UScript_ExplodingObject_HangingLantern_C;

}

