#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_PropagandaSpeaker_Collectible

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "Enum_PropagandaSpeaker_ZoneTypes_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_PropagandaSpeaker_Collectible.Script_PropagandaSpeaker_Collectible_C
// 0x00C0 (0x0238 - 0x0178)
class UScript_PropagandaSpeaker_Collectible_C final : public UOakChallengeCollectibleScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0178(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGbxCharacter*                          HackingPlayer;                                     // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AGbxCharacter*>                  PlayersInProximity;                                // 0x0188(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AOakSpawnEncounter*                     Encounter_Group1;                                  // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawnEncounter*                     Encounter_Group2;                                  // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawnEncounter*                     Encounter_Group3;                                  // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AGbxCharacter*>                  PlayersInProximity_Audio;                          // 0x01B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         SavedProgress;                                     // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_PropagandaSpeaker_ZoneTypes              PropagandaZone;                                    // 0x01C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReplaceWithProximityBox;                           // 0x01C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C6[0x2];                                      // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakTriggerVolume*                      OptionalProximityVolume;                           // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          ProgressInterrupted;                               // 0x01D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakDrone*                              Echo4;                                             // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         BufferDuration;                                    // 0x01E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BufferTimer;                                       // 0x01E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          PlayerInConsideration_Exit;                        // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          PlayerInConsideration_Enter;                       // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer_HackProgress;                                // 0x0200(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentProgress;                                   // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsProgressGoingUp;                                 // 0x020C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      TutorialChallenge;                                 // 0x0210(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ProximityBox_VisualOffset_Z;                       // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Thread_ID;                                         // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Zero__OnStateDisabled();
	void Two5__OnStateDisabled();
	void Two5__OnStateEnabled();
	void Five0__OnStateDisabled();
	void Five0__OnStateEnabled();
	void Seven5__OnStateDisabled();
	void Seven5__OnStateEnabled();
	void ActivateEncounter(class AOakSpawnEncounter* Encounter);
	void Active__OnStateEnabled();
	void AfterBuffer();
	void CheckForPropaganda();
	void CheckpointReached__OnStateEnabled();
	void Complete__OnStateEnabled();
	void DebugPrint_NumPlayersInProximity();
	void Echo4_Arrived(class AOakDrone* Echo4_0);
	void Echo4_MoveTo(class AActor* MoveTarget);
	void Echo4_SetOrientationMode(bool On_);
	void Echo4_SkipRetrieve();
	void Echo4_Spawn(class AActor* Context, EGbxRelativeLocationType Relative_Location_Type, class FName Location_Option_Socket, const struct FGbxRelativeRotation& Location_Options_Offset_Direction, double Location_Options_Offset_Distance);
	void Echo_Spawned(class AOakDrone* Echo4_0);
	void EncounterComplete__OnStateDisabled();
	void EncounterComplete__OnStateEnabled();
	void ExecuteUbergraph_Script_PropagandaSpeaker_Collectible(int32 entrypoint);
	void Fail__OnStateEnabled();
	void GbxActorScriptEvt__UsableActorState_K2_OnUsed(class AActor* User, EUsabilityType UseType, bool bWasHeld);
	void Idle__OnStateEnabled();
	void OnBeginPlay();
	void OnFinishedLoading(bool bIsComplete);
	void OnPlayerEnter_AudioProximity(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnPlayerEnter_Box(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPlayerEnter_Shared(class AActor* Actor);
	void OnPlayerEnter_Sphere(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnPlayerLeave_AudioProximity(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnPlayerLeave_Box(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnPlayerLeave_Shared(class AActor* Actor);
	void OnPlayerLeave_Sphere(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnTutorialRadiusEnter(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PropagandaOn__OnStateDisabled();
	void PropagandaOn__OnStateEnabled();
	void ReevaluateSpeaker();
	void ReplaceHackingPlayer();
	void RetrieveE4(double DelayBeforeDigistructingOut);
	void SendSpeakerBackToIdle();
	void SetProgressCheckpoint();
	void SpawnAndSetEcho4(class AOakCharacter* player);
	void StartProgressTimer();
	void SteamOn__OnStateEnabled();
	void UpdateHackProgress();
	void UpdatePlayersInProximity(class AGbxCharacter* player, bool Remove);
	void UpdatePlayersInProximity_Audio(class AGbxCharacter* player, bool Remove);
	void UpdateProgressNumber();
	void UpdateSpeakerAudio();

	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_PropagandaSpeaker_Collectible_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_PropagandaSpeaker_Collectible_C")
	}
	static class UScript_PropagandaSpeaker_Collectible_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_PropagandaSpeaker_Collectible_C>();
	}
};
DUMPER7_ASSERTS_UScript_PropagandaSpeaker_Collectible_C;

}

