#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_SpawnMesh_WateringHole

#include "Basic.hpp"

#include "Enum_SpawnMesh_WateringHole_LiquidType_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_SpawnMesh_WateringHole.Script_SpawnMesh_WateringHole_C
// 0x0018 (0x00C0 - 0x00A8)
class UScript_SpawnMesh_WateringHole_C final : public UGbxActorScript_SpawnPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	Enum_SpawnMesh_WateringHole_LiquidType        LiquidType;                                        // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetEnemyElement;                                   // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ExitAEnabled;                                      // 0x00B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ExitBEnabled;                                      // 0x00B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ExitCEnabled;                                      // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LiquidIsElemental;                                 // 0x00B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SplashDelay;                                       // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AssignSpawnedActorElement(class UObject* SpawnedActor);
	void CE_ExitA_OnActorSpawned(class USpawnPointComponent* SpawnPoint, class AActor* Actor);
	void CE_ExitB_OnActorSpawned(class USpawnPointComponent* SpawnPoint, class AActor* Actor);
	void CE_ExitC_OnActorSpawned(class USpawnPointComponent* SpawnPoint, class AActor* Actor);
	void ExecuteUbergraph_Script_SpawnMesh_WateringHole(int32 entrypoint);
	void OnBeginPlay();

	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_SpawnMesh_WateringHole_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_SpawnMesh_WateringHole_C")
	}
	static class UScript_SpawnMesh_WateringHole_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_SpawnMesh_WateringHole_C>();
	}
};
DUMPER7_ASSERTS_UScript_SpawnMesh_WateringHole_C;

}

