#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_ContractItem_Trackable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_Vault_Key_Type_structs.hpp"
#include "Enum_Vault_Key_Zone_structs.hpp"
#include "GbxGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_ContractItem_Trackable.Script_ContractItem_Trackable_C
// 0x0048 (0x01C0 - 0x0178)
class UScript_ContractItem_Trackable_C final : public UOakChallengeCollectibleScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0178(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AOakDrone*                              Echo_4;                                            // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           timer_State;                                       // 0x0188(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             PlayerThatUsedIO;                                  // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 AssociatedIO;                                      // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   StateMachine;                                      // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   State;                                             // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScanTime;                                          // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Vault_Key_Type                           Select_Type;                                       // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Vault_Key_Zone                           Select_Zone;                                       // 0x01B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void collected__OnStateEnabled();
	void CompleteInteraction();
	void Echo4__OnStateEnabled();
	void Echo4_Arrived(class AOakDrone* Echo4);
	void Echo4_MoveTo(class AActor* MoveTarget);
	void Echo4_SetOrientationMode(bool On_);
	void Echo4_SkipRetrieve();
	void Echo4_Spawn(class AActor* Context, EGbxRelativeLocationType Relative_Location_Type, class FName Location_Option_Socket, const struct FGbxRelativeRotation& Location_Options_Offset_Direction, double Location_Options_Offset_Distance);
	void ECHO_Interaction();
	void Echo_Spawned(class AOakDrone* Echo4);
	void ExecuteUbergraph_Script_ContractItem_Trackable(int32 entrypoint);
	void GbxActorScriptEvt__UsableActorState_K2_OnUsed(class AActor* User, EUsabilityType UseType, bool bWasHeld);
	void HideShowState__OnStateEnabled();
	void Idle__OnStateEnabled();
	void OnPerchFinish();
	void RetrieveE4(double DelayBeforeDigistructingOut);
	void TrackerOn__OnStateEnabled();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_ContractItem_Trackable_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_ContractItem_Trackable_C")
	}
	static class UScript_ContractItem_Trackable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_ContractItem_Trackable_C>();
	}
};
DUMPER7_ASSERTS_UScript_ContractItem_Trackable_C;

}

