#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_MomentInteractPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_MomentInteractPoint.Script_MomentInteractPoint_C
// 0x0028 (0x00C8 - 0x00A0)
class UScript_MomentInteractPoint_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGbxMomentData*                         MomentToPlay;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Reusable;                                          // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CooldownBeforeNextUse;                             // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CooldownTimer;                                     // 0x00C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Script_MomentInteractPoint(int32 entrypoint);
	void GbxActorScriptEvt__UsableActorState_K2_OnUsed(class AActor* User, EUsabilityType UseType, bool bWasHeld);
	void InUse__OnStateEnabled();
	void OnBeginPlay();
	void ReadyIO();
	void Used__OnStateEnabled();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_MomentInteractPoint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_MomentInteractPoint_C")
	}
	static class UScript_MomentInteractPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_MomentInteractPoint_C>();
	}
};
DUMPER7_ASSERTS_UScript_MomentInteractPoint_C;

}

