#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_Lootable_Deco_Microwave

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_Lootable_Deco_Microwave.Script_Lootable_Deco_Microwave_C
// 0x0080 (0x0120 - 0x00A0)
class UScript_Lootable_Deco_Microwave_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SKMesh;                                            // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGbxMaterialParamInterpOptions         options;                                           // 0x00B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FGbxMaterialParamInterpOptions         Options_Color;                                     // 0x00D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FLinearColor                           Color_Red;                                         // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Black;                                       // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Green;                                       // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Script_Lootable_Deco_Microwave(int32 entrypoint);
	void Locked__OnStateDisabled();
	void Locked__OnStateEnabled();
	void Open__OnStateEnabled();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_Lootable_Deco_Microwave_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_Lootable_Deco_Microwave_C")
	}
	static class UScript_Lootable_Deco_Microwave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_Lootable_Deco_Microwave_C>();
	}
};
DUMPER7_ASSERTS_UScript_Lootable_Deco_Microwave_C;

}

