#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_IO_CC_Evocarium

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_IO_CC_Evocarium.Script_IO_CC_Evocarium_C
// 0x0058 (0x01D0 - 0x0178)
class UScript_IO_CC_Evocarium_C final : public UOakChallengeCollectibleScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0178(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AOakPlayerController*                   UserController;                                    // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             UserCharacter;                                     // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         PrayTrickID;                                       // 0x0190(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         AssociatedBeacons;                                 // 0x0198(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CurrentProgress;                                   // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CompletionGoal;                                    // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CinematicModeReason;                               // 0x01B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      TutorialChallenge;                                 // 0x01B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Complete__OnStateEnabled();
	void Completing__OnStateEnabled();
	void ExecuteUbergraph_Script_IO_CC_Evocarium(int32 entrypoint);
	void GbxActorScriptEvt__UsableActorState_K2_OnUsed(class AActor* User, EUsabilityType UseType, bool bWasHeld);
	void OnBeginPlay();
	void OnEridiumChallengeUpdated();
	void OnTutorialRadiusEnter(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PingBeacons();
	void RegisterEvocarium(class AActor* Evocarium);
	void SetBeamTargetDestination(const struct FVector& TargetDestination);
	void True__OnStateEnabled();
	void UpdateBeaconState(bool SetComplete, bool SetDormant);
	void UpdateEvocarium(class AActor* Beacon);
	void WaitForBeacons__OnStateEnabled();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_IO_CC_Evocarium_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_IO_CC_Evocarium_C")
	}
	static class UScript_IO_CC_Evocarium_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_IO_CC_Evocarium_C>();
	}
};
DUMPER7_ASSERTS_UScript_IO_CC_Evocarium_C;

}

