#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_LostCapsule_DecryptStation

#include "Basic.hpp"

#include "GbxAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxGame_classes.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_LostCapsule_DecryptStation.Script_LostCapsule_DecryptStation_C
// 0x0078 (0x0118 - 0x00A0)
class UScript_LostCapsule_DecryptStation_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FGameDataHandleProperty_                      challenge;                                         // 0x00A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   PlayerWhoPlacedIt;                                 // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACarryableObject*                       PlacedCarryable;                                   // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ChildLootable;                                     // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   PlayerCarryingCarryable;                           // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CarryableEnteringProximity;                        // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGbxAudioEvent                         CapsulePlaced;                                     // 0x00E8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ContainerEnabled__OnStateDisabled();
	void ContainerEnabled__OnStateEnabled();
	void ContainsCarryable__OnStateEnabled();
	void Decrypted__OnStateEnabled();
	void Decrypting__OnStateEnabled();
	void ExecuteUbergraph_Script_LostCapsule_DecryptStation(int32 entrypoint);
	void GbxActorScriptEvt__OnCarryablePlacedInContainerBP(class ACarryableObject* CarryableObject);
	void GbxActorScriptEvt__OnCarryableRemovedFromContainerBP(class ACarryableObject* CarryableObject);
	void Idle__OnStateEnabled();
	void IsPresentationPlaying__OnStateDisabled();
	void IsPresentationPlaying__OnStateEnabled();
	void OnBeginPlay();
	void OnTutorialRadiusEnter(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void PassChallenge(FGameDataHandleProperty_ challenge_0);
	void ReportDecryptFinished();
	void ResetCarryableState();
	void StartDecrypt(class AOakPlayerController* PlayerWhoPlacedIt_0, FGameDataHandleProperty_ challenge_0);
	void TriggerDecryptStation_VO(class AActor* Transmitter, class AOakPlayerController* PlayerController);
	void TriggerDecryptStationTutorial(class AActor* Transmitter, class AOakPlayerController* PlayerController);
	void UpdateDecryptStation(class AActor* DecryptStation, FGameDataHandleProperty_ challenge_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_LostCapsule_DecryptStation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_LostCapsule_DecryptStation_C")
	}
	static class UScript_LostCapsule_DecryptStation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_LostCapsule_DecryptStation_C>();
	}
};
DUMPER7_ASSERTS_UScript_LostCapsule_DecryptStation_C;

}

