#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_SiloBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_SiloBase_ZiplineHeights_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_SiloBase.Script_SiloBase_C
// 0x0060 (0x0100 - 0x00A0)
class UScript_SiloBase_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           TimerHandle;                                       // 0x00A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	Enum_SiloBase_ZiplineHeights                  SiloZiplineHeight;                                 // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      TutorialChallenge;                                 // 0x00B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGbxMaterialParamInterpOptions         Options_ColorForCollected;                         // 0x00D0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FLinearColor                           ColorForCollected;                                 // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Balloon_OnFinishDeployed__OnStateEnabled();
	void Deployed__OnStateEnabled();
	void Dormant__OnStateEnabled();
	void ExecuteUbergraph_Script_SiloBase(int32 entrypoint);
	void OnBeginPlay();
	void OnTutorialRadiusEnter(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Script_Initialize_Slider(class ASiloGrappleSlider* InSlider, int32 SliderIndex, float InSliderDuration, float InReturnDelay, const struct FVector& SliderStart, const struct FVector& SliderEnd);

	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_SiloBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_SiloBase_C")
	}
	static class UScript_SiloBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_SiloBase_C>();
	}
};
DUMPER7_ASSERTS_UScript_SiloBase_C;

}

