#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_Carryable_Common_Audio

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxAudio_structs.hpp"


namespace SDK::Params
{

// Function Script_Carryable_Common_Audio.Script_Carryable_Common_Audio_C.ExecuteUbergraph_Script_Carryable_Common_Audio
// 0x0380 (0x0380 - 0x0000)
struct Script_Carryable_Common_Audio_C_ExecuteUbergraph_Script_Carryable_Common_Audio final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           Temp_GbxDefPtr_Variable;                           // 0x0008(0x0018)(NoDestructor, HasGetValueTypeHash)
	FGbxDefPtrProperty_                           Temp_GbxDefPtr_Variable_1;                         // 0x0020(0x0018)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           K2Node_Select_Default;                             // 0x0040(0x0018)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Grappler;                             // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGrappleableTarget                     K2Node_Event_GrappleTarget;                        // 0x0060(0x00C0)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_1;       // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Carrier;                              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxAudioPlaybackInstance              CallFunc_PostWwiseEventOnActorSocket_ReturnValue;  // 0x0138(0x0018)()
	class UGbxSkeletalMeshComponent*              CallFunc_GetBodyComponent_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAudioPlaybackInstance              CallFunc_PostWwiseEventOnActor_ReturnValue;        // 0x0170(0x0018)()
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0190(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAudioEmitterSource                 K2Node_MakeStruct_GbxAudioEmitterSource;           // 0x01F0(0x0080)(NoDestructor)
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_1;         // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxAudioPlaybackInstance              CallFunc_PostWwiseEventOnActor_ReturnValue_1;      // 0x0278(0x0018)()
	class ACarryableObject*                       CallFunc_GetAssociatedActor_ReturnValue_2;         // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_Grappler;          // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGrappleableTarget                     K2Node_GbxActorScriptBoundEvent_GrappleTarget;     // 0x02A0(0x00C0)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FGbxAudioPlaybackInstance              CallFunc_PostEventInWorld_ReturnValue;             // 0x0360(0x0018)()
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_Carrier;           // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_Carryable_Common_Audio_C_ExecuteUbergraph_Script_Carryable_Common_Audio;

// Function Script_Carryable_Common_Audio.Script_Carryable_Common_Audio_C.GbxActorScriptEvt__OnCaughtAudio
// 0x0008 (0x0008 - 0x0000)
struct Script_Carryable_Common_Audio_C_GbxActorScriptEvt__OnCaughtAudio final
{
public:
	class AActor*                                 Carrier;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_Carryable_Common_Audio_C_GbxActorScriptEvt__OnCaughtAudio;

// Function Script_Carryable_Common_Audio.Script_Carryable_Common_Audio_C.GbxActorScriptEvt__OnGrapplerAttached
// 0x00D0 (0x00D0 - 0x0000)
struct Script_Carryable_Common_Audio_C_GbxActorScriptEvt__OnGrapplerAttached final
{
public:
	class AActor*                                 Grappler_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrappleableTarget                     GrappleTarget;                                     // 0x0010(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Script_Carryable_Common_Audio_C_GbxActorScriptEvt__OnGrapplerAttached;

}

