#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_CC_Vault_Door_LevelTravel

#include "Basic.hpp"

#include "OakGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_CC_Vault_Door_LevelTravel.Script_CC_Vault_Door_LevelTravel_C
// 0x0028 (0x01A0 - 0x0178)
class UScript_CC_Vault_Door_LevelTravel_C final : public UOakChallengeCollectibleScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0178(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         DoOnce;                                            // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGbxCharacter*                          PlayerThatUsedIO;                                  // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFactHandle*                            TutorialFactHandler;                               // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DelayBeforeDoorFX;                                 // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Script_CC_Vault_Door_LevelTravel(int32 entrypoint);
	void On__OnStateEnabled();
	void presentation__OnStateEnabled();
	void TrackerOn__OnStateEnabled();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_CC_Vault_Door_LevelTravel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_CC_Vault_Door_LevelTravel_C")
	}
	static class UScript_CC_Vault_Door_LevelTravel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_CC_Vault_Door_LevelTravel_C>();
	}
};
DUMPER7_ASSERTS_UScript_CC_Vault_Door_LevelTravel_C;

}

