#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_CarryableContainer_MeteorDestroyer_Railgun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxAI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_CarryableContainer_MeteorDestroyer_Railgun.Script_CarryableContainer_MeteorDestroyer_Railgun_C
// 0x0070 (0x0110 - 0x00A0)
class UScript_CarryableContainer_MeteorDestroyer_Railgun_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 SpawnedMeteor;                                     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnLocation_IO;                                  // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBetweenShots;                                 // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseWaitTime;                                      // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBetweenShotCombo;                             // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxBlackboardEntryRef                 BB_OreInt;                                         // 0x00D4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         MeteorHitCount;                                    // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxMomentData*                         M_MeteorIncoming;                                  // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         StartingAmmoValue;                                 // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AmmoLoaded;                                        // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Manager;                                           // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CarryableReceptacles;                              // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void AboutToFire__OnStateEnabled();
	void AddHit__OnStateEnabled();
	void Destroyed__OnStateEnabled();
	void ExecuteUbergraph_Script_CarryableContainer_MeteorDestroyer_Railgun(int32 entrypoint);
	void FinishLoading__OnStateEnabled();
	void FireFinished__OnStateEnabled();
	void FireGun__OnStateEnabled();
	void Firing__OnStateEnabled();
	void GbxActorScriptEvt__Blackboard_ValueChangedEventBP(const struct FGbxBlackboardEntryRef& Entry);
	void Loaded__OnStateEnabled();
	void LoadIdle__OnStateEnabled();
	void MeteorExplode();
	void OpenToLoad__OnStateEnabled();
	void RemindManagerFinished();
	void RemindMeteorFinished();
	void SetManager(class AActor* Manager_0);
	void SpawnLoot__OnStateEnabled();
	void StartExplode();
	void TransferAcceleration(double Acceleration);
	void TransferExplosionCount(int32 ExplosionCount);
	void TransferLoadedOreCount(int32 LoadedOreCount);
	void Unloaded__OnStateEnabled();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_CarryableContainer_MeteorDestroyer_Railgun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_CarryableContainer_MeteorDestroyer_Railgun_C")
	}
	static class UScript_CarryableContainer_MeteorDestroyer_Railgun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_CarryableContainer_MeteorDestroyer_Railgun_C>();
	}
};
DUMPER7_ASSERTS_UScript_CarryableContainer_MeteorDestroyer_Railgun_C;

}

