#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_Carryable_ExplodingObject_Co2Tank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_Carryable_ExplodingObject_Co2Tank.Script_Carryable_ExplodingObject_Co2Tank_C
// 0x0058 (0x00F8 - 0x00A0)
class UScript_Carryable_ExplodingObject_Co2Tank_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AOakCharacter*                          instigator;                                        // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      Damage_Data;                                       // 0x00B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AController*                            Details_Instigated_By;                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NewVar;                                            // 0x00D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         NumLoops;                                          // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurLoops;                                          // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FuseTime;                                          // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DelayBWBursts;                                     // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanExplodeOnHit;                                   // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCarryableThrown;                                  // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Script_Carryable_ExplodingObject_Co2Tank(int32 entrypoint);
	void Exploding__OnStateEnabled();
	void GbxActorScriptEvt__OnActorHit(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void GbxActorScriptEvt__OnCarried(class AActor* Carrier);
	void GbxActorScriptEvt__OnThrown(class AActor* Carrier);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_Carryable_ExplodingObject_Co2Tank_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_Carryable_ExplodingObject_Co2Tank_C")
	}
	static class UScript_Carryable_ExplodingObject_Co2Tank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_Carryable_ExplodingObject_Co2Tank_C>();
	}
};
DUMPER7_ASSERTS_UScript_Carryable_ExplodingObject_Co2Tank_C;

}

