#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_VendingMachine_CameraSetup

#include "Basic.hpp"


namespace SDK::Params
{

// Function Script_VendingMachine_CameraSetup.Script_VendingMachine_CameraSetup_C.ExecuteUbergraph_Script_VendingMachine_CameraSetup
// 0x0038 (0x0038 - 0x0000)
struct Script_VendingMachine_CameraSetup_C_ExecuteUbergraph_Script_VendingMachine_CameraSetup final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_Event_OakPC_1;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_1;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_Event_OakPC;                                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_2;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakPlayerController*                   K2Node_GbxActorScriptBoundEvent_OakPC;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   K2Node_GbxActorScriptBoundEvent_OakPC_1;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_VendingMachine_CameraSetup_C_ExecuteUbergraph_Script_VendingMachine_CameraSetup;

// Function Script_VendingMachine_CameraSetup.Script_VendingMachine_CameraSetup_C.GbxActorScriptEvt__OnBeginVending
// 0x0008 (0x0008 - 0x0000)
struct Script_VendingMachine_CameraSetup_C_GbxActorScriptEvt__OnBeginVending final
{
public:
	class AOakPlayerController*                   OakPC;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_VendingMachine_CameraSetup_C_GbxActorScriptEvt__OnBeginVending;

// Function Script_VendingMachine_CameraSetup.Script_VendingMachine_CameraSetup_C.GbxActorScriptEvt__OnEndVending
// 0x0008 (0x0008 - 0x0000)
struct Script_VendingMachine_CameraSetup_C_GbxActorScriptEvt__OnEndVending final
{
public:
	class AOakPlayerController*                   OakPC;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_VendingMachine_CameraSetup_C_GbxActorScriptEvt__OnEndVending;

}

