#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_Door_ZoneTransitionGate

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_Door_ZoneTransitionGate.Script_Door_ZoneTransitionGate_C
// 0x00A8 (0x0148 - 0x00A0)
class UScript_Door_ZoneTransitionGate_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFactHandle*                            ActiveZoneFactHandle;                              // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AZoneTravelStationObject*               ZoneTravelStation;                                 // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FFactAddress                           ActiveZone;                                        // 0x00B8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AOakOverlandTransition*                 OverlandTransitionVolume;                          // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PrepTimer;                                         // 0x00F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ManuallySetNameBannerLocation;                     // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BannerRelativeLocation;                            // 0x0108(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasValidDependency;                                // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakTriggerVolume*                      TutorialVolume;                                    // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      TutorialChallenge;                                 // 0x0130(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DisableZoneFactReaction();
	void EnableZoneFactReaction();
	void ExecuteUbergraph_Script_Door_ZoneTransitionGate(int32 entrypoint);
	void GbxActorScriptEvt__UsableActorState_K2_OnUsed(class AActor* User, EUsabilityType UseType, bool bWasHeld);
	void Locked__OnStateEnabled();
	void On__OnStateEnabled();
	void OnBeginPlay();
	void OnTutorialProximityEnter(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnZoneFactChanged(class UFactHandle* FactHandle);
	void TravelAttemptBlocked(EOakZoneTransitionGate EntryGate);
	void TravelAttemptSucceeded(EOakZoneTransitionGate EntryGate);

	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_Door_ZoneTransitionGate_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_Door_ZoneTransitionGate_C")
	}
	static class UScript_Door_ZoneTransitionGate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_Door_ZoneTransitionGate_C>();
	}
};
DUMPER7_ASSERTS_UScript_Door_ZoneTransitionGate_C;

}

