#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_Lootable_RedChest_Combat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_Lootable_RedChest_Combat.Script_Lootable_RedChest_Combat_C
// 0x0048 (0x00E8 - 0x00A0)
class UScript_Lootable_RedChest_Combat_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFXSystemAsset*                         ShatterParticle;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxParticleParameter>          ShockwaveParameters;                               // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	FGameDataHandleProperty_                      TutorialChallenge;                                 // 0x00C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AGbxCharacter*>                  PlayersInBreakRadius;                              // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ChainsOn__OnStateDisabled();
	void ChainsOn__OnStateEnabled();
	void EvaluatePlayersOnUnlock();
	void ExecuteUbergraph_Script_Lootable_RedChest_Combat(int32 entrypoint);
	void Locked__OnStateDisabled();
	void Locked__OnStateEnabled();
	void OnBeginPlay();
	void OnEnterBreakRadius(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnLeaveBreakRadius(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnTutorialRadiusEnter(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Open__OnStateDisabled();
	void Open__OnStateEnabled();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_Lootable_RedChest_Combat_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_Lootable_RedChest_Combat_C")
	}
	static class UScript_Lootable_RedChest_Combat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_Lootable_RedChest_Combat_C>();
	}
};
DUMPER7_ASSERTS_UScript_Lootable_RedChest_Combat_C;

}

