#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_BossFight_FrackingDrillSite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_BossFight_FrackingDrillSite.Script_BossFight_FrackingDrillSite_C
// 0x00D0 (0x0170 - 0x00A0)
class UScript_BossFight_FrackingDrillSite_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AOakSpawnEncounter*                     BossEncounter;                                     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            bossspawner;                                       // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            BossAddsWave;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            BossAddsSpawner1;                                  // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            bossspawner2;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            bossspawner3;                                      // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            BossAmmoSpawner;                                   // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BossArenaExit;                                     // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          Boss;                                              // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          Boss2;                                             // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter*                          Boss3;                                             // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Boss1Killed;                                       // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Boss2Killed;                                       // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Boss3Killed;                                       // 0x0102(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         BossAddsMarkedForDeath;                            // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AOakSpawner*                            PreBossSpawner1;                                   // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimeUntilBossAdds;                                 // 0x0120(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoKillAddsOnBossDeath;                           // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakSpawner*                            PreBossDrillSpawner1;                              // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            PreBossSpawner2;                                   // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            BossAddsSpawner2;                                  // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<class AOakSpawner*>                    DrillSiteSpawnerList;                              // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AOakSpawner*                            PreBossDrillSpawner2;                              // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            PreBossSpawner3;                                   // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AOakSpawner*                            PreBossDrillSpawner3;                              // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void CE_Boss2Died();
	void CE_Boss2Spawned(class ASpawner* Spawner, class AActor* Actor);
	void CE_Boss3Died();
	void CE_Boss3Spawned(class ASpawner* Spawner, class AActor* Actor);
	void CE_BossDied();
	void CE_BossSpawned(class ASpawner* Spawner, class AActor* Actor);
	void CE_OpenPreWaveSpawned_DoOnce();
	void CE_PreBossWaveSpawned(class ASpawner* Spawner, class AActor* Actor);
	void ExecuteUbergraph_Script_BossFight_FrackingDrillSite(int32 entrypoint);
	void GbxActorScriptEvt__OnBossArenaReset();
	void GbxActorScriptEvt__OnBossFightActive();
	void GbxActorScriptEvt__OnBossFightComplete();
	void GbxActorScriptEvt__OnBossFightPending();
	void OnBeginPlay();
	void SpawnAdds();
	void SpawnAddWave();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_BossFight_FrackingDrillSite_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_BossFight_FrackingDrillSite_C")
	}
	static class UScript_BossFight_FrackingDrillSite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_BossFight_FrackingDrillSite_C>();
	}
};
DUMPER7_ASSERTS_UScript_BossFight_FrackingDrillSite_C;

}

