#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_SpawnMesh_CrawlOut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_SpawnMesh_FogWall_Shape_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_SpawnMesh_CrawlOut.Script_SpawnMesh_CrawlOut_C
// 0x0020 (0x00C8 - 0x00A8)
class UScript_SpawnMesh_CrawlOut_C final : public UGbxActorScript_SpawnPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	Enum_SpawnMesh_FogWall_Shape                  FogWallShape;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FogWallWidth;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FogWallHeight;                                     // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Script_SpawnMesh_CrawlOut(int32 entrypoint);
	void GbxActorScriptEvt__OnSpawnPointSpawned(class ASpawnPoint* SpawnPoint, class AActor* Actor);

	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_SpawnMesh_CrawlOut_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_SpawnMesh_CrawlOut_C")
	}
	static class UScript_SpawnMesh_CrawlOut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_SpawnMesh_CrawlOut_C>();
	}
};
DUMPER7_ASSERTS_UScript_SpawnMesh_CrawlOut_C;

}

