#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_SpawnMesh_Door_Medium

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_SpawnMesh_CharacterAnimStyle_structs.hpp"
#include "Enum_SpawnMesh_Door_Medium_ArtStyle_structs.hpp"
#include "Enum_SpawnMesh_Door_Medium_AnimStyle_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_SpawnMesh_Door_Medium.Script_SpawnMesh_Door_Medium_C
// 0x0060 (0x0108 - 0x00A8)
class UScript_SpawnMesh_Door_Medium_C final : public UGbxActorScript_SpawnPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	Enum_SpawnMesh_CharacterAnimStyle             CharacterAnimationStyle;                           // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_SpawnMesh_Door_Medium_ArtStyle           ArtStyle;                                          // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<FGameDataHandleProperty_, Enum_SpawnMesh_Door_Medium_AnimStyle> ActorDefToAnimStyleMap;     // 0x00B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Script_SpawnMesh_Door_Medium(int32 entrypoint);
	void OnBeginPlay();

	void CheckAnimStyleMatch(bool* IsMatched) const;
	void GetAnimStyleFromActorDef(Enum_SpawnMesh_Door_Medium_AnimStyle* AnimStyle) const;
	void GetDoorStruct(struct FStruct_DoorSmall* MediumDoorStruct) const;
	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_SpawnMesh_Door_Medium_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_SpawnMesh_Door_Medium_C")
	}
	static class UScript_SpawnMesh_Door_Medium_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_SpawnMesh_Door_Medium_C>();
	}
};
DUMPER7_ASSERTS_UScript_SpawnMesh_Door_Medium_C;

}

