#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_IO_CC_EchoLog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGame_structs.hpp"
#include "OakGame_classes.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_IO_CC_EchoLog.Script_IO_CC_EchoLog_C
// 0x0078 (0x01F0 - 0x0178)
class UScript_IO_CC_EchoLog_C final : public UOakChallengeCollectibleScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0178(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AOakPlayerController*                   PlayerController_ForTutorial;                      // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      TutorialChallenge_General;                         // 0x0188(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      TutorialChallenge_Arjay;                           // 0x01A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      TutorialChallenge_VH;                              // 0x01B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             PlayerThatPressedUse;                              // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AOakDrone*                              Echo_4;                                            // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerFailsafe;                                     // 0x01E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AOakPlayerController*                   PlayerControllerThatPressedUse;                    // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Echo4_Arrived(class AOakDrone* Echo4);
	void Echo4_MoveTo(class AActor* MoveTarget);
	void Echo4_SetOrientationMode(bool On_);
	void Echo4_SkipRetrieve();
	void Echo4_Spawn(class AActor* Context, EGbxRelativeLocationType Relative_Location_Type, class FName Location_Option_Socket, const struct FGbxRelativeRotation& Location_Options_Offset_Direction, double Location_Options_Offset_Distance);
	void Echo4EndUse(class AActor* Echo4);
	void ECHO4FailedToSpawn();
	void Echo4StartUse(class AActor* Echo4);
	void Echo_Spawned(class AOakDrone* Echo4);
	void ExecuteUbergraph_Script_IO_CC_EchoLog(int32 entrypoint);
	void FlyTo__OnStateEnabled();
	void GbxActorScriptEvt__UsableActorState_K2_OnUsed(class AActor* User, EUsabilityType UseType, bool bWasHeld);
	void Idle__OnStateDisabled();
	void Idle__OnStateEnabled();
	void OnBeginPlay();
	void OnPerchFinished();
	void OnTutorialVolumeEnter(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void RetrieveE4(double DelayBeforeDigistructingOut);
	void Used__OnStateEnabled();
	void Using__OnStateEnabled();

	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_IO_CC_EchoLog_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_IO_CC_EchoLog_C")
	}
	static class UScript_IO_CC_EchoLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_IO_CC_EchoLog_C>();
	}
};
DUMPER7_ASSERTS_UScript_IO_CC_EchoLog_C;

}

