#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_IO_ExplodingObject_Barrel

#include "Basic.hpp"

#include "OakGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_IO_BarrelElements_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxGame_classes.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_IO_ExplodingObject_Barrel.Script_IO_ExplodingObject_Barrel_C
// 0x0238 (0x02D8 - 0x00A0)
class UScript_IO_ExplodingObject_Barrel_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TimeToCleanup;                                     // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FuseTime;                                          // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FuseTimer;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  instigator;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          StartSimulatingPhysics_;                           // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          RandomElement;                                     // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_IO_BarrelElements                        Element;                                           // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandInt;                                           // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxDestructibleComponent*              Mesh;                                              // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          damage;                                            // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      Damage_Data;                                       // 0x00D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          isLaunched;                                        // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Other_Actor;                                       // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	Enum_IO_BarrelElements                        elementToUse;                                      // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      IncomingDamage_Melee;                              // 0x0108(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      IncomingDamage_Slam;                               // 0x0120(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      IncomingDamage_Slide;                              // 0x0138(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICarrier>              As_Carrier;                                        // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGbxTriggerComponent*                   Trigger;                                           // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Listener;                                          // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0178(0x0140)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         damageradius;                                      // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FGameDataHandleProperty_                      IncomingDamage_Vehicle;                            // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Barrel_Damaged(class AOakInteractiveObject* DamagedOakInteractiveObject, const struct FReceivedDamageDetails& DamageDetails);
	void Barrel_Exploded(class AOakInteractiveObject* ExplodedIOakInteractiveObject);
	void ExecuteUbergraph_Script_IO_ExplodingObject_Barrel(int32 entrypoint);
	void Explode();
	void Exploded__OnStateEnabled();
	void exploding__OnStateDisabled();
	void Exploding__OnStateEnabled();
	void GbxActorScriptEvt__DamageState_OnHealthDepleted(class AActor* DamageReceiver, class AActor* DamageCauser);
	void GbxActorScriptEvt__DamageState_OnTakeAnyDamage(class AActor* DamageReceiver, const struct FReceivedDamageDetails& Details_0);
	void Launch_GroundSlam(class ACharacter* InstigatingCharacter);
	void Launch_Melee(class ACharacter* InstigatingCharacter);
	void Launch_Slide(class ACharacter* InstigatingCharacter);
	void Launch_Vehicle(class ACharacter* InstigatingCharacter);
	void LaunchExplodingObject(const struct FVector& ThrowVector, double force, double X, double Y, double Z, const struct FVector& Additive_Vector);
	void MeshHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnBeginPlay();
	void OnTouchedTrigger(class AActor* TouchingActor, class UPrimitiveComponent* OverlappedComponent);
	void SetToExploding();

	void UpdateBodyElement() const;
	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_IO_ExplodingObject_Barrel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_IO_ExplodingObject_Barrel_C")
	}
	static class UScript_IO_ExplodingObject_Barrel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_IO_ExplodingObject_Barrel_C>();
	}
};
DUMPER7_ASSERTS_UScript_IO_ExplodingObject_Barrel_C;

}

