#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_SiloGrappleableSlider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxAudio_structs.hpp"
#include "GbxGame_classes.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_SiloGrappleableSlider.Script_SiloGrappleableSlider_C
// 0x0060 (0x0100 - 0x00A0)
class UScript_SiloGrappleableSlider_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGbxAudioEvent                         GrappleConnect;                                    // 0x00A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Destination_Index;                                 // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Return_Delay;                                      // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               AttachmentCableMaterial;                           // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Slider_Duration;                                   // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Grappler;                                          // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Script_SiloGrappleableSlider(int32 entrypoint);
	void GbxActorScriptEvt__OnGrapplerDetached(class AActor* Grappler_0, const struct FGrappleableTarget& GrappleTarget);
	void Moving__OnStateEnabled();
	void On_Grappled__Authority_();
	void On_Grappled__Local_();
	void On_Move_Complete();
	void On_Slider_Move_Ended__Local_();
	void OnBeginPlay();
	void PlayGrappleConnect(class AActor* ActorInstigator, const struct FGrappleableTarget& target);
	void SetTimingProperties(double InSliderDuration, double InReturnDelay);
	void SetWorldEndpoints(const struct FVector& SliderStart, const struct FVector& SliderEnd);
	void Stationary__OnStateEnabled();
	void Toggle_Third_Person_FX__Authority_(bool bEnabled, class AActor* InGrapplerActor);
	void TryMoveTo(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_SiloGrappleableSlider_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_SiloGrappleableSlider_C")
	}
	static class UScript_SiloGrappleableSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_SiloGrappleableSlider_C>();
	}
};
DUMPER7_ASSERTS_UScript_SiloGrappleableSlider_C;

}

