#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_IO_Radio

#include "Basic.hpp"

#include "GbxGame_structs.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK::Params
{

// Function Script_IO_Radio.Script_IO_Radio_C.ExecuteUbergraph_Script_IO_Radio
// 0x02C8 (0x02C8 - 0x0000)
struct Script_IO_Radio_C_ExecuteUbergraph_Script_IO_Radio final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_DamageReceiver;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_GbxActorScriptBoundEvent_Details;           // 0x0010(0x0140)(ConstParm, ContainsInstancedReference)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamageReceiver;                       // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 K2Node_Event_Details;                              // 0x0160(0x0140)(ConstParm, ContainsInstancedReference)
	struct FGbxActorStateMachineKey               Temp_struct_Variable;                              // 0x02A0(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_1;                            // 0x02AC(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorStateAsBool_ReturnValue;          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorStateAsBool_ReturnValue_1;        // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakInteractiveObject*                  CallFunc_GetAssociatedActor_ReturnValue;           // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Script_IO_Radio_C_ExecuteUbergraph_Script_IO_Radio;

// Function Script_IO_Radio.Script_IO_Radio_C.GbxActorScriptEvt__DamageState_OnTakeAnyDamage
// 0x0148 (0x0148 - 0x0000)
struct Script_IO_Radio_C_GbxActorScriptEvt__DamageState_OnTakeAnyDamage final
{
public:
	class AActor*                                 DamageReceiver;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FReceivedDamageDetails                 Details;                                           // 0x0008(0x0140)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Script_IO_Radio_C_GbxActorScriptEvt__DamageState_OnTakeAnyDamage;

}

