#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_IO_ExplodingObject_MissileBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_IO_ExplodingObject_MissileBox.Script_IO_ExplodingObject_MissileBox_C
// 0x00F8 (0x0198 - 0x00A0)
class UScript_IO_ExplodingObject_MissileBox_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         TimeToCleanup;                                     // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FuseTime;                                          // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      Damage_Data_Enemies;                               // 0x00B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          isLaunched;                                        // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICarrier>              As_Carrier;                                        // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ExplodeVelocity;                                   // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFactAddress                           Fact_Address;                                      // 0x00F8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         MissileScore;                                      // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThrownFuseTime;                                    // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurLoops;                                          // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayBWBursts;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        min_0;                                             // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MAX;                                               // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FlyingDistance;                                    // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             instigator;                                        // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FGameDataHandleProperty_                      Damage_Data_Players;                               // 0x0168(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FImpactEffectSelection                 BoxOfMissilesExpOverride;                          // 0x0180(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void damageable__OnStateEnabled();
	void ExecuteUbergraph_Script_IO_ExplodingObject_MissileBox(int32 entrypoint);
	void Explode();
	void Exploded__OnStateEnabled();
	void Exploding__OnStateEnabled();
	void GbxActorScriptEvt__DamageState_OnHealthDepleted(class AActor* DamageReceiver, class AActor* DamageCauser);
	void GbxActorScriptEvt__DamageState_OnTakeAnyDamage(class AActor* DamageReceiver, const struct FReceivedDamageDetails& Details);
	void LaunchExplodingObject(const struct FVector& ThrowVector, double force, double X, double Y, double Z, const struct FVector& Additive_Vector);
	void OnBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_IO_ExplodingObject_MissileBox_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_IO_ExplodingObject_MissileBox_C")
	}
	static class UScript_IO_ExplodingObject_MissileBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_IO_ExplodingObject_MissileBox_C>();
	}
};
DUMPER7_ASSERTS_UScript_IO_ExplodingObject_MissileBox_C;

}

