#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_VendingMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_IO_VendingMachine_MenuActions_structs.hpp"
#include "GbxGame_classes.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_VendingMachine.Script_VendingMachine_C
// 0x00B0 (0x0150 - 0x00A0)
class UScript_VendingMachine_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AGbxCharacter*                          UserCharacter;                                     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AOakDrone*                              Echo4;                                             // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AGbxCharacter*                          Echo4Owner;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AGbxCharacter*>                  PlayersUsingMachine;                               // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	uint8                                         Echo4Trick_ID;                                     // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGbxTrick*                              Echo4_BuyTrick_1;                                  // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_BuyTrick_2;                                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_BuyTrick_3;                                  // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_BuyTrick_4;                                  // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_BuyTrick_5;                                  // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_SellTrick_1;                                 // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_SellTrick_2;                                 // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_SellTrick_3;                                 // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_SellTrick_4;                                 // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_NoMoneyTrick_1;                              // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_NoMoneyTrick_2;                              // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_RefillTrick_1;                               // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_RefillTrick_2;                               // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_RefillTrick_3;                               // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGbxTrick*                              Echo4_BuyTrick_MakeItRain;                         // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Active__OnStateEnabled();
	void Echo4_Arrived(class AOakDrone* Echo4_0);
	void Echo4_MoveTo(class AActor* MoveTarget);
	void Echo4_SetOrientationMode(bool On_);
	void Echo4_SkipRetrieve();
	void Echo4_Spawn(class AActor* Context, EGbxRelativeLocationType Relative_Location_Type, class FName Location_Option_Socket, const struct FGbxRelativeRotation& Location_Options_Offset_Direction, double Location_Options_Offset_Distance);
	void Echo_Spawned(class AOakDrone* Echo4_0);
	void ExecuteUbergraph_Script_VendingMachine(int32 entrypoint);
	void GbxActorScriptEvt__OnActorBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void GbxActorScriptEvt__OnActorEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void GbxActorScriptEvt__OnBuyItem_ScriptEvent(class AOakPlayerController* player, bool bBuyback);
	void GbxActorScriptEvt__OnEcho4DeploymentReady(class AOakPlayerController* OakPC);
	void GbxActorScriptEvt__OnInsufficientFunds_ScriptEvent(class AOakPlayerController* player);
	void GbxActorScriptEvt__OnIOTDSpawned_ScriptEvent();
	void GbxActorScriptEvt__OnProximityChanged_ScriptEvent(bool bPlayersInProximity);
	void GbxActorScriptEvt__OnRefillAmmo_ScriptEvent(class AOakPlayerController* player);
	void GbxActorScriptEvt__OnSellAllJunk_ScriptEvent(class AOakPlayerController* player);
	void GbxActorScriptEvt__OnSellItem_ScriptEvent(class AOakPlayerController* player);
	void GbxActorScriptEvt__OnShopShuffled_ScriptEvent();
	void Inactive__OnStateEnabled();
	void InUse__OnStateDisabled();
	void InUse__OnStateEnabled();
	void OnBeginPlay();
	void OnVendBegin(class AOakPlayerController* OakPC);
	void OnVendEnd(class AOakPlayerController* OakPC);
	void PlayVO(Enum_IO_VendingMachine_MenuActions VendingAction);
	void RetrieveE4(double DelayBeforeDigistructingOut);
	void SpawnAndSetEcho4(class AOakCharacter* player);
	void UpdateAnimState();
	void UpdatePlayersUsingMachine(class AGbxCharacter* player, bool Remove);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_VendingMachine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_VendingMachine_C")
	}
	static class UScript_VendingMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_VendingMachine_C>();
	}
};
DUMPER7_ASSERTS_UScript_VendingMachine_C;

}

