#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_IO_Switch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Enum_SwitchType_structs.hpp"
#include "GbxGame_classes.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK
{

// GbxActorScriptClass Script_IO_Switch.Script_IO_Switch_C
// 0x0028 (0x00C8 - 0x00A0)
class UScript_IO_Switch_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	Enum_SwitchType                               SwitchType;                                        // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeBeforeNextUse;                                 // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           timer_Reset;                                       // 0x00B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AOakInteractiveObject*                  Elevator;                                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Switch_ID;                                         // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsElevatorSwitch;                                  // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AssignElevatorVarsToSwitch(class AOakInteractiveObject* Elevator_0, int32 SwitchID);
	void ExecuteUbergraph_Script_IO_Switch(int32 entrypoint);
	void InteractiveFromReset();
	void pressed__OnStateDisabled();
	void pressed__OnStateEnabled();
	void ResetToggle();
	void SwitchCallElevator(int32 SwitchID);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_IO_Switch_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_IO_Switch_C")
	}
	static class UScript_IO_Switch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_IO_Switch_C>();
	}
};
DUMPER7_ASSERTS_UScript_IO_Switch_C;

}

