#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_BossReplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_BossReplay.Script_BossReplay_C
// 0x0058 (0x00F8 - 0x00A0)
class UScript_BossReplay_C final : public UGbxActorScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AOakBossFight*                          BossFightInfo;                                     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	FGbxDefPtrProperty_                           BossDisplayName;                                   // 0x00B0(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class ASoloTravelStationObject*               BossReplayPortal;                                  // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugAlwaysEligibleForReplay;                      // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugAlwaysEligibleForTrueBoss;                    // 0x00D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           TestAttribute;                                     // 0x00D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFactHandle*                            HostCost_Normal;                                   // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Available__OnStateEnabled();
	void CE_AllPlayersLeaveArena();
	void CE_AnyPlayersEnterArena(class AOakCharacter* Character);
	void CE_BFI_Active();
	void CE_BFI_Complete();
	void CE_BFI_Inactive();
	void CE_BFI_Pending();
	void CE_EvaluateArenaForPlayers();
	void EligibleForReplay__OnStateDisabled();
	void EligibleForReplay__OnStateEnabled();
	void EligibleForTrueBoss__OnStateEnabled();
	void ExecuteUbergraph_Script_BossReplay(int32 entrypoint);
	void FightPending__OnStateEnabled();
	void GbxActorScriptEvt__UsableActorState_K2_OnUsed(class AActor* User, EUsabilityType UseType, bool bWasHeld);
	void isReplayEligible(bool* TrueBossEligible);
	void isTrueBossEligible(bool* TrueBossEligible);
	void OnBeginPlay();
	void ShouldDoDigistructPresentation(bool* ShouldDoPresentation);
	void UpdateBossDisplayName(FGbxDefPtrProperty_ DisplayName);

	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_BossReplay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_BossReplay_C")
	}
	static class UScript_BossReplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_BossReplay_C>();
	}
};
DUMPER7_ASSERTS_UScript_BossReplay_C;

}

