#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_SpawnMesh_DrillNEWSmall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxActorScriptClass Script_SpawnMesh_DrillNEWSmall.Script_SpawnMesh_DrillNEWSmall_C
// 0x0060 (0x0178 - 0x0118)
class UScript_SpawnMesh_DrillNEWSmall_C final : public UGbxActorScript_DeliverySpawnPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0118(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Door1Enabled;                                      // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Door2Enabled;                                      // 0x0121(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Door3Enabled;                                      // 0x0122(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DrillRotationLimit;                                // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakSpawnPointComponent*                SpawnPoint_Small1;                                 // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOakSpawnPointComponent*                SpawnPoint_Small2;                                 // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOakSpawnPointComponent*                SpawnPoint_Small3;                                 // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOakSpawnPointComponent*                SpawnPoint_Medium1;                                // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOakSpawnPointComponent*                SpawnPoint_Medium2;                                // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOakSpawnPointComponent*                SpawnPoint_Medium3;                                // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOakSpawnPointComponent*                SpawnPoint_MediumAndSmall1;                        // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOakSpawnPointComponent*                SpawnPoint_MediumAndSmall2;                        // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOakSpawnPointComponent*                SpawnPoint_MediumAndSmall3;                        // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CE_OnSpawned_Small1(class USpawnPointComponent* SpawnPoint, class AActor* Actor);
	void CE_OnSpawned_Small2(class USpawnPointComponent* SpawnPoint, class AActor* Actor);
	void CE_OnSpawned_Small3(class USpawnPointComponent* SpawnPoint, class AActor* Actor);
	void ExecuteUbergraph_Script_SpawnMesh_DrillNEWSmall(int32 entrypoint);
	void GbxActorScriptEvt__OnCompleted();
	void GbxActorScriptEvt__OnStart();
	void OnBeginPlay();

	void UserConstructionScript(class AActor* Actor) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Script_SpawnMesh_DrillNEWSmall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Script_SpawnMesh_DrillNEWSmall_C")
	}
	static class UScript_SpawnMesh_DrillNEWSmall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScript_SpawnMesh_DrillNEWSmall_C>();
	}
};
DUMPER7_ASSERTS_UScript_SpawnMesh_DrillNEWSmall_C;

}

