#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Script_Sequence_Grapple_Point

#include "Basic.hpp"

#include "GbxAudio_structs.hpp"
#include "OakGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Script_Sequence_Grapple_Point.Script_Sequence_Grapple_Point_C.ExecuteUbergraph_Script_Sequence_Grapple_Point
// 0x0430 (0x0430 - 0x0000)
struct Script_Sequence_Grapple_Point_C_ExecuteUbergraph_Script_Sequence_Grapple_Point final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Grappler_1;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGrappleableTarget                     K2Node_Event_GrappleTarget_1;                      // 0x0010(0x00C0)(ConstParm, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsScriptStateEnabled_ReturnValue_1;       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Grappler;                             // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGrappleableTarget                     K2Node_Event_GrappleTarget;                        // 0x00E0(0x00C0)(ConstParm, NoDestructor, ContainsInstancedReference)
	class AGrapplePoint*                          CallFunc_GetAssociatedActor_ReturnValue;           // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_Grappler;          // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGrappleableTarget                     K2Node_GbxActorScriptBoundEvent_GrappleTarget;     // 0x01B0(0x00C0)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0270(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAudioEmitterSource                 K2Node_MakeStruct_GbxAudioEmitterSource;           // 0x02D0(0x0080)(NoDestructor)
	struct FGbxAudioPlaybackInstance              CallFunc_PostEventInWorld_ReturnValue;             // 0x0350(0x0018)()
	class AActor*                                 K2Node_GbxActorScriptBoundEvent_Grappler_1;        // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGrappleableTarget                     K2Node_GbxActorScriptBoundEvent_GrappleTarget_1;   // 0x0370(0x00C0)(ConstParm, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Script_Sequence_Grapple_Point_C_ExecuteUbergraph_Script_Sequence_Grapple_Point;

// Function Script_Sequence_Grapple_Point.Script_Sequence_Grapple_Point_C.GbxActorScriptEvt__OnGrapplerAttached
// 0x00D0 (0x00D0 - 0x0000)
struct Script_Sequence_Grapple_Point_C_GbxActorScriptEvt__OnGrapplerAttached final
{
public:
	class AActor*                                 Grappler;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrappleableTarget                     GrappleTarget;                                     // 0x0010(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Script_Sequence_Grapple_Point_C_GbxActorScriptEvt__OnGrapplerAttached;

// Function Script_Sequence_Grapple_Point.Script_Sequence_Grapple_Point_C.GbxActorScriptEvt__OnGrapplerDetached
// 0x00D0 (0x00D0 - 0x0000)
struct Script_Sequence_Grapple_Point_C_GbxActorScriptEvt__OnGrapplerDetached final
{
public:
	class AActor*                                 Grappler;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrappleableTarget                     GrappleTarget;                                     // 0x0010(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_Script_Sequence_Grapple_Point_C_GbxActorScriptEvt__OnGrapplerDetached;

}

