#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Seq_CommandConsole_Open

#include "Basic.hpp"


namespace SDK::Params
{

// Function Seq_CommandConsole_Open.Seq_CommandConsole_Open_DirectorBP_C.ExecuteUbergraph_Seq_CommandConsole_Open_DirectorBP
// 0x0030 (0x0030 - 0x0000)
struct Seq_CommandConsole_Open_DirectorBP_C_ExecuteUbergraph_Seq_CommandConsole_Open_DirectorBP final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AInteractiveSwitch*                     K2Node_CustomEvent_InteractiveSwitch__GbxActorDef_io_switch_commandconsole_; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_GraphName;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnabled;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGbxActorScriptInterface> CallFunc_SetScriptStateEnabled_self_CastInput;  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_CommandConsole_Open_DirectorBP_C_ExecuteUbergraph_Seq_CommandConsole_Open_DirectorBP;

// Function Seq_CommandConsole_Open.Seq_CommandConsole_Open_DirectorBP_C.InteractiveSwitch_(GbxActorDef_io_switch_commandconsole)_Event
// 0x0018 (0x0018 - 0x0000)
struct Seq_CommandConsole_Open_DirectorBP_C_InteractiveSwitch__GbxActorDef_io_switch_commandconsole__Event final
{
public:
	class AInteractiveSwitch*                     InteractiveSwitch__GbxActorDef_io_switch_commandconsole_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   GraphName;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_CommandConsole_Open_DirectorBP_C_InteractiveSwitch__GbxActorDef_io_switch_commandconsole__Event;

// Function Seq_CommandConsole_Open.Seq_CommandConsole_Open_DirectorBP_C.SequenceEvent__ENTRYPOINTSeq_CommandConsole_Open_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct Seq_CommandConsole_Open_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_CommandConsole_Open_DirectorBP final
{
public:
	class AInteractiveSwitch*                     InteractiveSwitch__GbxActorDef_io_switch_commandconsole_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_CommandConsole_Open_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_CommandConsole_Open_DirectorBP;

}

