#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Seq_LostCapsule_DecryptStation

#include "Basic.hpp"

#include "GbxEngine_structs.hpp"


namespace SDK::Params
{

// Function Seq_LostCapsule_DecryptStation.Seq_LostCapsule_DecryptStation_DirectorBP_C.CarryableObjectContainer_(GbxActorDef_IO_LostCapsule_DecryptStation)_Event
// 0x0008 (0x0008 - 0x0000)
struct Seq_LostCapsule_DecryptStation_DirectorBP_C_CarryableObjectContainer__GbxActorDef_IO_LostCapsule_DecryptStation__Event final
{
public:
	class ACarryableObjectContainer*              CarryableObjectContainer__GbxActorDef_IO_LostCapsule_DecryptStation_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_LostCapsule_DecryptStation_DirectorBP_C_CarryableObjectContainer__GbxActorDef_IO_LostCapsule_DecryptStation__Event;

// Function Seq_LostCapsule_DecryptStation.Seq_LostCapsule_DecryptStation_DirectorBP_C.ExecuteUbergraph_Seq_LostCapsule_DecryptStation_DirectorBP
// 0x0030 (0x0030 - 0x0000)
struct Seq_LostCapsule_DecryptStation_DirectorBP_C_ExecuteUbergraph_Seq_LostCapsule_DecryptStation_DirectorBP final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObjectContainer*              K2Node_CustomEvent_CarryableObjectContainer__GbxActorDef_IO_LostCapsule_DecryptStation_; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineStateKey          Temp_struct_Variable;                              // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_1;                            // 0x001C(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorState_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_LostCapsule_DecryptStation_DirectorBP_C_ExecuteUbergraph_Seq_LostCapsule_DecryptStation_DirectorBP;

// Function Seq_LostCapsule_DecryptStation.Seq_LostCapsule_DecryptStation_DirectorBP_C.SequenceEvent__ENTRYPOINTSeq_LostCapsule_DecryptStation_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct Seq_LostCapsule_DecryptStation_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_LostCapsule_DecryptStation_DirectorBP final
{
public:
	class ACarryableObjectContainer*              CarryableObjectContainer__GbxActorDef_IO_LostCapsule_DecryptStation_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_LostCapsule_DecryptStation_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_LostCapsule_DecryptStation_DirectorBP;

}

