#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Seq_IO_Evocarium_Beacon

#include "Basic.hpp"

#include "GbxEngine_structs.hpp"


namespace SDK::Params
{

// Function Seq_IO_Evocarium_Beacon.Seq_IO_Evocarium_Beacon_DirectorBP_C.ExecuteUbergraph_Seq_IO_Evocarium_Beacon_DirectorBP
// 0x0048 (0x0048 - 0x0000)
struct Seq_IO_Evocarium_Beacon_DirectorBP_C_ExecuteUbergraph_Seq_IO_Evocarium_Beacon_DirectorBP final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable;                              // 0x0004(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_1;                            // 0x0010(0x000C)(NoDestructor, HasGetValueTypeHash)
	struct FGbxActorStateMachineKey               Temp_struct_Variable_2;                            // 0x001C(0x000C)(NoDestructor, HasGetValueTypeHash)
	class AInteractiveSwitch*                     K2Node_CustomEvent_InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon__1; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorStateAsBool_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorStateAsBool_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AInteractiveSwitch*                     K2Node_CustomEvent_InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon_; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetActorStateAsBool_ReturnValue_2;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_IO_Evocarium_Beacon_DirectorBP_C_ExecuteUbergraph_Seq_IO_Evocarium_Beacon_DirectorBP;

// Function Seq_IO_Evocarium_Beacon.Seq_IO_Evocarium_Beacon_DirectorBP_C.InteractiveSwitch_(GbxActorDef_IO_Switch_Evocarium_Beacon)_Event
// 0x0008 (0x0008 - 0x0000)
struct Seq_IO_Evocarium_Beacon_DirectorBP_C_InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon__Event final
{
public:
	class AInteractiveSwitch*                     InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_IO_Evocarium_Beacon_DirectorBP_C_InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon__Event;

// Function Seq_IO_Evocarium_Beacon.Seq_IO_Evocarium_Beacon_DirectorBP_C.InteractiveSwitch_(GbxActorDef_IO_Switch_Evocarium_Beacon)_Event_0
// 0x0008 (0x0008 - 0x0000)
struct Seq_IO_Evocarium_Beacon_DirectorBP_C_InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon__Event_0 final
{
public:
	class AInteractiveSwitch*                     InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_IO_Evocarium_Beacon_DirectorBP_C_InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon__Event_0;

// Function Seq_IO_Evocarium_Beacon.Seq_IO_Evocarium_Beacon_DirectorBP_C.SequenceEvent__ENTRYPOINTSeq_IO_Evocarium_Beacon_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct Seq_IO_Evocarium_Beacon_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_IO_Evocarium_Beacon_DirectorBP final
{
public:
	class AInteractiveSwitch*                     InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_IO_Evocarium_Beacon_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_IO_Evocarium_Beacon_DirectorBP;

// Function Seq_IO_Evocarium_Beacon.Seq_IO_Evocarium_Beacon_DirectorBP_C.SequenceEvent__ENTRYPOINTSeq_IO_Evocarium_Beacon_DirectorBP_0
// 0x0008 (0x0008 - 0x0000)
struct Seq_IO_Evocarium_Beacon_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_IO_Evocarium_Beacon_DirectorBP_0 final
{
public:
	class AInteractiveSwitch*                     InteractiveSwitch__GbxActorDef_IO_Switch_Evocarium_Beacon_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_IO_Evocarium_Beacon_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_IO_Evocarium_Beacon_DirectorBP_0;

}

