#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Seq_MeteorDestroyer_Railgun_Lid

#include "Basic.hpp"


namespace SDK::Params
{

// Function Seq_MeteorDestroyer_Railgun_Lid.Seq_MeteorDestroyer_Railgun_Lid_DirectorBP_C.CarryableObjectContainer_(BodyData_Body_Carryable_Container_Meteor_Destroyer_Railgun)_Event
// 0x0008 (0x0008 - 0x0000)
struct Seq_MeteorDestroyer_Railgun_Lid_DirectorBP_C_CarryableObjectContainer__BodyData_Body_Carryable_Container_Meteor_Destroyer_Railgun__Event final
{
public:
	class ACarryableObjectContainer*              CarryableObjectContainer__BodyData_Body_Carryable_Container_Meteor_Destroyer_Railgun_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_MeteorDestroyer_Railgun_Lid_DirectorBP_C_CarryableObjectContainer__BodyData_Body_Carryable_Container_Meteor_Destroyer_Railgun__Event;

// Function Seq_MeteorDestroyer_Railgun_Lid.Seq_MeteorDestroyer_Railgun_Lid_DirectorBP_C.ExecuteUbergraph_Seq_MeteorDestroyer_Railgun_Lid_DirectorBP
// 0x0010 (0x0010 - 0x0000)
struct Seq_MeteorDestroyer_Railgun_Lid_DirectorBP_C_ExecuteUbergraph_Seq_MeteorDestroyer_Railgun_Lid_DirectorBP final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACarryableObjectContainer*              K2Node_CustomEvent_CarryableObjectContainer__BodyData_Body_Carryable_Container_Meteor_Destroyer_Railgun_; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_MeteorDestroyer_Railgun_Lid_DirectorBP_C_ExecuteUbergraph_Seq_MeteorDestroyer_Railgun_Lid_DirectorBP;

// Function Seq_MeteorDestroyer_Railgun_Lid.Seq_MeteorDestroyer_Railgun_Lid_DirectorBP_C.SequenceEvent__ENTRYPOINTSeq_MeteorDestroyer_Railgun_Lid_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct Seq_MeteorDestroyer_Railgun_Lid_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_MeteorDestroyer_Railgun_Lid_DirectorBP final
{
public:
	class ACarryableObjectContainer*              CarryableObjectContainer__BodyData_Body_Carryable_Container_Meteor_Destroyer_Railgun_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_MeteorDestroyer_Railgun_Lid_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_MeteorDestroyer_Railgun_Lid_DirectorBP;

}

