#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Seq_SiloBase_Deployed_10000

#include "Basic.hpp"


namespace SDK::Params
{

// Function Seq_SiloBase_Deployed_10000.Seq_SiloBase_Deployed_10000_DirectorBP_C.ExecuteUbergraph_Seq_SiloBase_Deployed_10000_DirectorBP
// 0x0020 (0x0020 - 0x0000)
struct Seq_SiloBase_Deployed_10000_DirectorBP_C_ExecuteUbergraph_Seq_SiloBase_Deployed_10000_DirectorBP final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASiloBaseObject*                        K2Node_CustomEvent_SiloBaseObject__GbxActorDef_IO_SiloBase_; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGbxActorScriptInterface> CallFunc_SetScriptStateEnabled_self_CastInput;  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_SiloBase_Deployed_10000_DirectorBP_C_ExecuteUbergraph_Seq_SiloBase_Deployed_10000_DirectorBP;

// Function Seq_SiloBase_Deployed_10000.Seq_SiloBase_Deployed_10000_DirectorBP_C.SequenceEvent__ENTRYPOINTSeq_SiloBase_Deployed_10000_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct Seq_SiloBase_Deployed_10000_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_SiloBase_Deployed_10000_DirectorBP final
{
public:
	class ASiloBaseObject*                        SiloBaseObject__GbxActorDef_IO_SiloBase_;          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_SiloBase_Deployed_10000_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_SiloBase_Deployed_10000_DirectorBP;

// Function Seq_SiloBase_Deployed_10000.Seq_SiloBase_Deployed_10000_DirectorBP_C.SiloBaseObject_(GbxActorDef_IO_SiloBase)_Event
// 0x0008 (0x0008 - 0x0000)
struct Seq_SiloBase_Deployed_10000_DirectorBP_C_SiloBaseObject__GbxActorDef_IO_SiloBase__Event final
{
public:
	class ASiloBaseObject*                        SiloBaseObject__GbxActorDef_IO_SiloBase_;          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_SiloBase_Deployed_10000_DirectorBP_C_SiloBaseObject__GbxActorDef_IO_SiloBase__Event;

}

