#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Seq_FastTravelStation_LockedState

#include "Basic.hpp"

#include "GbxAudio_structs.hpp"


namespace SDK::Params
{

// Function Seq_FastTravelStation_LockedState.Seq_FastTravelStation_LockedState_DirectorBP_C.ExecuteUbergraph_Seq_FastTravelStation_LockedState_DirectorBP
// 0x0048 (0x0048 - 0x0000)
struct Seq_FastTravelStation_LockedState_DirectorBP_C_ExecuteUbergraph_Seq_FastTravelStation_LockedState_DirectorBP final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFastTravelStationObject*               K2Node_CustomEvent_FastTravelStationObject__GbxActorDef_FastTravelStation_; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAudioPlaybackInstance              CallFunc_PostWwiseEventOnActor_ReturnValue;        // 0x0018(0x0018)()
	struct FGbxAudioPlaybackInstance              CallFunc_PostWwiseEventOnActor_ReturnValue_1;      // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_Seq_FastTravelStation_LockedState_DirectorBP_C_ExecuteUbergraph_Seq_FastTravelStation_LockedState_DirectorBP;

// Function Seq_FastTravelStation_LockedState.Seq_FastTravelStation_LockedState_DirectorBP_C.PlayDeactivationAudio
// 0x0008 (0x0008 - 0x0000)
struct Seq_FastTravelStation_LockedState_DirectorBP_C_PlayDeactivationAudio final
{
public:
	class AFastTravelStationObject*               FastTravelStationObject__GbxActorDef_FastTravelStation_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_FastTravelStation_LockedState_DirectorBP_C_PlayDeactivationAudio;

// Function Seq_FastTravelStation_LockedState.Seq_FastTravelStation_LockedState_DirectorBP_C.SequenceEvent__ENTRYPOINTSeq_FastTravelStation_LockedState_DirectorBP
// 0x0008 (0x0008 - 0x0000)
struct Seq_FastTravelStation_LockedState_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_FastTravelStation_LockedState_DirectorBP final
{
public:
	class AFastTravelStationObject*               FastTravelStationObject__GbxActorDef_FastTravelStation_; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Seq_FastTravelStation_LockedState_DirectorBP_C_SequenceEvent__ENTRYPOINTSeq_FastTravelStation_LockedState_DirectorBP;

}

