#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShiftUI

#include "Basic.hpp"


namespace SDK::Params
{

// Function ShiftUI.ShiftUIFunctionLibrary.AddAccountLinkedDelegate
// 0x0010 (0x0010 - 0x0000)
struct ShiftUIFunctionLibrary_AddAccountLinkedDelegate final
{
public:
	TDelegate<void(int32 LocalUserNum)>           Delegate;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_AddAccountLinkedDelegate;

// Function ShiftUI.ShiftUIFunctionLibrary.AddHideDelegate
// 0x0010 (0x0010 - 0x0000)
struct ShiftUIFunctionLibrary_AddHideDelegate final
{
public:
	TDelegate<void(bool bBlocked)>                Delegate;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_AddHideDelegate;

// Function ShiftUI.ShiftUIFunctionLibrary.AddShowDelegate
// 0x0010 (0x0010 - 0x0000)
struct ShiftUIFunctionLibrary_AddShowDelegate final
{
public:
	TDelegate<void(bool bUnblocked)>              Delegate;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_AddShowDelegate;

// Function ShiftUI.ShiftUIFunctionLibrary.Block
// 0x0008 (0x0008 - 0x0000)
struct ShiftUIFunctionLibrary_Block final
{
public:
	class FName                                   reason;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_Block;

// Function ShiftUI.ShiftUIFunctionLibrary.IsBlockingEnabled
// 0x0001 (0x0001 - 0x0000)
struct ShiftUIFunctionLibrary_IsBlockingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_IsBlockingEnabled;

// Function ShiftUI.ShiftUIFunctionLibrary.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct ShiftUIFunctionLibrary_IsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_IsInitialized;

// Function ShiftUI.ShiftUIFunctionLibrary.IsVisible
// 0x0001 (0x0001 - 0x0000)
struct ShiftUIFunctionLibrary_IsVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_IsVisible;

// Function ShiftUI.ShiftUIFunctionLibrary.Open
// 0x0004 (0x0004 - 0x0000)
struct ShiftUIFunctionLibrary_Open final
{
public:
	int32                                         LocalUserNum;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_Open;

// Function ShiftUI.ShiftUIFunctionLibrary.RemoveAccountLinkedDelegate
// 0x0010 (0x0010 - 0x0000)
struct ShiftUIFunctionLibrary_RemoveAccountLinkedDelegate final
{
public:
	TDelegate<void(int32 LocalUserNum)>           Delegate;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_RemoveAccountLinkedDelegate;

// Function ShiftUI.ShiftUIFunctionLibrary.RemoveHideDelegate
// 0x0010 (0x0010 - 0x0000)
struct ShiftUIFunctionLibrary_RemoveHideDelegate final
{
public:
	TDelegate<void(bool bBlocked)>                Delegate;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_RemoveHideDelegate;

// Function ShiftUI.ShiftUIFunctionLibrary.RemoveShowDelegate
// 0x0010 (0x0010 - 0x0000)
struct ShiftUIFunctionLibrary_RemoveShowDelegate final
{
public:
	TDelegate<void(bool bUnblocked)>              Delegate;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_RemoveShowDelegate;

// Function ShiftUI.ShiftUIFunctionLibrary.SetBlockingEnabled
// 0x0001 (0x0001 - 0x0000)
struct ShiftUIFunctionLibrary_SetBlockingEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_SetBlockingEnabled;

// Function ShiftUI.ShiftUIFunctionLibrary.Unblock
// 0x0008 (0x0008 - 0x0000)
struct ShiftUIFunctionLibrary_Unblock final
{
public:
	class FName                                   reason;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftUIFunctionLibrary_Unblock;

}

