#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shift

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "Shift_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class Shift.AuthTicketTicker
// 0x0018 (0x0040 - 0x0028)
class UAuthTicketTicker final : public UObject
{
public:
	class UShiftSession*                          Session;                                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AuthTicketTicker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AuthTicketTicker")
	}
	static class UAuthTicketTicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAuthTicketTicker>();
	}
};
DUMPER7_ASSERTS_UAuthTicketTicker;

// Class Shift.ShiftFPSHistogram
// 0x0128 (0x0150 - 0x0028)
class UShiftFPSHistogram final : public UObject
{
public:
	uint8                                         Pad_28[0x128];                                     // 0x0028(0x0128)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ShiftFPSHistogram")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShiftFPSHistogram")
	}
	static class UShiftFPSHistogram* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShiftFPSHistogram>();
	}
};
DUMPER7_ASSERTS_UShiftFPSHistogram;

// Class Shift.ShiftFPSHistogramSettings
// 0x00A0 (0x00D8 - 0x0038)
class UShiftFPSHistogramSettings final : public UDeveloperSettings
{
public:
	struct FShiftFPSHistogramInitParams           InitParams;                                        // 0x0038(0x0080)(Edit, Config, NativeAccessSpecifierPublic)
	TArray<struct FShiftFPSHistogramBucket>       DefaultBuckets;                                    // 0x00B8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<struct FShiftFPSConstant>              Constants;                                         // 0x00C8(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ShiftFPSHistogramSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShiftFPSHistogramSettings")
	}
	static class UShiftFPSHistogramSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShiftFPSHistogramSettings>();
	}
};
DUMPER7_ASSERTS_UShiftFPSHistogramSettings;

// Class Shift.ShiftFPSHistogramBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UShiftFPSHistogramBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FShiftFPSHistogramInitParams GetFPSInitParamsForAutomation();
	static bool InitFPSTelemetry(class UObject* WorldContextObject, const struct FShiftFPSHistogramInitParams& InInitParams);
	static void ReportFPSAggregate(const class FString& CustomKey, const class FString& Context);
	static void ReportFPSHistogram();
	static void ResetFPSAggregate();
	static void ResetFPSConstant(class FName InName, EShiftFPSConstant InType);
	static void ResetFPSConstants();
	static void ResetFPSHistogram();
	static void SetFPSConstantFloat(class FName InName, double Value);
	static void SetFPSConstantInteger(class FName InName, int32 Value);
	static void SetFPSConstantString(class FName InName, const class FString& Value);
	static void ShutdownFPSTelemetry();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ShiftFPSHistogramBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShiftFPSHistogramBlueprintLibrary")
	}
	static class UShiftFPSHistogramBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShiftFPSHistogramBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UShiftFPSHistogramBlueprintLibrary;

// Class Shift.ShiftService
// 0x00F8 (0x0120 - 0x0028)
class UShiftService final : public UObject
{
public:
	uint8                                         Pad_28[0xF0];                                      // 0x0028(0x00F0)(Fixing Size After Last Property [ Dumper-7 ])
	class UShiftSessionManager*                   SessionManager;                                    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ShiftService")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShiftService")
	}
	static class UShiftService* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShiftService>();
	}
};
DUMPER7_ASSERTS_UShiftService;

// Class Shift.ShiftSession
// 0x0358 (0x0380 - 0x0028)
class UShiftSession final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientTelemetry                       ClientTelemetry;                                   // 0x0040(0x0088)(NativeAccessSpecifierPublic)
	struct FServerTelemetry                       ServerTelemetry;                                   // 0x00C8(0x0028)(NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisplayName;                                       // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_110[0x118];                                    // 0x0110(0x0118)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 shiftid;                                           // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShiftAccountId                               ShiftAccountId;                                    // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShiftAuthToken                        ShiftAuthToken;                                    // 0x0250(0x0020)(NativeAccessSpecifierPublic)
	uint8                                         Pad_270[0x110];                                    // 0x0270(0x0110)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ShiftSession")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShiftSession")
	}
	static class UShiftSession* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShiftSession>();
	}
};
DUMPER7_ASSERTS_UShiftSession;

// Class Shift.ShiftSessionManager
// 0x0018 (0x0040 - 0x0028)
class UShiftSessionManager final : public UObject
{
public:
	TArray<class UShiftSession*>                  UserList;                                          // 0x0028(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TSubclassOf<class UObject>                    ShiftSessionClass;                                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ShiftSessionManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ShiftSessionManager")
	}
	static class UShiftSessionManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShiftSessionManager>();
	}
};
DUMPER7_ASSERTS_UShiftSessionManager;

}

