#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shift

#include "Basic.hpp"

#include "Shift_structs.hpp"


namespace SDK::Params
{

// Function Shift.ShiftFPSHistogramBlueprintLibrary.GetFPSInitParamsForAutomation
// 0x0080 (0x0080 - 0x0000)
struct ShiftFPSHistogramBlueprintLibrary_GetFPSInitParamsForAutomation final
{
public:
	struct FShiftFPSHistogramInitParams           ReturnValue;                                       // 0x0000(0x0080)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftFPSHistogramBlueprintLibrary_GetFPSInitParamsForAutomation;

// Function Shift.ShiftFPSHistogramBlueprintLibrary.InitFPSTelemetry
// 0x0090 (0x0090 - 0x0000)
struct ShiftFPSHistogramBlueprintLibrary_InitFPSTelemetry final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FShiftFPSHistogramInitParams           InInitParams;                                      // 0x0008(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ShiftFPSHistogramBlueprintLibrary_InitFPSTelemetry;

// Function Shift.ShiftFPSHistogramBlueprintLibrary.ReportFPSAggregate
// 0x0020 (0x0020 - 0x0000)
struct ShiftFPSHistogramBlueprintLibrary_ReportFPSAggregate final
{
public:
	class FString                                 CustomKey;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Context;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftFPSHistogramBlueprintLibrary_ReportFPSAggregate;

// Function Shift.ShiftFPSHistogramBlueprintLibrary.ResetFPSConstant
// 0x000C (0x000C - 0x0000)
struct ShiftFPSHistogramBlueprintLibrary_ResetFPSConstant final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShiftFPSConstant                             InType;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftFPSHistogramBlueprintLibrary_ResetFPSConstant;

// Function Shift.ShiftFPSHistogramBlueprintLibrary.SetFPSConstantFloat
// 0x0010 (0x0010 - 0x0000)
struct ShiftFPSHistogramBlueprintLibrary_SetFPSConstantFloat final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        Value;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftFPSHistogramBlueprintLibrary_SetFPSConstantFloat;

// Function Shift.ShiftFPSHistogramBlueprintLibrary.SetFPSConstantInteger
// 0x000C (0x000C - 0x0000)
struct ShiftFPSHistogramBlueprintLibrary_SetFPSConstantInteger final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftFPSHistogramBlueprintLibrary_SetFPSConstantInteger;

// Function Shift.ShiftFPSHistogramBlueprintLibrary.SetFPSConstantString
// 0x0018 (0x0018 - 0x0000)
struct ShiftFPSHistogramBlueprintLibrary_SetFPSConstantString final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ShiftFPSHistogramBlueprintLibrary_SetFPSConstantString;

}

