#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shift

#include "Basic.hpp"


namespace SDK
{

// Enum Shift.EShiftAccountId
// NumValues: 0x0002
enum class EShiftAccountId : uint32
{
	Invalid                                  = 0,
	EShiftAccountId_MAX                      = 1,
};

// Enum Shift.EShiftMatchmakingService
// NumValues: 0x0003
enum class EShiftMatchmakingService : uint8
{
	Matchmaking                              = 0,
	None                                     = 1,
	EShiftMatchmakingService_MAX             = 2,
};

// Enum Shift.EShiftFPSConstant
// NumValues: 0x0005
enum class EShiftFPSConstant : uint32
{
	All                                      = 0,
	Int                                      = 1,
	Float                                    = 2,
	String                                   = 3,
	EShiftFPSConstant_MAX                    = 4,
};

// Enum Shift.EShiftFriendRelationship
// NumValues: 0x0006
enum class EShiftFriendRelationship : uint8
{
	RequestSent                              = 0,
	RequestReceived                          = 1,
	Active                                   = 2,
	Blocking                                 = 3,
	Any                                      = 4,
	EShiftFriendRelationship_MAX             = 5,
};

// Enum Shift.EShiftPresenceShowAs
// NumValues: 0x0005
enum class EShiftPresenceShowAs : uint8
{
	Available                                = 0,
	Away                                     = 1,
	DoNotDisturb                             = 2,
	Unavailable                              = 3,
	EShiftPresenceShowAs_MAX                 = 4,
};

// Enum Shift.EShiftUserState
// NumValues: 0x0005
enum class EShiftUserState : uint8
{
	None                                     = 0,
	Provisional                              = 1,
	Unconfirmed                              = 2,
	Confirmed                                = 3,
	EShiftUserState_MAX                      = 4,
};

// Enum Shift.EShiftProfileVisibility
// NumValues: 0x0005
enum class EShiftProfileVisibility : uint8
{
	Unknown                                  = 0,
	Private                                  = 1,
	Protected                                = 2,
	Public                                   = 3,
	EShiftProfileVisibility_MAX              = 4,
};

// Enum Shift.EShiftAgeGroup
// NumValues: 0x0005
enum class EShiftAgeGroup : uint8
{
	Unknown                                  = 0,
	Child                                    = 1,
	Teen                                     = 2,
	Adult                                    = 3,
	EShiftAgeGroup_MAX                       = 4,
};

// Enum Shift.EShiftFeaturePrivilege
// NumValues: 0x0004
enum class EShiftFeaturePrivilege : uint8
{
	Unverified                               = 0,
	AgeRestricted                            = 1,
	Allowed                                  = 2,
	EShiftFeaturePrivilege_MAX               = 3,
};

// Enum Shift.EShiftFeatureDefault
// NumValues: 0x0005
enum class EShiftFeatureDefault : uint8
{
	Restricted                               = 0,
	Enabled                                  = 1,
	Disabled                                 = 2,
	None                                     = 3,
	EShiftFeatureDefault_MAX                 = 4,
};

// ScriptStruct Shift.ServerTelemetry
// 0x0028 (0x0028 - 0x0000)
struct FServerTelemetry final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          Game;                                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FServerTelemetry;

// ScriptStruct Shift.ClientTelemetry
// 0x0088 (0x0088 - 0x0000)
struct alignas(0x08) FClientTelemetry final
{
public:
	uint8                                         Pad_0[0x88];                                       // 0x0000(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FClientTelemetry;

// ScriptStruct Shift.ShiftAuthToken
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FShiftAuthToken final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShiftAuthToken;

// ScriptStruct Shift.ShiftOffer
// 0x0038 (0x0038 - 0x0000)
struct FShiftOffer final
{
public:
	int64                                         OfferId;                                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DateUnlocked;                                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftOffer;

// ScriptStruct Shift.ShiftEntitlement
// 0x0058 (0x0058 - 0x0000)
struct FShiftEntitlement final
{
public:
	class FString                                 Title;                                             // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bConsumable;                                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ConsumableAmount;                                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         EntitlementID;                                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 payload;                                           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Identifier;                                        // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftEntitlement;

// ScriptStruct Shift.ShiftEULA
// 0x0048 (0x0048 - 0x0000)
struct FShiftEULA final
{
public:
	int64                                         ID;                                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Text;                                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Title;                                             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 type;                                              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftEULA;

// ScriptStruct Shift.ShiftMatchmakingPool
// 0x0030 (0x0030 - 0x0000)
struct FShiftMatchmakingPool final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 options;                                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftMatchmakingPool;

// ScriptStruct Shift.ShiftMatchmakingConfiguration
// 0x0014 (0x0014 - 0x0000)
struct FShiftMatchmakingConfiguration final
{
public:
	uint8                                         bAllowMatchmakingDuringMatch : 1;                  // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowPlayersToLeaveMatch : 1;                     // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bBackfillEnabled : 1;                              // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bClientHosted : 1;                                 // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bJoinEnabled : 1;                                  // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        MatchHeartbeatInterval;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        PlayerConfirmTTL;                                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ReadyMatchTTL;                                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRequireAllPlayersConfirmed : 1;                   // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRequireAllPlayersReady : 1;                       // 0x0010(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRequiresServerInitiation : 1;                     // 0x0010(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShiftMatchmakingConfiguration;

// ScriptStruct Shift.ShiftMatchmaking
// 0x0060 (0x0060 - 0x0000)
struct FShiftMatchmaking final
{
public:
	EShiftMatchmakingService                      service;                                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShiftMatchmakingPool                  Pool;                                              // 0x0008(0x0030)(NativeAccessSpecifierPublic)
	class FString                                 Rules;                                             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FShiftMatchmakingConfiguration         options;                                           // 0x0048(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShiftMatchmaking;

// ScriptStruct Shift.ShiftPortrait
// 0x0060 (0x0060 - 0x0000)
struct FShiftPortrait final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Description;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Rules;                                             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Requirements;                                      // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImageName;                                         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImageURL;                                          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftPortrait;

// ScriptStruct Shift.ShiftGameMap
// 0x0040 (0x0040 - 0x0000)
struct FShiftGameMap final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameData;                                          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         priority;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         Chance;                                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftGameMap;

// ScriptStruct Shift.ShiftGameMode
// 0x0040 (0x0040 - 0x0000)
struct FShiftGameMode final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameData;                                          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FShiftGameMap>                  Maps;                                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftGameMode;

// ScriptStruct Shift.ShiftExperience
// 0x0168 (0x0168 - 0x0000)
struct FShiftExperience final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ID;                                                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         priority;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FShiftPortrait                         Portrait;                                          // 0x0030(0x0060)(NativeAccessSpecifierPublic)
	struct FShiftMatchmaking                      MATCHMAKING;                                       // 0x0090(0x0060)(NativeAccessSpecifierPublic)
	int64                                         TeamCount;                                         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         MinTeamSize;                                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         MaxTeamSize;                                       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerAllocator;                                   // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerOptions;                                     // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ModSets;                                           // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         tags;                                              // 0x0138(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FShiftGameMode>                 GameModes;                                         // 0x0148(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 RewardOptions;                                     // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftExperience;

// ScriptStruct Shift.ShiftFPSHistogramBucket
// 0x0010 (0x0010 - 0x0000)
struct FShiftFPSHistogramBucket final
{
public:
	double                                        limit_ms;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   label;                                             // 0x0008(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftFPSHistogramBucket;

// ScriptStruct Shift.ShiftFPSHistogramInitParams
// 0x0080 (0x0080 - 0x0000)
struct FShiftFPSHistogramInitParams final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAutoReportThroughShift;                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableInPIE;                                      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDynResAsRatio;                                    // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxMilliseconds;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocationRefreshRate;                               // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocationTagRefreshRate;                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IdleThresholdSeconds;                              // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IdleDistanceUnits;                                 // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PostMapLoadDelay;                                  // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreDefaultLevel;                               // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsMapWhiteList;                                   // 0x002D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           MapList;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           AggregateStats;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	int32                                         AggregateFlushRate;                                // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTickAggregateWithNoPlayers;                       // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HistogramFlushRate;                                // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LocationGridSize;                                  // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FShiftFPSHistogramBucket>       Buckets;                                           // 0x0060(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           stats;                                             // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftFPSHistogramInitParams;

// ScriptStruct Shift.ShiftFPSConstant
// 0x0050 (0x0050 - 0x0000)
struct FShiftFPSConstant final
{
public:
	class FName                                   label;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShiftFPSConstant                             type;                                              // 0x0008(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Comment;                                           // 0x0010(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20[0x30];                                      // 0x0020(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShiftFPSConstant;

// ScriptStruct Shift.ShiftFriendInfo
// 0x0040 (0x0040 - 0x0000)
struct FShiftFriendInfo final
{
public:
	EShiftAccountId                               ShiftAccountId;                                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ID;                                                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RichPresence;                                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShiftFriendRelationship                      status;                                            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShiftPresenceShowAs                          Presence;                                          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FShiftFriendInfo;

// ScriptStruct Shift.ShiftMetAccountInfo
// 0x0028 (0x0028 - 0x0000)
struct FShiftMetAccountInfo final
{
public:
	EShiftAccountId                               ShiftAccountId;                                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ID;                                                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftMetAccountInfo;

// ScriptStruct Shift.ShiftArticle
// 0x0048 (0x0048 - 0x0000)
struct FShiftArticle final
{
public:
	int64                                         ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Header;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Body;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 summary;                                           // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         tags;                                              // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftArticle;

// ScriptStruct Shift.ShiftFeature
// 0x0002 (0x0002 - 0x0000)
struct FShiftFeature final
{
public:
	EShiftFeaturePrivilege                        Privilege;                                         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShiftFeatureDefault                          Default;                                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftFeature;

// ScriptStruct Shift.ShiftFeatures
// 0x0008 (0x0008 - 0x0000)
struct FShiftFeatures final
{
public:
	struct FShiftFeature                          PlayOnline;                                        // 0x0000(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	struct FShiftFeature                          CrossPlay;                                         // 0x0002(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	struct FShiftFeature                          CommunicateOnline;                                 // 0x0004(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
	struct FShiftFeature                          UseUserGeneratedContent;                           // 0x0006(0x0002)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftFeatures;

// ScriptStruct Shift.ShiftUserDetails
// 0x0068 (0x0068 - 0x0000)
struct FShiftUserDetails final
{
public:
	EShiftUserState                               State;                                             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShiftProfileVisibility                       ProfileVisibility;                                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EShiftProfileVisibility                       ProfileVisibilityDefault;                          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FShiftFeatures                         Features;                                          // 0x0003(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EShiftAccountId                               ShiftAccountId;                                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SessionId;                                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DisplayName;                                       // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServiceId;                                         // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TitleSlug;                                         // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomerSupportID;                                 // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftUserDetails;

// ScriptStruct Shift.ShiftPlatformLink
// 0x0020 (0x0020 - 0x0000)
struct FShiftPlatformLink final
{
public:
	class FString                                 Platform;                                          // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServiceId;                                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftPlatformLink;

// ScriptStruct Shift.ShiftPersonalDetails
// 0x0050 (0x0050 - 0x0000)
struct FShiftPersonalDetails final
{
public:
	class FString                                 FirstName;                                         // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LastName;                                          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Email;                                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FShiftPlatformLink>             PlatformLinks;                                     // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FShiftPersonalDetails;

}

