#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatusEffect_Shock

#include "Basic.hpp"

#include "GbxGame_structs.hpp"


namespace SDK::Params
{

// Function StatusEffect_Shock.StatusEffect_Shock_Script_Const_C.OnBegin
// 0x00C0 (0x00C0 - 0x0000)
struct StatusEffect_Shock_Script_Const_C_OnBegin final
{
public:
	struct FGbxStatusEffectScript_ExecContext     execContext;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FDialogParameterValue                  CallFunc_ToDialogParameterFromObject_ReturnValue;  // 0x0018(0x0040)()
	TMap<FGbxDefPtrProperty_, struct FDialogParameterValue> K2Node_MakeMap_Map;                      // 0x0058(0x0050)(ConstParm)
	struct FDialogConversation                    CallFunc_TriggerDialogEventEx_Conversation;        // 0x00A8(0x000C)(NoDestructor)
	int32                                         CallFunc_TriggerDialogEventEx_ThreadID;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TriggerDialogEventEx_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StatusEffect_Shock_Script_Const_C_OnBegin;

}

