#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatusEffect_Radiation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxGame_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// GbxStatusEffectScriptClass StatusEffect_Radiation.StatusEffect_Radiation_Script_Instanced_C
// 0x0080 (0x00E0 - 0x0060)
class UStatusEffect_Radiation_Script_Instanced_C final : public UGbxStatusEffectScript_Instanced
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UObject*                                owner;                                             // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  instigator;                                        // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DMG_Source;                                        // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DPS;                                               // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage_Radius_Override;                            // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableValueHandle                  Radiation_ExplosionOnDeath_DamageMultiplier;       // 0x0090(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableValueHandle                  Radiation_ExplosionOnDeath_DamageInterval;         // 0x00B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_StatusEffect_Radiation_Script_Instanced(int32 entrypoint);
	void K2Node_GbxStatusEffectNotifyEvent_StatusEffectScript_0_notify_SENotify_Death_Radiation(class AActor* target, const struct FGbxStatusEffectQueryResult& Result);
	void K2Node_GbxStatusEffectPushEvent_0_Evt_RadiationApplied(const class UObject* owner_0, const struct FGameplayTagContainer& tags, const struct FGbxStatusEffectSpec_Params& params);
	void OnBegin();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("StatusEffect_Radiation_Script_Instanced_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StatusEffect_Radiation_Script_Instanced_C")
	}
	static class UStatusEffect_Radiation_Script_Instanced_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatusEffect_Radiation_Script_Instanced_C>();
	}
};
DUMPER7_ASSERTS_UStatusEffect_Radiation_Script_Instanced_C;

}

