#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StatusEffect_Radiation

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GbxGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK::Params
{

// Function StatusEffect_Radiation.StatusEffect_Radiation_Script_Instanced_C.ExecuteUbergraph_StatusEffect_Radiation_Script_Instanced
// 0x0460 (0x0460 - 0x0000)
struct StatusEffect_Radiation_Script_Instanced_C_ExecuteUbergraph_StatusEffect_Radiation_Script_Instanced final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxStatusEffectQueryResult            K2Node_MakeStruct_GbxStatusEffectQueryResult;      // 0x0008(0x0010)()
	struct FDialogParameterValue                  CallFunc_ToDialogParameterFromObject_ReturnValue;  // 0x0018(0x0040)()
	double                                        CallFunc_GetQueryResult_Float_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<FGbxDefPtrProperty_, struct FDialogParameterValue> K2Node_MakeMap_Map;                      // 0x0060(0x0050)(ConstParm)
	struct FDialogConversation                    CallFunc_TriggerDialogEventEx_Conversation;        // 0x00B0(0x000C)(NoDestructor)
	int32                                         CallFunc_TriggerDialogEventEx_ThreadID;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TriggerDialogEventEx_ReturnValue;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable;                              // 0x00C8(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FDamageTags                            Temp_struct_Variable_1;                            // 0x01C8(0x0020)(ConstParm)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakCharacter*                          K2Node_DynamicCast_AsOak_Character;                // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UObject*                          K2Node_GbxStatusEffectPushEventEvent_Owner;        // 0x0208(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_GbxStatusEffectPushEventEvent_Tags;         // 0x0210(0x0020)(ConstParm)
	struct FGbxStatusEffectSpec_Params            K2Node_GbxStatusEffectPushEventEvent_Params;       // 0x0230(0x0018)(ConstParm)
	EGetStatusEffectParamResultPins               CallFunc_GetDPS_Outcome;                           // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDPS_ReturnValue;                       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGetStatusEffectParamResultPins               CallFunc_GetDmgSource_Outcome;                     // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetDmgSource_ReturnValue;                 // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGetStatusEffectParamResultPins               CallFunc_GetDuration_Outcome;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDuration_ReturnValue;                  // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGetStatusEffectParamResultPins               CallFunc_GetDmgInstigator_Outcome;                 // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetDmgInstigator_ReturnValue;             // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Temp_struct_Variable_2;                            // 0x0288(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FDamageTags                            Temp_struct_Variable_3;                            // 0x0388(0x0020)(ConstParm)
	struct FGbxParam                              CallFunc_GetDataTableValueFromHandle_ReturnValue;  // 0x03A8(0x0038)()
	double                                        CallFunc_GetGbxParam_Double_ReturnValue;           // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxStatusEffectNotifyEventEvent_Target;     // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxStatusEffectQueryResult            K2Node_GbxStatusEffectNotifyEventEvent_Result;     // 0x03F0(0x0010)(ConstParm)
	struct FGbxParam                              CallFunc_GetDataTableValueFromHandle_ReturnValue_1; // 0x0400(0x0038)()
	bool                                          CallFunc_Query_ByTag_ReturnValue;                  // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGbxParam_Double_ReturnValue_1;         // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CauseDamage_DamageOverride_ImplicitCast;  // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_StatusEffect_Radiation_Script_Instanced_C_ExecuteUbergraph_StatusEffect_Radiation_Script_Instanced;

// Function StatusEffect_Radiation.StatusEffect_Radiation_Script_Instanced_C.K2Node_GbxStatusEffectNotifyEvent_StatusEffectScript_0_notify_SENotify_Death_Radiation
// 0x0018 (0x0018 - 0x0000)
struct StatusEffect_Radiation_Script_Instanced_C_K2Node_GbxStatusEffectNotifyEvent_StatusEffectScript_0_notify_SENotify_Death_Radiation final
{
public:
	class AActor*                                 target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGbxStatusEffectQueryResult            Result;                                            // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_StatusEffect_Radiation_Script_Instanced_C_K2Node_GbxStatusEffectNotifyEvent_StatusEffectScript_0_notify_SENotify_Death_Radiation;

// Function StatusEffect_Radiation.StatusEffect_Radiation_Script_Instanced_C.K2Node_GbxStatusEffectPushEvent_0_Evt_RadiationApplied
// 0x0040 (0x0040 - 0x0000)
struct StatusEffect_Radiation_Script_Instanced_C_K2Node_GbxStatusEffectPushEvent_0_Evt_RadiationApplied final
{
public:
	const class UObject*                          owner_0;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  tags;                                              // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGbxStatusEffectSpec_Params            params;                                            // 0x0028(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_StatusEffect_Radiation_Script_Instanced_C_K2Node_GbxStatusEffectPushEvent_0_Evt_RadiationApplied;

}

