#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Order_Firing

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Order_Firing.Struct_Order_Firing
// 0x0058 (0x0058 - 0x0000)
struct FStruct_Order_Firing final
{
public:
	double                                        HeatImpulseScale_76_12D398514F9400154C48EEACC7A9B014; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ChargeTime_69_DA1B9E7E486687DEC859A8A260E78AF2;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxLoadedShots_70_3EFFD9AA4E26939765F2A5A379ADCB62; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoadedShotDamageScale_65_19DD2E0C4D36676330DEABAD6E6A5C6C; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoadedShotDamageRadiusScale_84_14EF65194B10FE3724438AB8731C5DB6; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoadedShotProjSpeedScale_85_CDEAADBA49AF07F6F5C4B09EB3548975; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoadedShotSpreadScale_66_D5D4E0FE4CF7B880EC074994234C1991; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoadedShotImpulseScale_67_D7FB9CB5457CBB9834ABB1A2013838B1; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoadedShotRecoilScale_68_6A7944A14E93A099B87969AD950AF0B9; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoadedShotHeatImpulseScale_73_8A1A503F46BBC1C76C6BBBA3EFD45EF6; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LoadedShotAdditionalProjectile_79_F3F0C1604F50B782DDD600A223DFEBD3; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Order_Firing;

}

