#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ShieldTest

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ShieldTest.Struct_ShieldTest
// 0x0048 (0x0048 - 0x0000)
struct FStruct_ShieldTest final
{
public:
	double                                        capacity_66_d8c5fd804b6e274fa4fcdd8b0b642a90;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        delay_67_af3e1dd0484704a6f1a8d2997f25f834;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        rechargerate_68_52bf135146d567f0cd43ce8bf71af003;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        armorsegments_72_83b1671f42e713e67ec3cba1039948dd; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        armordamagereduction_73_69e72ce24c07925d554baab00a4b130d; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        armorpassthroughpercent_81_4be9faed478d42e65089188c787628e5; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ArmorSegmentRegenDuration_85_BA3A102840F247C8CA0BDF971EF22422; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Comment_65_BC9EC6EF40FC9DD9B80A99820AEDE5A3;       // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_ShieldTest;

}

