#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Weapon_Magazine_Init

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Weapon_Magazine_Init.Struct_Weapon_Magazine_Init
// 0x0060 (0x0060 - 0x0000)
struct FStruct_Weapon_Magazine_Init final
{
public:
	double                                        MaxLoadedAmmo_Value_40_4D6E5A8840F57DBD840197B3CB05686D; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReloadTime_Value_41_67DA482B483B02CAC87864955A611952; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ThrownReloadTime_Value_62_B62F731A48635D8214FA238BC4E6EE28; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Damage_Scale_42_740BF8EA43AFEE45A6A954B40FD8101E;  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FireRate_Scale_47_9D8B5F2541B898E5DCC272891DF3DBFF; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Accuracy_Scale_44_435CE4B14BED79682FC94FB100E4B857; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Spread_Scale_43_E6F748AC40E5205BAA7C39B0A887CBF3;  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Recoil_Scale_26_9CFC544D40C502789BFEF6BD2C2A828F;  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sway_Scale_20_38074ABF462F321F16D6818792689C85;    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HeatImpulse_Value_53_01600CD94180E7AD3AC69380428894C0; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReloadCompletePercent_67_3C122C6B41BFF635553331972754C5CE; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ThrownReloadCompletePercent_68_A6BB23264C39B0DFA58338BB0221AEC4; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Weapon_Magazine_Init;

}

