#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_PlayerAmmoResourceBalance

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_PlayerAmmoResourceBalance.Struct_PlayerAmmoResourceBalance
// 0x0028 (0x0028 - 0x0000)
struct FStruct_PlayerAmmoResourceBalance final
{
public:
	double                                        Resource_Threshold_2_6E5E4DFF45F7E2E3EE2FB79ABBEC69E6; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Above_Threshold_Chance_7_ABBCA15749DC74A59649A999F57B39D8; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        No_Pool_Weight_8_7D69503449238027CFB5C98444334B04; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Below_Threshold_Min_9_565DAB53450DA4A8B6C47FBB84EA4DDF; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Below_Threshold_Max_10_DB315B424E33D11AE9F327923C6F1997; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_PlayerAmmoResourceBalance;

}

