#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_MissionRewardTier

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_MissionRewardTier.Struct_MissionRewardTier
// 0x0078 (0x0078 - 0x0000)
struct alignas(0x08) FStruct_MissionRewardTier final
{
public:
	FGbxDefPtrProperty_                           VerySmall_20_98621FA740F79B8E6A1625B0A45BA6C2;     // 0x0000(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	FGbxDefPtrProperty_                           Small_21_D2CCE7FE42EBDF670D8B9A843407E156;         // 0x0018(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	FGbxDefPtrProperty_                           Medium_22_9EF3F1064376EC23FF3CA2AFA96C12AF;        // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	FGbxDefPtrProperty_                           Large_23_216C483744128926006B7D9B894C2D65;         // 0x0048(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	FGbxDefPtrProperty_                           VeryLarge_24_179FC3544F326C02139207B2301625B3;     // 0x0060(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_MissionRewardTier;

}

