#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_BaseGrenade_Init

#include "Basic.hpp"

#include "GbxEngine_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_BaseGrenade_Init.Struct_BaseGrenade_Init
// 0x00A0 (0x00A0 - 0x0000)
struct FStruct_BaseGrenade_Init final
{
public:
	double                                        damage_scale_39_198f7db24e9e8af3e2aafea2acd1d1cf;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius_55_74ABFDB04F47E189260F3096D743D5F2;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Cooldown_57_7575225B4ACE78EDEA0F8FA77D4E4ED9;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fuse_Time_61_BE47818344B3414BA66BB3A1B438BB63;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxParam                              Force_67_1D258DD14BB81523C7925593568A9EBD;         // 0x0020(0x0038)(Edit, BlueprintVisible)
	double                                        Projectile_Speed_Scale_75_46D5E08A455AC9BF9E1359ACFBCF5A74; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Homing_Turn_Speed_Scale_76_093D72884056E6980ADAB49E00300E4F; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Critical_Hit_Chance_77_867A400D4F27393EEDFA5BAD2CD1D8B3; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PayloadDamage_Scale_82_B39ECA3A46E5AF83D9CE49AA8FE81724; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PayloadRadius_Scale_83_2C91C65D4806F19404CFB6B71D37094C; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Charges_Value_86_732B6B68493E25F90D4D76B71AE44904; // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        StatusChance_Scale_90_4D7AC842489CCDDA73C6FBAA53C6D608; // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StatusCharge_Scale_93_8A225992432DAA0EDD3C8F8D36AEC791; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StatusDamage_Scale_95_50A6544641AF4998BFE94B8720776E05; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_BaseGrenade_Init;

}

