#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Weapon_Unique_Init

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Weapon_Unique_Init.Struct_Weapon_Unique_Init
// 0x0078 (0x0078 - 0x0000)
struct FStruct_Weapon_Unique_Init final
{
public:
	class FString                                 Custom_1_Desc_82_4D6E5A8840F57DBD840197B3CB05686D; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Value_1_68_67DA482B483B02CAC87864955A611952;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Custom_2_Desc_83_E6F748AC40E5205BAA7C39B0A887CBF3; // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Value_2_70_435CE4B14BED79682FC94FB100E4B857;       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Custom_3_Desc_84_98D060BB4EBF130785B55E974BEF3ED1; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Value_3_72_5E425BA54AABD6722A79F085B44D814F;       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Custom_4_Desc_85_965BC955446012B420CC2EB5EAC257FE; // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Value_4_74_740BF8EA43AFEE45A6A954B40FD8101E;       // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Custom_5_Desc_86_A64A562C4C555439967F9CB79B6A123B; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Value_5_81_D893EDE44E017167ED279F891A83419B;       // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Weapon_Unique_Init;

}

