#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_DedicatedDropProbability

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_DedicatedDropProbability.Struct_DedicatedDropProbability
// 0x0038 (0x0038 - 0x0000)
struct FStruct_DedicatedDropProbability final
{
public:
	double                                        Primary_2_A7EABE6349CCFEA454C199BC8C113D94;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Secondary_4_396F8C374F4CCE05ED410DB2A979EFA3;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Tertiary_6_CC872A454420BA1E44A4F19FD4CA6D90;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Quaternary_16_CE633DA04605D2E8D44CE28F959EA090;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Shiny_9_14484F0840F49898A4F8AE93BA1179AE;          // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TrueBoss_12_47D1E0FA435EA53697F51F829004964B;      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TrueBossShiny_14_EA1D0D2F4F68BA38D6105D9025645769; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_DedicatedDropProbability;

}

