#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_RepKit_Augment

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_RepKit_Augment.Struct_RepKit_Augment
// 0x0068 (0x0068 - 0x0000)
struct FStruct_RepKit_Augment final
{
public:
	double                                        Healing_Scale_22_DE3F1F76486C6F2C8976A286B12721D4; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Cooldown_Scale_23_50D2EF8B45A4A601D1056B8975BC8A67; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Duration_Scale_52_772D226F4B60937B658374B982BCEE1B; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Aug_Stat_01_Desc_47_8653637B41EAEA3E0300958481411AF8; // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Aug_Stat_01_35_320C487A467F3D8172F85B8B6D2CCAB8;   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Aug_Stat_02_Desc_48_2D342F014223709BF11E73A0D0CB932F; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Aug_Stat_02_32_CE5E5B384C4D18DBD698C19186A2639A;   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Aug_Stat_03_Desc_49_0397D2644602DE3399945F89879DFF74; // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Aug_Stat_03_33_BC480A3745A14920960E17979C512042;   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FX_Parameter_Value_55_EF2766244F5CE9F2EE182899A03EACAD; // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_RepKit_Augment;

}

