#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Weapon_Elemental_Init

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Weapon_Elemental_Init.Struct_Weapon_Elemental_Init
// 0x0018 (0x0018 - 0x0000)
struct FStruct_Weapon_Elemental_Init final
{
public:
	float                                         fire_52_4d6e5a8840f57dbd840197b3cb05686d;          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         shock_56_e6f748ac40e5205baa7c39b0a887cbf3;         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         corrosive_55_67da482b483b02cac87864955a611952;     // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         radiation_58_435ce4b14bed79682fc94fb100e4b857;     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         sonic_59_98d060bb4ebf130785b55e974bef3ed1;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         cryo_62_eeb4f44c4d31f331be959fa77463d313;          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Weapon_Elemental_Init;

}

