#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Gadget_HW_Init

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Gadget_HW_Init.Struct_Gadget_HW_Init
// 0x0014 (0x0014 - 0x0000)
struct FStruct_Gadget_HW_Init final
{
public:
	float                                         damage_scale_79_3d3a36164fc230870ad4cd8b3d3b753e;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         burstcount_72_f5396bee4242ac0d3c8cac894204204e;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         burstdelay_73_d906bd9545f8941504d7bbb13d6d970a;    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         projectilespeed_74_241b13564564ca74985bed9b3f4564ca; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         accuracy_75_a8f3eeb84aaea634100e93b411eac340;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Gadget_HW_Init;

}

