#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_BaseWeaponInitialization

#include "Basic.hpp"

#include "GbxGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_BaseWeaponInitialization.Struct_BaseWeaponInitialization
// 0x00A8 (0x00A8 - 0x0000)
struct FStruct_BaseWeaponInitialization final
{
public:
	double                                        damage_scale_39_198f7db24e9e8af3e2aafea2acd1d1cf;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CritDamage_Add_55_74ABFDB04F47E189260F3096D743D5F2; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EquipTime_Value_19_96D3840F4195D60AD6AFF8A2D04045AF; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PutDownTime_Value_22_404C0CD64C29791412D09395ABC70101; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ModeSwitchTime_Value_53_19F186E94A13E3AF8CF1B48AE3AAEB51; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ElementalChance_Value_58_EDD268A84B5DB262F5E21CBE9D64A756; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ElementalDamage_Scale_56_48F1946B4FFC16F20A0690ADB2CB1577; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CryoImpactContribution_Scale_69_1D82233D404DA0775EDBAC8583C62D58; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        zoomtime_scale_36_124f0c774264408fc9421596341cd19a; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FForceSelection                        WeaponHitForce_54_7575225B4ACE78EDEA0F8FA77D4E4ED9; // 0x0048(0x0048)(Edit, BlueprintVisible, NoDestructor)
	double                                        MovementAccuracyMaxValue_61_998D34344F3613B50408B0AC36FE2772; // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StandingAccuracyPenaltyPercent_63_650E94E340103426EB0342843752017B; // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CrouchAccuracyMaxPenaltyPercent_65_2128A0154040E1AA1FBEEA8E41BB5041; // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_BaseWeaponInitialization;

}

