#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_AI_WeaponInit

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_AI_WeaponInit.Struct_AI_WeaponInit
// 0x0078 (0x0078 - 0x0000)
struct FStruct_AI_WeaponInit final
{
public:
	double                                        Damage_Scale_2_C9D7671C498DB3242A1ADF908DCB81FC;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FireRate_Value_4_0FDA894643A413A9EDF878963787EB6C; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Spread_Value_6_3B1BCC764DC2F3CFBE8BA9B93EFEDAC7;   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AI_Accuracy_Min_24_36BE30B84D055E56E52F03BF054411CF; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AI_Accuracy_Max_25_F2BA7FE045472328DCE864A9C179B2D3; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BurstDelay_Value_11_C0E505764E41BF4C090EA6950E1E950C; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BurstTime_Value_19_3271459048CFCB819A268B9824FEC3FE; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BurstCount_Value_27_BCCD780541CF9CCE5F49FCAFABB30B4D; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDesiredRange_14_07395E0949A4A37FC7DDB4810AB6D12B; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinDesiredRange_16_584D370145431CF777C11CAE612C2C44; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius_Value_18_1920F6C448DA257A1D8260974B1AB71E;  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ProjectileSpeed_23_8466D2FD4B5EB4F7D4DB868AB5579459; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FirerateAccelDuration_30_BDF3E0DA43119DEE9A71F7B369DB9CF4; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AI_Accuracy_33_D3C350EA449BFAA6F271BF84E3777958;   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PreferredRange_37_AE50D09343AC6F6407D69EA999A75DBD; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_AI_WeaponInit;

}

