#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Gadget_HW_Barrel_Init

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Gadget_HW_Barrel_Init.Struct_Gadget_HW_Barrel_Init
// 0x0080 (0x0080 - 0x0000)
struct FStruct_Gadget_HW_Barrel_Init final
{
public:
	double                                        Cooldown_58_F23A09FF4CA5CBDB25D9F5BE50FB1941;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MagazineSize_Value_53_35AE277644FC59AFB6444499B0C7AC03; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Damage_Scale_14_4D6E5A8840F57DBD840197B3CB05686D;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FireRate_Value_36_67DA482B483B02CAC87864955A611952; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageRadius_Value_46_353F09AC41355301655987A4F18E57F5; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Spread_Value_37_E6F748AC40E5205BAA7C39B0A887CBF3;  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Accuracy_Value_38_435CE4B14BED79682FC94FB100E4B857; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AccImpulse_Value_41_98D060BB4EBF130785B55E974BEF3ED1; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AccDelay_Value_42_5E425BA54AABD6722A79F085B44D814F; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AccRegen_Value_43_965BC955446012B420CC2EB5EAC257FE; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CritDamage_Add_59_740BF8EA43AFEE45A6A954B40FD8101E; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Recoil_Scale_26_9CFC544D40C502789BFEF6BD2C2A828F;  // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Sway_Scale_20_38074ABF462F321F16D6818792689C85;    // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StatusChance_Scale_71_19DD2E0C4D36676330DEABAD6E6A5C6C; // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StatusDamage_Scale_72_431A172F492822B3485629AD2D36897B; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CryoImpact_Scale_62_8BFC629A4E172840D2EB12873BED0098; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Gadget_HW_Barrel_Init;

}

