#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_HeavyWeaponStats

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_HeavyWeaponStats.Struct_HeavyWeaponStats
// 0x0028 (0x0028 - 0x0000)
struct FStruct_HeavyWeaponStats final
{
public:
	double                                        default_44_19dd2e0c4d36676330deabad6e6a5c6c;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Borg_72_38D0921E4A6CD4EFA75692961DD3A754;          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Maliwan_73_BD4B38BB4E31E4D57C4BE6964900D1B1;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Torgue_74_B697612A4E44B789924B8097484D223E;        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Vladof_75_8FC9E9A147DBF7B56AF04189985227FE;        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_HeavyWeaponStats;

}

