#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Enemy_Ranks

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Enemy_Ranks.Struct_Enemy_Ranks
// 0x002C (0x002C - 0x0000)
struct FStruct_Enemy_Ranks final
{
public:
	int32                                         Chump_55_E226403045D32494C2AD269EA1C3A6BF;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Normal_56_5D06E52E4352029489A85081EF88D003;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Elite_57_B05A952941D95FD38E1A1C9E220216E6;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Badass_58_BB16893B4D27821E1208EF883F5B17FF;        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Boss_59_B838F9BC4C2E02E8978DD3BA4CA2D453;          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Loot_60_DA8156814BC8FE7CFFECDA83EA3A0314;          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BadassSuper_63_498E47B0413154CB678BB59136133210;   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BadassCorrupt_65_88238930458B5EAB5F1238BBB464ED4E; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossMini_67_7798A0874D7C5DCD53FB8B8314DFDE5E;      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossVault_69_918116B749A9AF1F488063A1F350E6E7;     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossRaid_71_DE3C796E46E54469C6D9F99A4FE846B5;      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Enemy_Ranks;

}

