#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Balance_Rarity

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Balance_Rarity.Struct_Balance_Rarity
// 0x0038 (0x0038 - 0x0000)
struct FStruct_Balance_Rarity final
{
public:
	double                                        stat_scale_2_59f6d7fa40f2d4447260d8b092001558;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        damage_scale_level_5_b5e010d645d41f3ab144e186723bc617; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        growth_exponent_7_b6c170a3461fc939f7ce9980dfb5a036; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        base_weight_9_91e4d12b4319d280c56851907ad21674;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FGbxDefPtrProperty_                           local_modifier_18_4aec023c4018ef4cad6836b20f0d2557; // 0x0020(0x0018)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Balance_Rarity;

}

