#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Weapon_RarityInit

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Weapon_RarityInit.Struct_Weapon_RarityInit
// 0x0020 (0x0020 - 0x0000)
struct FStruct_Weapon_RarityInit final
{
public:
	float                                         damage_53_4d6e5a8840f57dbd840197b3cb05686d;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         spread_54_67da482b483b02cac87864955a611952;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         accuracy_56_435ce4b14bed79682fc94fb100e4b857;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         accimpulse_55_e6f748ac40e5205baa7c39b0a887cbf3;    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         recoil_59_98d060bb4ebf130785b55e974bef3ed1;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         sway_61_6a4f9c7d4b7c7af3f34d25b24916d829;          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         zoomtime_63_8d880517408b48ae875e9598fa8eda8c;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         equiptime_65_0b39d3764f518a76acade094f6574a03;     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Weapon_RarityInit;

}

