#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_WeaponAcc

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_WeaponAcc.Struct_WeaponAcc
// 0x0040 (0x0040 - 0x0000)
struct FStruct_WeaponAcc final
{
public:
	double                                        SpreadWeight_21_DE3F1F76486C6F2C8976A286B12721D4;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SpreadMax_22_6F1B084F4CEA955F8B2367A0D29F6131;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ImpulseWeight_23_2F04816C48A83E517800039E0A3B7A19; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ImpulseMax_24_4F0D1B6D4869536899EE128D8D8FE541;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AccWeight_25_47AACE2B43225886B8E65CA12347AD28;     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AccMax_26_2585255A49E3A81A6EE563B006A5A5D0;        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SwayWeight_27_50D2EF8B45A4A601D1056B8975BC8A67;    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SwayMax_28_96D3840F4195D60AD6AFF8A2D04045AF;       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_WeaponAcc;

}

