#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Shield_Unique_Energy

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Shield_Unique_Energy.Struct_Shield_Unique_Energy
// 0x0060 (0x0060 - 0x0000)
struct FStruct_Shield_Unique_Energy final
{
public:
	double                                        Capacity_Scale_108_839F232D46CE3B790E016CBE28FB16B9; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Regen_Scale_110_E033E47B47480914F5D4059256DD2356;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Delay_Scale_112_CDE42164442F74750ACC99A8646D9844;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Custom_1_113_375CD4C34016E17B2FE8198AAA51209F;     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Value_1_99_69E441E543482BCED8E266B8CA41F7DE;       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Custom_2_114_B5BA8C584C777BB86C62AD9C2A422618;     // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Value_2_100_0608396B4FCD88C5AD645B82A8827B25;      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Custom_3_115_3BAEBD9D419DE056195974A14DC05722;     // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        Value_3_116_3AE920C6426F128CA11D7FA72DB3AF93;      // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Shield_Unique_Energy;

}

