#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_WeaponManufacturer

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_WeaponManufacturer.Struct_WeaponManufacturer
// 0x0020 (0x0020 - 0x0000)
struct FStruct_WeaponManufacturer final
{
public:
	float                                         daedalus_2_de3f1f76486c6f2c8976a286b12721d4;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         jakobs_9_6f1b084f4cea955f8b2367a0d29f6131;         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         vladof_10_2f04816c48a83e517800039e0a3b7a19;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         tediore_12_4f0d1b6d4869536899ee128d8d8fe541;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         torgue_13_47aace2b43225886b8e65ca12347ad28;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         maliwan_18_2585255a49e3a81a6ee563b006a5a5d0;       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         borg_15_50d2ef8b45a4a601d1056b8975bc8a67;          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         order_16_96d3840f4195d60ad6aff8a2d04045af;         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_WeaponManufacturer;

}

