#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Player_Difficulty_Balance

#include "Basic.hpp"

#include "OakGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Player_Difficulty_Balance.Struct_Player_Difficulty_Balance
// 0x0108 (0x0108 - 0x0000)
struct FStruct_Player_Difficulty_Balance final
{
public:
	double                                        DamageTaken_25_E226403045D32494C2AD269EA1C3A6BF;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageDealt_29_5D06E52E4352029489A85081EF88D003;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LootLuck_14_399B75514C8C257B547C3392607B6CBB;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AITimeToBestAccuracy_27_2CDD303E4A871576A4384AA6E577AAF9; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AIDmgPercentToWorstAccuracy_28_FDCC6FA2450C1376D62EE4B437F9AEB0; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Cash_42_6EE698A74322C099B3E638B650A3A49A;          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Eridium_44_AA20800F4DB24D2EEEF55D87BE9CA619;       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CombatExperience_46_8242440547E49F474B6D4AA0104E108B; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FOakPlayerDifficultyElementBalanceData ElementalDamageTaken_51_3196A46441D9FBA031FBE787BEA072C6; // 0x0040(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData CorrosiveDamageTaken_53_81A3DC624F5FD8B7DDA15582D3EE7331; // 0x0050(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData CryoDamageTaken_55_2975734E403A3567137569A8836CDB3F; // 0x0060(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData FireDamageTaken_57_183BD10D4D73C9BFA9D95591D7C5C1A0; // 0x0070(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData ShockDamageTaken_59_2B27F1FC4533665C6436E88E765A597D; // 0x0080(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData RadiationDamageTaken_61_E87588D44F45E48D7EB132893EB78816; // 0x0090(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData ElementalDamageDealt_63_ADA7C5634D85D6F96159369595D29839; // 0x00A0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData CorrosiveDamageDealt_65_76ED2D444EFD860C1211F4BD14064305; // 0x00B0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData CryoDamageDealt_70_3DD35099430BFBE69AD5CAABA936694C; // 0x00C0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData FireDamageDealt_71_9D15F5454C552ED0C5C4778FDE7E3252; // 0x00D0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData ShockDamageDealt_72_D15FD2D1499E313F79CF269285195240; // 0x00E0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FOakPlayerDifficultyElementBalanceData RadiationDamageDealt_73_8FB9E4A746194106FF3F5E8130D321BB; // 0x00F0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	double                                        EnemyHealth_76_0B61BB8543E4615905115AADDE7E8EEF;   // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Player_Difficulty_Balance;

}

