#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_ShieldTest_2

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_ShieldTest_2.Struct_ShieldTest_2
// 0x0050 (0x0050 - 0x0000)
struct FStruct_ShieldTest_2 final
{
public:
	class FString                                 comment_1_94_375cd4c34016e17b2fe8198aaa51209f;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        augment_secondary_78_69e441e543482bced8e266b8ca41f7de; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        augment_primary_56_353f09ac41355301655987a4f18e57f5; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        augment_both_81_ce5263f94ebd11dddc87428cdb32f99a;  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 comment_2_95_b5ba8c584c777bb86c62ad9c2a422618;     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        augment_secondary_2_96_0608396b4fcd88c5ad645b82a8827b25; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        augment_primary_2_97_3baebd9d419de056195974a14dc05722; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        augment_both_2_98_3ae920c6426f128ca11d7fa72db3af93; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_ShieldTest_2;

}

