#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_GrenadeMod_Augment

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_GrenadeMod_Augment.Struct_GrenadeMod_Augment
// 0x0050 (0x0050 - 0x0000)
struct FStruct_GrenadeMod_Augment final
{
public:
	double                                        damage_scale_39_198f7db24e9e8af3e2aafea2acd1d1cf;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius_Scale_58_74ABFDB04F47E189260F3096D743D5F2;  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Cooldown_Scale_59_7575225B4ACE78EDEA0F8FA77D4E4ED9; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Damage_Payload_Scale_77_B2FEA0974334295C00EA009E800E8B17; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 customdesc1_71_196b56cc4f1c41dbb8429da500abdff9;   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        customvalue1_72_e0ee4fbe4b5748bcc3b9edb0e6839b31;  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CustomDesc2_73_7FF19EB9436F7FE4E13E86A225A4BEE8;   // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        CustomValue2_74_5F3950D24E5E62912671339477278A7B;  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_GrenadeMod_Augment;

}

