#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Boss_Attacks

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Boss_Attacks.Struct_Boss_Attacks
// 0x00D0 (0x00D0 - 0x0000)
struct FStruct_Boss_Attacks final
{
public:
	double                                        dmgmultiplier_18_b51fbc054945b9e6af8286a14f8cd135; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        radius_19_0674d19d489d2ed9c52cd1bc924f26a5;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        angle_20_6eb6ad6c423e242cafb5ef8a767fbc3c;         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        halfheight_21_c1b29dbf484b912d3fd8599fa5082473;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        cooldown_35_b485a07c437db96e978b11bb02428075;      // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        duration_36_dba1ee464cb549e4f8ba0e8c77d02faf;      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_01_37_3145089546bc4bf84a1c439ecc833140;     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_02_38_97a827fa4111a58a1aac0b9ff20fee2b;     // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_03_39_5e5ac9074af1e5c4090e8f83228fc677;     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_04_43_426a661f47f2109912946ba96a2277a8;     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_05_54_b189a1b54820423b87a10389330f5199;     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_06_55_4a725657485dbc321843d7b983482ebb;     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_07_56_590126244503d33779fdf081583f3898;     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_08_57_4f2d022c4643271c263556a6499acacd;     // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_09_60_7c62eebc400462d939187db59e258aa6;     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_10_64_f8b9c7bc4e6bcb17c945c1b75e0b7639;     // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_11_70_81e7ed724602b9c63d778b8fe0bcb819;     // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_12_71_94e567624f1dbb9a6c621ab93004bc19;     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_13_74_fd81d1e4471a1a0d8a049097b5fd4373;     // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_14_77_4e7ad85947b854995a82cb902fbc7918;     // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_15_82_d2e85c6743c5c789dc2e4e8fc4564fc4;     // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_16_83_26a0abf04bb3ea23b967039eacdcd203;     // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_17_86_60be6e674e422178ec9633a409eea01e;     // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_18_89_66df31644895c0a6cf0647907576f913;     // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 comment_40_b6e6ba864f43fef6110fedb86f61bfa1;       // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Boss_Attacks;

}

