#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_EnemyDrops

#include "Basic.hpp"

#include "OakGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_EnemyDrops.Struct_EnemyDrops
// 0x0568 (0x0568 - 0x0000)
struct FStruct_EnemyDrops final
{
public:
	double                                        EXP_Multiplier_36_615DFBBD414624D661EFA8842830565E; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrencyOrAmmo_Probability_37_20336330485BF8094151B0A668345FAC; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLootChanceDefinedValueRow             CurrencyAmmo_HowMany_60_E09620F34AF446618F731D8CED6476B2; // 0x0010(0x00B8)(Edit, BlueprintVisible)
	double                                        Guns_Probability_38_5EF9B63146C6680F186B26BEFBA2B37B; // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLootChanceDefinedValueRow             Guns_HowMany_61_9DA525DF4203F34702DC1F8EEE38F2B1;  // 0x00D0(0x00B8)(Edit, BlueprintVisible)
	double                                        Shields_Probability_39_4107553C467AC84EBC22B5B9AAFF63AE; // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLootChanceDefinedValueRow             Shields_HowMany_62_7EF7DC344C146AA40A29818F6FD70E77; // 0x0190(0x00B8)(Edit, BlueprintVisible)
	double                                        GrenadesOrGadgets_Probability_40_C486186142A48F92B82784916D0F37BE; // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLootChanceDefinedValueRow             GrenadesGadgets_HowMany_63_F6AC0DD6421645D925BD5EBE132CF14E; // 0x0250(0x00B8)(Edit, BlueprintVisible)
	double                                        RepKits_Probability_54_DD40BF4C4351E5D23C00C49A21896474; // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLootChanceDefinedValueRow             RepKits_HowMany_64_2A2CB25E4563F7F7019C09850702ADB3; // 0x0310(0x00B8)(Edit, BlueprintVisible)
	double                                        Enhancements_Probability_56_6BB8F5284AB8949E3AFF8C944834912B; // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLootChanceDefinedValueRow             Enhancements_HowMany_65_49440B4643EF2A874DDD25AB45206C63; // 0x03D0(0x00B8)(Edit, BlueprintVisible)
	double                                        ClassMods_Probability_58_8EABD0B04173DF56608A6C86593A99B7; // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLootChanceDefinedValueRow             ClassMods_HowMany_66_F704E46A4BFA6A12784FD89A67AC9FDD; // 0x0490(0x00B8)(Edit, BlueprintVisible)
	struct FLocalRarityModiferData                Rarity_Modifier_69_A5FA552D4865FBD27D0583A58E1EF6EF; // 0x0548(0x0020)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FStruct_EnemyDrops;

}

