#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Gadget_AT_Manufacturer_Init

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Gadget_AT_Manufacturer_Init.Struct_Gadget_AT_Manufacturer_Init
// 0x0018 (0x0018 - 0x0000)
struct FStruct_Gadget_AT_Manufacturer_Init final
{
public:
	float                                         cooldown_scale_59_f23a09ff4ca5cbdb25d9f5be50fb1941; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         duration_scale_60_35ae277644fc59afb6444499b0c7ac03; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         health_scale_66_9d3ec4214b4dfd805e9e059c729bcb85;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         damage_scale_67_b7329f4348d244ff9dd2bbb60c7e17fc;  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         firerate_scale_68_96b5b8f940c0ee4f8d6451b7fe3fab60; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         accuracy_scale_69_58c6e88549f3c2de314a3a8c1501f9b6; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Gadget_AT_Manufacturer_Init;

}

