#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_TED_Throw

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_TED_Throw.Struct_TED_Throw
// 0x0088 (0x0088 - 0x0000)
struct FStruct_TED_Throw final
{
public:
	double                                        ExplosionRadius_Value_84_3EFFD9AA4E26939765F2A5A379ADCB62; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ExplosionDamage_Scale_85_DA1B9E7E486687DEC859A8A260E78AF2; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MirvExplosionDamage_Scale_82_6A7944A14E93A099B87969AD950AF0B9; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MirvExplosionRadius_Scale_98_BFC3C0004668B00D8ED5C9A12F2628DC; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MirvCount_Value_96_1F6944D14019BF07BE5462B0A8CD6D2A; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LegsExplosionDamage_Scale_93_7D46D66743B794228AE90AA836DEC8BB; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShootingExplosionDamage_Scale_83_562322E94E4E8001B160FCB2A36BD3AB; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ComboExplosionDamage_Scale_87_929B269A4171C6AFEBD4A79919930995; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ShootingExplosionRadius_Scale_89_56EE5B8E427503647E303ABC45513FED; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ReplicatorExplosionDamage_Scale_94_203083C74227AABED43F859D1B520208; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JavelinExplosionDamage_Scale_100_0AC614B44A1069D57D5833982AF953E2; // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HomingExplosionDamage_Scale_102_58D737CE4A56ED712C7912A455543895; // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HomingExplosionRadius_Scale_104_3BFB454B46A0F1F9BB1EF1BDCCE16339; // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         JavelinThrusterCount_114_C1CFF69C48F3EE2B46B5D4AF762723CF; // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HomingThrusterCount_116_0285E35B461F72CD9A68EE9E1DE22C82; // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Homing_Thruster_IsFan_117_35DC8A024A927B3920FA2E81683477BC; // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Javelin_Thruster_IsFan_119_B18FE8074F5B03D1AB0D3D8D218C76E3; // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Homing_Thruster_Scalar_122_6128D2CE4522DE274F8D1299CB74D4C2; // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Javelin_Thruster_Scalar_124_0AD23BDC421FDD1784872CAE8AA79C34; // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_TED_Throw;

}

