#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SkillBalance

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SkillBalance.Struct_SkillBalance
// 0x0058 (0x0058 - 0x0000)
struct FStruct_SkillBalance final
{
public:
	double                                        modifier1_7_cf228f3c4da52d4c5e63d7a7350e4bc6;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 description_6_1ce6525543172dae3c826289d38a28b1;    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        modifier2_16_467a97ec46fec297931f6bbe916b7d4b;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 description2_14_0b349f42424702a9ced1f2b774da67ee;  // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        modifier3_17_6be0fb06434b383a020dc98dd5da75e5;     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 description3_15_02c8ed7c4633f397c8960295168878c9;  // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 skillname_22_23519f644768442937e371b7d8845335;     // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_SkillBalance;

}

