#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Terminal_Init

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Terminal_Init.Struct_Terminal_Init
// 0x0050 (0x0050 - 0x0000)
struct FStruct_Terminal_Init final
{
public:
	double                                        potency_16_bbbe55e24fd1c90646dc759e2bb1b639;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        radius_2_cdc612234ebbd211cef0af8b37fd74e3;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        cooldown_4_4afa074846a28d151a06f48bb807a55e;       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        duration_6_11791bc3423a13b3edc39cae9ce2ec0e;       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        custom_19_439b5b664c3d9c4216db259ad8433f7d;        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 comment_13_3307febf4c80e4cb1d5524935ff7df9a;       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        custom2_24_591f044e4c8218985d1c70ba3d460b65;       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 comment2_25_8ade7e574eae591ca7c3828abf3a8408;      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_Terminal_Init;

}

