#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_WeaponStats

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_WeaponStats.Struct_WeaponStats
// 0x0024 (0x0024 - 0x0000)
struct FStruct_WeaponStats final
{
public:
	float                                         default_44_19dd2e0c4d36676330deabad6e6a5c6c;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         jakobs_51_d5d4e0fe4cf7b880ec074994234c1991;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         daedalus_52_d7fb9cb5457cbb9834abb1a2013838b1;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         vladof_53_6a7944a14e93a099b87969ad950af0b9;        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         torgue_57_da1b9e7e486687dec859a8a260e78af2;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         maliwan_58_3effd9aa4e26939765f2a5a379adcb62;       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         tediore_59_4ab3c1784820d4c98113ad84c6631ebc;       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         borg_62_5cd93b384d8ad48f268758b76391578a;          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         order_63_0a3b418b44cce43dd903adbe2217f70f;         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStruct_WeaponStats;

}

