#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: T_NPC_Echo4_Goodbye_03

#include "Basic.hpp"

#include "GbxGame_structs.hpp"


namespace SDK::Params
{

// Function T_NPC_Echo4_Goodbye_03.T_NPC_Echo4_Goodbye_03_Script_Instanced_C.ExecuteUbergraph_T_NPC_Echo4_Goodbye_03_Script_Instanced
// 0x0020 (0x0020 - 0x0000)
struct T_NPC_Echo4_Goodbye_03_Script_Instanced_C_ExecuteUbergraph_T_NPC_Echo4_Goodbye_03_Script_Instanced final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxTrickEnd                                  K2Node_Event_EndType;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor_1;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_Goodbye_03_Script_Instanced_C_ExecuteUbergraph_T_NPC_Echo4_Goodbye_03_Script_Instanced;

// Function T_NPC_Echo4_Goodbye_03.T_NPC_Echo4_Goodbye_03_Script_Instanced_C.OnBegin_Mut
// 0x0008 (0x0008 - 0x0000)
struct T_NPC_Echo4_Goodbye_03_Script_Instanced_C_OnBegin_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_Goodbye_03_Script_Instanced_C_OnBegin_Mut;

// Function T_NPC_Echo4_Goodbye_03.T_NPC_Echo4_Goodbye_03_Script_Instanced_C.OnEnd_Mut
// 0x0010 (0x0010 - 0x0000)
struct T_NPC_Echo4_Goodbye_03_Script_Instanced_C_OnEnd_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxTrickEnd                                  EndType;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_Goodbye_03_Script_Instanced_C_OnEnd_Mut;

}

