#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: T_NPC_Echo4_Happy_02

#include "Basic.hpp"


namespace SDK::Params
{

// Function T_NPC_Echo4_Happy_02.T_NPC_Echo4_Happy_02_Script_Instanced_C.ExecuteUbergraph_T_NPC_Echo4_Happy_02_Script_Instanced
// 0x0018 (0x0018 - 0x0000)
struct T_NPC_Echo4_Happy_02_Script_Instanced_C_ExecuteUbergraph_T_NPC_Echo4_Happy_02_Script_Instanced final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_GbxTrickNotifyEvent_Actor_1;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxTrickNotifyEvent_Actor;                  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_Happy_02_Script_Instanced_C_ExecuteUbergraph_T_NPC_Echo4_Happy_02_Script_Instanced;

// Function T_NPC_Echo4_Happy_02.T_NPC_Echo4_Happy_02_Script_Instanced_C.GbxTrickNotifyEvt_TrickNotify._NPC.Echo4.Eyes.EmoteOff_Notify
// 0x0008 (0x0008 - 0x0000)
struct T_NPC_Echo4_Happy_02_Script_Instanced_C_GbxTrickNotifyEvt_TrickNotify__NPC_Echo4_Eyes_EmoteOff_Notify final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_Happy_02_Script_Instanced_C_GbxTrickNotifyEvt_TrickNotify__NPC_Echo4_Eyes_EmoteOff_Notify;

// Function T_NPC_Echo4_Happy_02.T_NPC_Echo4_Happy_02_Script_Instanced_C.GbxTrickNotifyEvt_TrickNotify._NPC.Echo4.Eyes.EmoteOn_Notify
// 0x0008 (0x0008 - 0x0000)
struct T_NPC_Echo4_Happy_02_Script_Instanced_C_GbxTrickNotifyEvt_TrickNotify__NPC_Echo4_Eyes_EmoteOn_Notify final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_Happy_02_Script_Instanced_C_GbxTrickNotifyEvt_TrickNotify__NPC_Echo4_Eyes_EmoteOn_Notify;

}

