#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: T_NPC_Echo4_EchoLocate_PointForward

#include "Basic.hpp"

#include "GbxGame_structs.hpp"
#include "GbxEngine_structs.hpp"


namespace SDK::Params
{

// Function T_NPC_Echo4_EchoLocate_PointForward.T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C.Echo4_Get
// 0x0008 (0x0008 - 0x0000)
struct T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C_Echo4_Get final
{
public:
	class AOakDrone*                              Echo4;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C_Echo4_Get;

// Function T_NPC_Echo4_EchoLocate_PointForward.T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C.ExecuteUbergraph_T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced
// 0x0050 (0x0050 - 0x0000)
struct T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C_ExecuteUbergraph_T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor_1;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxTrickEnd                                  K2Node_Event_EndType;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AOakDrone*                              K2Node_DynamicCast_AsOak_Drone;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EQueryInterfaceExec                           CallFunc_ScriptQueryInterface_Exec;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Drone_Echo4_C>    CallFunc_ScriptQueryInterface_ReturnValue;         // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C_ExecuteUbergraph_T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced;

// Function T_NPC_Echo4_EchoLocate_PointForward.T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C.OnBegin_Mut
// 0x0008 (0x0008 - 0x0000)
struct T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C_OnBegin_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C_OnBegin_Mut;

// Function T_NPC_Echo4_EchoLocate_PointForward.T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C.OnEnd_Mut
// 0x0010 (0x0010 - 0x0000)
struct T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C_OnEnd_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxTrickEnd                                  EndType;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_T_NPC_Echo4_EchoLocate_PointForward_Script_Instanced_C_OnEnd_Mut;

}

