#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TLoop_SpawnMesh_Drill_Small

#include "Basic.hpp"

#include "GbxGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TLoop_SpawnMesh_Drill_Small.TLoop_SpawnMesh_Drill_Small_Script_Instanced_C.ExecuteUbergraph_TLoop_SpawnMesh_Drill_Small_Script_Instanced
// 0x0180 (0x0180 - 0x0000)
struct TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_ExecuteUbergraph_TLoop_SpawnMesh_Drill_Small_Script_Instanced final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageTags                            Temp_struct_Variable;                              // 0x0008(0x0020)(ConstParm)
	struct FHitResult                             Temp_struct_Variable_1;                            // 0x0028(0x0100)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Event_Actor_1;                              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxTrickNotifyEvent_Actor_1;                // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_GbxTrickNotifyEvent_Actor;                  // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor;                                // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxTrickEnd                                  K2Node_Event_EndType;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAssociatedActor_ReturnValue;           // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAssociatedActor_ReturnValue_1;         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAssociatedActor_ReturnValue_2;         // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_ExecuteUbergraph_TLoop_SpawnMesh_Drill_Small_Script_Instanced;

// Function TLoop_SpawnMesh_Drill_Small.TLoop_SpawnMesh_Drill_Small_Script_Instanced_C.GbxTrickNotifyEvt_TrickNotify._EnemySpecific_Notify
// 0x0008 (0x0008 - 0x0000)
struct TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_GbxTrickNotifyEvt_TrickNotify__EnemySpecific_Notify final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_GbxTrickNotifyEvt_TrickNotify__EnemySpecific_Notify;

// Function TLoop_SpawnMesh_Drill_Small.TLoop_SpawnMesh_Drill_Small_Script_Instanced_C.GbxTrickNotifyEvt_TrickNotify.Melee.AOE_Notify
// 0x0008 (0x0008 - 0x0000)
struct TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_GbxTrickNotifyEvt_TrickNotify_Melee_AOE_Notify final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_GbxTrickNotifyEvt_TrickNotify_Melee_AOE_Notify;

// Function TLoop_SpawnMesh_Drill_Small.TLoop_SpawnMesh_Drill_Small_Script_Instanced_C.OnBegin_Mut
// 0x0008 (0x0008 - 0x0000)
struct TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_OnBegin_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_OnBegin_Mut;

// Function TLoop_SpawnMesh_Drill_Small.TLoop_SpawnMesh_Drill_Small_Script_Instanced_C.OnEnd_Mut
// 0x0010 (0x0010 - 0x0000)
struct TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_OnEnd_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxTrickEnd                                  EndType;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TLoop_SpawnMesh_Drill_Small_Script_Instanced_C_OnEnd_Mut;

}

