#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GbxAI_structs.hpp"
#include "GbxNav_structs.hpp"
#include "GbxEngine_structs.hpp"
#include "GbxGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxWeapon_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "OakGame_structs.hpp"
#include "RigVM_structs.hpp"


namespace SDK
{

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-inv_attr_effects
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_inv_attr_effects : public FAttributeEffectAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_inv_attr_effects;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-ted_is_mirv
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_ted_is_mirv final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_ted_is_mirv;

// ScriptStruct Transient.HoudiniEvent_SWC
// 0x0048 (0x0048 - 0x0000)
struct FHoudiniEvent_SWC final
{
public:
	struct FVector3f                              position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impulse;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Velocity;                                          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         POINTID;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         time;                                              // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LIFE;                                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         type;                                              // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniEvent_SWC;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Anointment_Base
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_Anointment_Base : public FAnointedPerkAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_Anointment_Base;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Add_GrenadeThrown_CriticalDamage
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_Add_GrenadeThrown_CriticalDamage final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_Add_GrenadeThrown_CriticalDamage;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-explosion
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_explosion : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_explosion;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-generic_explosion
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_generic_explosion final : public Fimpact_response_explosion
{
};
DUMPER7_ASSERTS_Fimpact_response_generic_explosion;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreCameraModeBehavior_2147482315.camera_behavior-ladder
// 0x0000 (0x0748 - 0x0748)
struct Fcamera_behavior_ladder final : public FCameraModeBehavior_Ladder
{
};
DUMPER7_ASSERTS_Fcamera_behavior_ladder;

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChaosDestructionEvent_SWC;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-ammo_switcher_challenge_tags
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_ammo_switcher_challenge_tags : public FWeaponDamageTypeAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_ammo_switcher_challenge_tags;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-ammo_switcher_challenge_tags_SG
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_ammo_switcher_challenge_tags_SG final : public Finv_aspect_ammo_switcher_challenge_tags
{
};
DUMPER7_ASSERTS_Finv_aspect_ammo_switcher_challenge_tags_SG;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_DoubleBarrel
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_DoubleBarrel final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_DoubleBarrel;

// ScriptStruct Transient.GbxValue_bool
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_bool final
{
public:
	uint8                                         Bool : 1;                                          // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1[0x27];                                       // 0x0001(0x0027)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_bool;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_leech_seed_damage
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_leech_seed_damage final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_leech_seed_damage;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-GoreImpactResponse_Global_Splatter
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_GoreImpactResponse_Global_Splatter final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_GoreImpactResponse_Global_Splatter;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_DoubleFlintlocks
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_DoubleFlintlocks final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_DoubleFlintlocks;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Weapon_Shield
// 0x0000 (0x0078 - 0x0078)
struct Finv_aspect_Weapon_Shield : public FWeaponUseModeBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_Weapon_Shield;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-weapon_shield_ricochet
// 0x0000 (0x0078 - 0x0078)
struct Finv_aspect_weapon_shield_ricochet : public Finv_aspect_Weapon_Shield
{
};
DUMPER7_ASSERTS_Finv_aspect_weapon_shield_ricochet;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-weapon_shield_ricochet_TED
// 0x0000 (0x0078 - 0x0078)
struct Finv_aspect_weapon_shield_ricochet_TED final : public Finv_aspect_weapon_shield_ricochet
{
};
DUMPER7_ASSERTS_Finv_aspect_weapon_shield_ricochet_TED;

// ScriptStruct Transient.GbxValue_Int
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_Int final
{
public:
	int32                                         Int;                                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x24];                                       // 0x0004(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_Int;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-ted_is_homing
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_ted_is_homing final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_ted_is_homing;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-Footstep
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_Footstep final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_Footstep;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_Dynamite_Launcher
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_Dynamite_Launcher final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_Dynamite_Launcher;

// ScriptStruct Transient.GbxValue_float
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_float final
{
public:
	float                                         float_0;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x24];                                       // 0x0004(0x0024)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_float;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-repair_kit_curative
// 0x0000 (0x0030 - 0x0030)
struct Finv_aspect_repair_kit_curative final : public FRepairKitCurativeAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_repair_kit_curative;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-weapon_audio_Tor_Mag_Sticky
// 0x0000 (0x0208 - 0x0208)
struct Finv_aspect_weapon_audio_Tor_Mag_Sticky final : public FOakWeaponAudioAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_weapon_audio_Tor_Mag_Sticky;

// ScriptStruct Transient.GbxValue_Vector
// 0x0028 (0x0028 - 0x0000)
struct FGbxValue_Vector final
{
public:
	struct FVector                                Vector;                                            // 0x0000(0x0018)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_Vector;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-barrier_aspect
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_barrier_aspect : public FTerminalBarrierAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_barrier_aspect;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_barred_aggression
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_behavior_barred_aggression final : public Finv_aspect_barrier_aspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_barred_aggression;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_fire_projectile : public FWeaponUseModeAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_fire_projectile;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-sg_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_sg_fire_projectile : public Finv_aspect_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_sg_fire_projectile;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-ted_sg_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_ted_sg_fire_projectile final : public Finv_aspect_sg_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_ted_sg_fire_projectile;

// ScriptStruct Transient.GbxValue_Rotator
// 0x0028 (0x0028 - 0x0000)
struct FGbxValue_Rotator final
{
public:
	struct FRotator                               Rotator;                                           // 0x0000(0x0018)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_Rotator;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-generic_explosion_large
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_generic_explosion_large final : public Fimpact_response_explosion
{
};
DUMPER7_ASSERTS_Fimpact_response_generic_explosion_large;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-tediore_payload_combo
// 0x0000 (0x0058 - 0x0058)
struct Finv_aspect_tediore_payload_combo final : public FGrenadeBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_tediore_payload_combo;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-weapon_audio_Mal_Mode2_Fire
// 0x0000 (0x0208 - 0x0208)
struct Finv_aspect_weapon_audio_Mal_Mode2_Fire final : public FOakWeaponAudioAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_weapon_audio_Mal_Mode2_Fire;

// ScriptStruct Transient.GbxValue_Object
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_Object final
{
public:
	TWeakObjectPtr<class UObject>                 Object;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_Object;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-tediore_payload_mirv
// 0x0000 (0x0058 - 0x0058)
struct Finv_aspect_tediore_payload_mirv final : public FGrenadeBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_tediore_payload_mirv;

// ScriptStruct Transient.GbxValue_Actor
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_Actor final
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_Actor;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_anointed_movement_speed
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_behavior_anointed_movement_speed final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_anointed_movement_speed;

// ScriptStruct Transient.BookmarkStruct_0
// 0x0018 (0x0018 - 0x0000)
struct FBookmarkStruct_0 final
{
public:
	class FString                                 app_language;                                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Tag;                                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBookmarkStruct_0;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-hw_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_hw_fire_projectile : public Finv_aspect_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_hw_fire_projectile;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_weapon_shotgun_init
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_turret_weapon_shotgun_init final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_weapon_shotgun_init;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-weapon_shield_ricochet_MAL
// 0x0000 (0x0078 - 0x0078)
struct Finv_aspect_weapon_shield_ricochet_MAL final : public Finv_aspect_weapon_shield_ricochet
{
};
DUMPER7_ASSERTS_Finv_aspect_weapon_shield_ricochet_MAL;

// ScriptStruct Transient.GbxValue_String
// 0x0028 (0x0028 - 0x0000)
struct FGbxValue_String final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_String;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-weapon_override_def
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_weapon_override_def : public FWeaponOverrideDefAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_weapon_override_def;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_MAL_Corrosive_Mode_01
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_MAL_Corrosive_Mode_01 final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_MAL_Corrosive_Mode_01;


// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-Generic
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_Generic final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_Generic;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_MAL_Corrosive_Mode_02
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_MAL_Corrosive_Mode_02 final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_MAL_Corrosive_Mode_02;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-dad_sg_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_dad_sg_fire_projectile final : public Finv_aspect_sg_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_dad_sg_fire_projectile;

// ScriptStruct Transient.GbxValue_attribute
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_attribute final
{
public:
	FGameDataHandleProperty_                      attribute;                                         // 0x0000(0x0018)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_attribute;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-ted_lasersight_3rd
// 0x0000 (0x0118 - 0x0118)
struct Finv_aspect_ted_lasersight_3rd final : public FInventoryBodyParticleEffectAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_ted_lasersight_3rd;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-GoreImpactResponse_Global_Limb
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_GoreImpactResponse_Global_Limb final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_GoreImpactResponse_Global_Limb;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_MAL_Cryo_Mode_01
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_MAL_Cryo_Mode_01 final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_MAL_Cryo_Mode_01;

// ScriptStruct Transient.GbxValue_NumericRange
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_NumericRange final
{
public:
	struct FNumericRange                          NumericRange;                                      // 0x0000(0x0008)(NoDestructor)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_NumericRange;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-stat_group_health
// 0x0000 (0x0040 - 0x0040)
struct Finv_aspect_stat_group_health final : public FClassModStatGroupAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_stat_group_health;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Weapon_Mat_DAD_Epic
// 0x0000 (0x0080 - 0x0080)
struct Finv_aspect_Weapon_Mat_DAD_Epic final : public FInventoryMaterialsDataAssetAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_Weapon_Mat_DAD_Epic;

// ScriptStruct Transient.GbxValue_TargetInfo
// 0x0028 (0x0028 - 0x0000)
struct FGbxValue_TargetInfo final
{
public:
	struct FTargetInfoRef                         TargetInfo;                                        // 0x0000(0x0018)(NoDestructor)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_TargetInfo;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_Proximity_mine
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_Proximity_mine final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_Proximity_mine;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_dome
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_behavior_dome final : public Finv_aspect_barrier_aspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_dome;

// ScriptStruct Transient.GbxValue_GraphNodeOutput
// 0x0028 (0x0028 - 0x0000)
struct FGbxValue_GraphNodeOutput final
{
public:
	struct FGbxGraphNodeOutputRef                 GraphNodeOutput;                                   // 0x0000(0x0018)()
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_GraphNodeOutput;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-order_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_order_fire_projectile : public Finv_aspect_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_order_fire_projectile;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-weapon_chamber_ammo_control
// 0x0000 (0x0058 - 0x0058)
struct Finv_aspect_weapon_chamber_ammo_control final : public FInventoryBodyControlAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_weapon_chamber_ammo_control;

// ScriptStruct Transient.GbxValue_SceneComponent
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_SceneComponent final
{
public:
	TWeakObjectPtr<class USceneComponent>         SceneComponent;                                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_SceneComponent;

// ScriptStruct Transient.GbxValue_DataTable
// 0x0028 (0x0028 - 0x0000)
struct FGbxValue_DataTable final
{
public:
	struct FDataTableValueHandle                  DataTable;                                         // 0x0000(0x0028)(NoDestructor)
};
DUMPER7_ASSERTS_FGbxValue_DataTable;

// PropertyBag Transient.PropertyBag_3117f4866bccf714
// 0x0120 (0x0120 - 0x0000)
struct FPropertyBag_3117f4866bccf714 final
{
public:
	struct FRigElementKey                         RigVMModel___SetRotation_1_1_1_1_Item__Const;      // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SetRotation_1_1_1_1_Space__Const;     // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetRotation_1_1_1_1_bInitial__Const;  // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___GetTransform_5_1_1_1_1_Item__Const;   // 0x0010(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetTransform_5_2_1_1_bInitial__Const; // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___MathQuaternionSwingTwist_3_1_1_1_TwistAxis__Const; // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___SetRotation_1_1_1_1_Weight__Const;    // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_1_1_Item__Const;        // 0x003C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_5_1_1_1_Item__Const;     // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_1_2_Item__Const;        // 0x0054(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_5_1_1_2_Item__Const;     // 0x0060(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_4_1_2_B__Const;   // 0x0070(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_4_1_2_T__Const;   // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_Item__Const;          // 0x0094(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_4_1_1_1_T__Const; // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_Item__Const;          // 0x00A4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_5_1_2_Item__Const;       // 0x00B0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_4_2_T__Const;     // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_Item__Const;            // 0x00C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_1_Item__Const;          // 0x00CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_5_1_1_Item__Const;       // 0x00D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_Item__Const;            // 0x00E4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_Item__Const;            // 0x00F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___GetTransform_5_1_Item__Const;         // 0x00FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_Item__Const;              // 0x0108(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_3117f4866bccf714;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Add_GadgetUsed_Damage_HeavyWeapon
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_Add_GadgetUsed_Damage_HeavyWeapon final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_Add_GadgetUsed_Damage_HeavyWeapon;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_DAD_SG_Singularity
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_DAD_SG_Singularity final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_DAD_SG_Singularity;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-ps_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_ps_fire_projectile : public Finv_aspect_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_ps_fire_projectile;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-ted_ps_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_ted_ps_fire_projectile final : public Finv_aspect_ps_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_ted_ps_fire_projectile;

// ScriptStruct Transient.GbxValue_GraphParam
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_GraphParam final
{
public:
	struct FGbxGraphParamRef                      GraphParam;                                        // 0x0000(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x1C];                                       // 0x000C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_GraphParam;

// ScriptStruct Transient.GbxValue_Name
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_Name final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_Name;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-tediore_payload_shooting
// 0x0000 (0x0058 - 0x0058)
struct Finv_aspect_tediore_payload_shooting final : public FGrenadeBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_tediore_payload_shooting;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Add_ConsecutiveHits_WeaponDamage
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_Add_ConsecutiveHits_WeaponDamage final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_Add_ConsecutiveHits_WeaponDamage;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_Taser
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_Taser final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_Taser;

// ScriptStruct Transient.GbxValue_blackboard
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_blackboard final
{
public:
	struct FGbxBlackboardEntryRef                 blackboard;                                        // 0x0000(0x000C)(NoDestructor)
	uint8                                         Pad_C[0x1C];                                       // 0x000C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_blackboard;

// ScriptStruct Transient.GbxValue_Double
// 0x0028 (0x0028 - 0x0000)
struct FGbxValue_Double final
{
public:
	double                                        Double;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_Double;

// ScriptStruct Transient.GbxValue_MissionAliasRef
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_MissionAliasRef final
{
public:
	struct FMissionAliasRef                       MissionAliasRef;                                   // 0x0000(0x000C)(NoDestructor)
	uint8                                         Pad_C[0x1C];                                       // 0x000C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_MissionAliasRef;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_manufacturer_ted_init
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_turret_manufacturer_ted_init final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_manufacturer_ted_init;

// ScriptStruct Transient.GbxValue_LinearColor
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_LinearColor final
{
public:
	struct FLinearColor                           LinearColor;                                       // 0x0000(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_LinearColor;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_longrifle_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_turret_longrifle_fire_projectile final : public Finv_aspect_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_longrifle_fire_projectile;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_Semtex
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_Semtex final : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_Semtex;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-term_aug_healing_init
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_term_aug_healing_init final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_term_aug_healing_init;

// ScriptStruct Transient.GbxValue_Text
// 0x0028 (0x0028 - 0x0000)
struct FGbxValue_Text final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)()
	uint8                                         Pad_10[0x18];                                      // 0x0010(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_Text;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_TOR_Sticky_Mode2
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_TOR_Sticky_Mode2 : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_TOR_Sticky_Mode2;

// ScriptStruct Transient.GbxValue_Asset
// 0x0028 (0x0028 - 0x0000)
struct FGbxValue_Asset final
{
public:
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x0000(0x0028)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FGbxValue_Asset;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-generic_jakobs_grenade
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_generic_jakobs_grenade final : public Fimpact_response_explosion
{
};
DUMPER7_ASSERTS_Fimpact_response_generic_jakobs_grenade;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_weapon_attr_effects
// 0x0000 (0x00D8 - 0x00D8)
struct Finv_aspect_turret_weapon_attr_effects : public FTurretWeaponAttributeEffectAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_weapon_attr_effects;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_init
// 0x0000 (0x00D8 - 0x00D8)
struct Finv_aspect_turret_init final : public Finv_aspect_turret_weapon_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_init;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-BioArmor_Bullet
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_BioArmor_Bullet final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_BioArmor_Bullet;

// ScriptStruct Transient.GbxValue_GbxDef
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_GbxDef final
{
public:
	FGbxDefPtrProperty_                           GbxDef;                                            // 0x0000(0x0018)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x10];                                      // 0x0018(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_GbxDef;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_weapon_beam_init
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_turret_weapon_beam_init final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_weapon_beam_init;

// ScriptStruct Transient.GbxValue_DialogEnumValue
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_DialogEnumValue final
{
public:
	struct FDialogEnumValue                       DialogEnumValue;                                   // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_DialogEnumValue;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_manufacturer_vla_init
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_turret_manufacturer_vla_init final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_manufacturer_vla_init;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_fire_rate_on_use
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_behavior_fire_rate_on_use final : public FInventoryAugmentAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_fire_rate_on_use;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-Grassboss_GroundPound_Large
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_Grassboss_GroundPound_Large final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_Grassboss_GroundPound_Large;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-UMN_TOR_Impact_Mode2
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_UMN_TOR_Impact_Mode2 : public FWeaponUseModeNameAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_UMN_TOR_Impact_Mode2;

// ScriptStruct Transient.GbxValue_GameplayTag
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FGbxValue_GameplayTag final
{
public:
	struct FGameplayTag                           GameplayTag;                                       // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FGbxValue_GameplayTag;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-inst_attr_effects
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_inst_attr_effects : public FAttributeEffectAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_inst_attr_effects;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-barrel_inst_attr_base_values
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_barrel_inst_attr_base_values final : public Finv_aspect_inst_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_barrel_inst_attr_base_values;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-Grassboss_Ballista_Impact
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_Grassboss_Ballista_Impact final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_Grassboss_Ballista_Impact;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-generic_cloud_medium
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_generic_cloud_medium final : public Fimpact_response_explosion
{
};
DUMPER7_ASSERTS_Fimpact_response_generic_cloud_medium;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_manufacturer_jak_init
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_turret_manufacturer_jak_init final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_manufacturer_jak_init;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-Grassboss_ProjectileExplosion
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_Grassboss_ProjectileExplosion final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_Grassboss_ProjectileExplosion;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_contamination_enemy
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_contamination_enemy final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_contamination_enemy;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-FoleyImpact_DefaultResponse
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_FoleyImpact_DefaultResponse final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_FoleyImpact_DefaultResponse;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-Bullet
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_Bullet final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_Bullet;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-scope
// 0x0000 (0x0078 - 0x0078)
struct Finv_aspect_scope : public FWeaponUseModeBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_scope;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-sight_6_5x
// 0x0000 (0x0078 - 0x0078)
struct Finv_aspect_sight_6_5x final : public Finv_aspect_scope
{
};
DUMPER7_ASSERTS_Finv_aspect_sight_6_5x;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-generic_explosion_huge
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_generic_explosion_huge final : public Fimpact_response_explosion
{
};
DUMPER7_ASSERTS_Fimpact_response_generic_explosion_huge;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-generic_explosion_small
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_generic_explosion_small final : public Fimpact_response_explosion
{
};
DUMPER7_ASSERTS_Fimpact_response_generic_explosion_small;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_manufacturer_tor_init
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_turret_manufacturer_tor_init final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_manufacturer_tor_init;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-GoreImpactResponse_Global_FullBodyGib
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_GoreImpactResponse_Global_FullBodyGib final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_GoreImpactResponse_Global_FullBodyGib;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreImpactResponse_2147482409.impact_response-GoreImpactResponse_Mech_Limb
// 0x0000 (0x0210 - 0x0210)
struct Fimpact_response_GoreImpactResponse_Mech_Limb final : public FImpactResponseEffect
{
};
DUMPER7_ASSERTS_Fimpact_response_GoreImpactResponse_Mech_Limb;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_type
// 0x0000 (0x00D0 - 0x00D0)
struct Finv_aspect_turret_type final : public FTurretTypeAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_type;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Sway
// 0x0000 (0x0078 - 0x0078)
struct Finv_aspect_Sway final : public FWeaponUseModeBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_Sway;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-tor_hw_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_tor_hw_fire_projectile final : public Finv_aspect_hw_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_tor_hw_fire_projectile;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-hw_fire_projectile_charge
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_hw_fire_projectile_charge : public Finv_aspect_order_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_hw_fire_projectile_charge;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-sight_5_5x
// 0x0000 (0x0078 - 0x0078)
struct Finv_aspect_sight_5_5x final : public Finv_aspect_scope
{
};
DUMPER7_ASSERTS_Finv_aspect_sight_5_5x;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-tor_hw_fire_projectile_charge
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_tor_hw_fire_projectile_charge final : public Finv_aspect_hw_fire_projectile_charge
{
};
DUMPER7_ASSERTS_Finv_aspect_tor_hw_fire_projectile_charge;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Add_GadgetUsed_Damage_Grenade
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_Add_GadgetUsed_Damage_Grenade final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_Add_GadgetUsed_Damage_Grenade;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-sight_7_5x
// 0x0000 (0x0078 - 0x0078)
struct Finv_aspect_sight_7_5x final : public Finv_aspect_scope
{
};
DUMPER7_ASSERTS_Finv_aspect_sight_7_5x;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Add_GunKill_MoveSpeedReloadSpeed
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_Add_GunKill_MoveSpeedReloadSpeed final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_Add_GunKill_MoveSpeedReloadSpeed;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Add_HealthFull_SplashDamageSplashRadius
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_Add_HealthFull_SplashDamageSplashRadius final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_Add_HealthFull_SplashDamageSplashRadius;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-stat_modifiers
// 0x0000 (0x0048 - 0x0048)
struct Finv_aspect_stat_modifiers : public FStatModifierAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_stat_modifiers;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Add_HeavyWeaponEquipped_SpecifcElementDamage
// 0x0000 (0x0030 - 0x0030)
struct Finv_aspect_Add_HeavyWeaponEquipped_SpecifcElementDamage final : public FInventoryAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_Add_HeavyWeaponEquipped_SpecifcElementDamage;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-Add_ShieldBreak_CriticalDamage
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_Add_ShieldBreak_CriticalDamage final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_Add_ShieldBreak_CriticalDamage;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-augment_invincibility
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_augment_invincibility final : public FInventoryAugmentAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_augment_invincibility;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-augment_universal_speed
// 0x0000 (0x0030 - 0x0030)
struct Finv_aspect_augment_universal_speed final : public FInventoryAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_augment_universal_speed;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-ted_is_combo
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_ted_is_combo final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_ted_is_combo;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_anointed_health_regen
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_behavior_anointed_health_regen final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_anointed_health_regen;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_anointed_weapon_damage
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_behavior_anointed_weapon_damage final : public Finv_aspect_Anointment_Base
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_anointed_weapon_damage;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_buff_power_barrier
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_behavior_buff_power_barrier final : public FInventoryAugmentAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_buff_power_barrier;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-shd_aug_eng_recharge_delay
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_shd_aug_eng_recharge_delay final : public FInventoryAugmentAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_shd_aug_eng_recharge_delay;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_buff_power_combat
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_buff_power_combat final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_buff_power_combat;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_chaingun_fire_projectile
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_turret_chaingun_fire_projectile final : public Finv_aspect_fire_projectile
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_chaingun_fire_projectile;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_buff_power_health
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_buff_power_health final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_buff_power_health;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_damage_increase
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_damage_increase final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_damage_increase;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_delayed_gratification
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_delayed_gratification final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_delayed_gratification;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-shd_aug_eng_trigger_happy
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_shd_aug_eng_trigger_happy final : public FInventoryAugmentAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_shd_aug_eng_trigger_happy;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-terminal_spawn_actor
// 0x0000 (0x0058 - 0x0058)
struct Finv_aspect_terminal_spawn_actor final : public FGrenadeBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_terminal_spawn_actor;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_healing_power
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_behavior_healing_power final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_healing_power;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_health_decay
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_health_decay final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_health_decay;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_leech_seed_health
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_leech_seed_health final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_leech_seed_health;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-shd_aug_ra_bladed
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_shd_aug_ra_bladed final : public FInventoryAugmentAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_shd_aug_ra_bladed;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_reload_speed
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_behavior_reload_speed final : public FInventoryAugmentAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_reload_speed;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_manufacturer_ord_init
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_turret_manufacturer_ord_init final : public Finv_aspect_inv_attr_effects
{
};
DUMPER7_ASSERTS_Finv_aspect_turret_manufacturer_ord_init;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_reverb_nova_on_ground_slam
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_reverb_nova_on_ground_slam final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_reverb_nova_on_ground_slam;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-behavior_speed_boost
// 0x0000 (0x0088 - 0x0088)
struct Finv_aspect_behavior_speed_boost final : public FTerminalBehaviorAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_behavior_speed_boost;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-BodyMag_InvPartValue
// 0x0000 (0x00D0 - 0x00D0)
struct Finv_aspect_BodyMag_InvPartValue final : public FWeaponAttributeEffectAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_BodyMag_InvPartValue;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-shd_aug_ra_knockback
// 0x0000 (0x0050 - 0x0050)
struct Finv_aspect_shd_aug_ra_knockback final : public FInventoryAugmentAspect
{
};
DUMPER7_ASSERTS_Finv_aspect_shd_aug_ra_knockback;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-bor_hw_fire_projectile_charge
// 0x0000 (0x0060 - 0x0060)
struct Finv_aspect_bor_hw_fire_projectile_charge final : public Finv_aspect_hw_fire_projectile_charge
{
};
DUMPER7_ASSERTS_Finv_aspect_bor_hw_fire_projectile_charge;

// NexusScriptStruct Transient.NexusContentLoader_2147482617.NexusConfigStoreInventoryAspect_2147482377.inv_aspect-turret_base_ground_init
// 0x0000 (0x00C0 - 0x00C0)
struct Finv_aspect_turret_base_ground_init final : public Finv_aspect_inv_attr_effects
{
};
