#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trick_CE_Digistruct_Out

#include "Basic.hpp"

#include "GbxAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "GbxGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trick_CE_Digistruct_Out.Trick_CE_Digistruct_Out_Script_Instanced_C
// 0x00C0 (0x0100 - 0x0040)
class UTrick_CE_Digistruct_Out_Script_Instanced_C final : public UGbxTrickScript
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0040(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGbxAudioEvent                         DigistructOut;                                     // 0x0048(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Sphere_Radius;                                     // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGbxAudioEmitterSource                 Socket_Transform;                                  // 0x0080(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_Trick_CE_Digistruct_Out_Script_Instanced(int32 entrypoint);
	void OnBegin_Mut(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Trick_CE_Digistruct_Out_Script_Instanced_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Trick_CE_Digistruct_Out_Script_Instanced_C")
	}
	static class UTrick_CE_Digistruct_Out_Script_Instanced_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTrick_CE_Digistruct_Out_Script_Instanced_C>();
	}
};
DUMPER7_ASSERTS_UTrick_CE_Digistruct_Out_Script_Instanced_C;

}

