#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TrickScriptLoop_SpawnMesh_Dropship

#include "Basic.hpp"

#include "GbxGame_structs.hpp"


namespace SDK::Params
{

// Function TrickScriptLoop_SpawnMesh_Dropship.TrickScriptLoop_SpawnMesh_Dropship_C.ExecuteUbergraph_TrickScriptLoop_SpawnMesh_Dropship
// 0x0038 (0x0038 - 0x0000)
struct TrickScriptLoop_SpawnMesh_Dropship_C_ExecuteUbergraph_TrickScriptLoop_SpawnMesh_Dropship final
{
public:
	int32                                         entrypoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor;                                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxTrickEnd                                  K2Node_Event_EndType;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor_3;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_loopCount;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Actor_2;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Actor_1;                              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TrickScriptLoop_SpawnMesh_Dropship_C_ExecuteUbergraph_TrickScriptLoop_SpawnMesh_Dropship;

// Function TrickScriptLoop_SpawnMesh_Dropship.TrickScriptLoop_SpawnMesh_Dropship_C.OnBegin_Mut
// 0x0008 (0x0008 - 0x0000)
struct TrickScriptLoop_SpawnMesh_Dropship_C_OnBegin_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TrickScriptLoop_SpawnMesh_Dropship_C_OnBegin_Mut;

// Function TrickScriptLoop_SpawnMesh_Dropship.TrickScriptLoop_SpawnMesh_Dropship_C.OnEnd_Mut
// 0x0010 (0x0010 - 0x0000)
struct TrickScriptLoop_SpawnMesh_Dropship_C_OnEnd_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EGbxTrickEnd                                  EndType;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TrickScriptLoop_SpawnMesh_Dropship_C_OnEnd_Mut;

// Function TrickScriptLoop_SpawnMesh_Dropship.TrickScriptLoop_SpawnMesh_Dropship_C.OnLoop_Mut
// 0x0010 (0x0010 - 0x0000)
struct TrickScriptLoop_SpawnMesh_Dropship_C_OnLoop_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         LoopCount;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TrickScriptLoop_SpawnMesh_Dropship_C_OnLoop_Mut;

// Function TrickScriptLoop_SpawnMesh_Dropship.TrickScriptLoop_SpawnMesh_Dropship_C.OnLoopEnd_Mut
// 0x0008 (0x0008 - 0x0000)
struct TrickScriptLoop_SpawnMesh_Dropship_C_OnLoopEnd_Mut final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TrickScriptLoop_SpawnMesh_Dropship_C_OnLoopEnd_Mut;

}

