#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ui_script_lobby

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GbxAudio_structs.hpp"


namespace SDK::Params
{

// Function ui_script_lobby.ui_script_lobby_C.ListExpanded
// 0x0048 (0x0048 - 0x0000)
struct ui_script_lobby_C_ListExpanded final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FGbxDefPtrProperty_                           OwningWidgetDef;                                   // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              position;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAudioPlaybackInstance              CallFunc_PostUIEvent_ReturnValue;                  // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_ui_script_lobby_C_ListExpanded;

// Function ui_script_lobby.ui_script_lobby_C.ListCollapsed
// 0x0048 (0x0048 - 0x0000)
struct ui_script_lobby_C_ListCollapsed final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FGbxDefPtrProperty_                           OwningWidgetDef;                                   // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              position;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAudioPlaybackInstance              CallFunc_PostUIEvent_ReturnValue;                  // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_ui_script_lobby_C_ListCollapsed;

}

