#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponNamingStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct WeaponNamingStruct.WeaponNamingStruct
// 0x00A0 (0x00A0 - 0x0000)
struct FWeaponNamingStruct final
{
public:
	class FText                                   Single_18_240AB1EB411BED6B469DCCBB545AE6A2;        // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   Damage_2_9DFA8E9A4AF1B3A1426429A84B370140;         // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FText                                   CritDamage_9_C4432C8C40CA15F089340A8128E201D6;     // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FText                                   FireRate_10_459C49044DE26DE5F545829A046312F3;      // 0x0030(0x0010)(Edit, BlueprintVisible)
	class FText                                   ReloadSpeed_11_61FAACA14D48B6092CF84BB3D5998CC4;   // 0x0040(0x0010)(Edit, BlueprintVisible)
	class FText                                   MagSize_12_C735EA434D50CD82FA24F0A01110B29B;       // 0x0050(0x0010)(Edit, BlueprintVisible)
	class FText                                   Accuracy_13_5B35CC194CB71AE47F35FB94721D3DA9;      // 0x0060(0x0010)(Edit, BlueprintVisible)
	class FText                                   ElementalPower_14_842A58234E5D5D791C5A059F9B6CAF17; // 0x0070(0x0010)(Edit, BlueprintVisible)
	class FText                                   ADSProficiency_16_02D519604FE47BA5067ACEBD1270CB2F; // 0x0080(0x0010)(Edit, BlueprintVisible)
	class FText                                   DamageRadius_21_EE89495D493F3450B8EEF095F6E0CFA1;  // 0x0090(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FWeaponNamingStruct;

}

