#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WyvrnSDKPlugin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class WyvrnSDKPlugin.ChromaEventListener
// 0x0118 (0x0140 - 0x0028)
class UChromaEventListener final : public UBlueprintFunctionLibrary
{
public:
	bool                                          bIsInitialized;                                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTitleScreenLoaded;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentCharName;                                   // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 CurrentActionSkill;                                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	FGbxDefPtrProperty_                           SkillActivatedEventDef;                            // 0x0060(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FGbxDefPtrProperty_                           SkillDeactivatedEventDef;                          // 0x0078(0x0018)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0xB0];                                      // 0x0090(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void JumpEvent(int32 JumpCount);
	void OnEndPlay(class AActor* Actor, EEndPlayReason EndPlayReason);
	void OnIsAnyMenuOpen(bool bIsAnyMenyOpen);
	void StartAirDash();
	void StartSlide();
	void StopGroundSlamEvent(const struct FGroundSlamEndedDetails& Details);
	void StopSlide(const struct FSlideEndedDetails& Details);
	void WeaponChangedEvent(class AWeapon* NewWeapon, class AWeapon* LastWeapon);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChromaEventListener")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChromaEventListener")
	}
	static class UChromaEventListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChromaEventListener>();
	}
};
DUMPER7_ASSERTS_UChromaEventListener;

// Class WyvrnSDKPlugin.WyvrnSDKPluginBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UWyvrnSDKPluginBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool IsInitialized();
	static int32 SetEventName(const class FString& Name_0);
	static int32 WyvrnSDKInitSDK(const struct FWyvrnSDKAppInfoType& appInfo);
	static int32 WyvrnSDKUnInit();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WyvrnSDKPluginBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WyvrnSDKPluginBPLibrary")
	}
	static class UWyvrnSDKPluginBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWyvrnSDKPluginBPLibrary>();
	}
};
DUMPER7_ASSERTS_UWyvrnSDKPluginBPLibrary;

}

