#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WyvrnSDKPlugin

#include "Basic.hpp"

#include "GbxGame_structs.hpp"
#include "WyvrnSDKPlugin_structs.hpp"
#include "Engine_structs.hpp"
#include "OakGame_structs.hpp"


namespace SDK::Params
{

// Function WyvrnSDKPlugin.ChromaEventListener.JumpEvent
// 0x0004 (0x0004 - 0x0000)
struct ChromaEventListener_JumpEvent final
{
public:
	int32                                         JumpCount;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChromaEventListener_JumpEvent;

// Function WyvrnSDKPlugin.ChromaEventListener.OnEndPlay
// 0x0010 (0x0010 - 0x0000)
struct ChromaEventListener_OnEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ChromaEventListener_OnEndPlay;

// Function WyvrnSDKPlugin.ChromaEventListener.OnIsAnyMenuOpen
// 0x0001 (0x0001 - 0x0000)
struct ChromaEventListener_OnIsAnyMenuOpen final
{
public:
	bool                                          bIsAnyMenyOpen;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChromaEventListener_OnIsAnyMenuOpen;

// Function WyvrnSDKPlugin.ChromaEventListener.StopGroundSlamEvent
// 0x0048 (0x0048 - 0x0000)
struct ChromaEventListener_StopGroundSlamEvent final
{
public:
	struct FGroundSlamEndedDetails                Details;                                           // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChromaEventListener_StopGroundSlamEvent;

// Function WyvrnSDKPlugin.ChromaEventListener.StopSlide
// 0x0020 (0x0020 - 0x0000)
struct ChromaEventListener_StopSlide final
{
public:
	struct FSlideEndedDetails                     Details;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChromaEventListener_StopSlide;

// Function WyvrnSDKPlugin.ChromaEventListener.WeaponChangedEvent
// 0x0010 (0x0010 - 0x0000)
struct ChromaEventListener_WeaponChangedEvent final
{
public:
	class AWeapon*                                NewWeapon;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWeapon*                                LastWeapon;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChromaEventListener_WeaponChangedEvent;

// Function WyvrnSDKPlugin.WyvrnSDKPluginBPLibrary.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct WyvrnSDKPluginBPLibrary_IsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WyvrnSDKPluginBPLibrary_IsInitialized;

// Function WyvrnSDKPlugin.WyvrnSDKPluginBPLibrary.SetEventName
// 0x0018 (0x0018 - 0x0000)
struct WyvrnSDKPluginBPLibrary_SetEventName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WyvrnSDKPluginBPLibrary_SetEventName;

// Function WyvrnSDKPlugin.WyvrnSDKPluginBPLibrary.WyvrnSDKInitSDK
// 0x0050 (0x0050 - 0x0000)
struct WyvrnSDKPluginBPLibrary_WyvrnSDKInitSDK final
{
public:
	struct FWyvrnSDKAppInfoType                   appInfo;                                           // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WyvrnSDKPluginBPLibrary_WyvrnSDKInitSDK;

// Function WyvrnSDKPlugin.WyvrnSDKPluginBPLibrary.WyvrnSDKUnInit
// 0x0004 (0x0004 - 0x0000)
struct WyvrnSDKPluginBPLibrary_WyvrnSDKUnInit final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WyvrnSDKPluginBPLibrary_WyvrnSDKUnInit;

}

